:READ  BEGIN    ASSEMBLE C1 WORK    3/26/19  21:59
*                                                                     * 00000100
*        THIS PROGRAM SCANS THE DATA STRUCTURE BEGINNIMG AT OPOINT    * 00000200
*        IT SEYS UP A DISPLAY, TAGAREA,LINETABLE, DISPLAY MAP,        * 00000300
*        AND TAG-LINK FILE                                            * 00000400
*                                                                     * 00000500
*********************************************************************** 00000600
*                                                                     * 00000700
*********************************************************************** 00000800
*        REGISTER USAGE                                               * 00000900
*                                                                     * 00001000
*        R0:   GENEREAL WORK REGISTER                                 * 00001100
*        R1:   GENERAL WORK REGISTER                                  * 00001200
*        R2:   CURRENT BUFFER ADDRESS                                 * 00001300
*        R3:   GENERAL WORK REGISTER                                  * 00001400
*        R4:   POINTER INTO DISPLAY(WHERE TO PUT NEXT ENTRY)          * 00001500
*        R5:   LENTH TO BE MOVED( USED BY PUTINBF AND PUTINTF)        * 00001600
*        R6:   DISPLACEMENT WITHIN ORDER(USED BY PUTINBUF AND PUTINTF)* 00001700
*        R7:   MISCELANEOUS JUNK; NOT USED FOR ANYTHING INPORTZANT    * 00001800
*        R8:   POINTER INTO DISPLAT MAP( LOWER PORTION)               * 00001900
*        R9:   DISPLACEMENT IN DATA                                   * 00002000
*        R10:  POINTS TO TOP OF DATA                                  * 00002100
*        R11:  DISPLACEMENT IN ORDERS                                 * 00002200
*        R12:  POINTS TO TOP OF ORDERS                                * 00002300
*        R13:  BASE REGISTER                                          * 00002400
*        R14:  CURRENT SPACE ON SCOPE LINE                            * 00002500
*        R15:  USED IN BAL'ING TO SUBROUINES                          * 00002600
*********************************************************************** 00002700
        EJECT                                                           00002800
         MACRO                                                          00002900
&LAB     SAVE   &CSECT=NO                                               00003000
         GBLB   &SAVEXST,&INIT                                          00003100
         LCLC  &NAME               THE LABEL TO BE PUT ON THE STM       00003200
.*                                                                      00003300
.*       &INIT     WHETHER OR NOT TO GENEREATE A 'DROP 13'              00003400
.*       &SAVEXST  WHETHER OR NOT TO GENERATE THE DC FOR THE SAVEAREA   00003500
.*                                                                      00003600
&NAME    SETC  '&LAB'                                                   00003700
         AIF   ('&CSECT' NE 'YES').NOSECT                               00003800
&LAB     CSECT                                                          00003900
&NAME    SETC  ' '                                                      00004000
.NOSECT  ANOP                                                           00004100
         AIF   (&INIT NE 1).FIRST   IF FIRST CALL, DON'T DROP 15 AS BAS 00004200
         DROP  13 $               DROP PREVIOUS BASE REGISTER           00004300
.FIRST   USING *,15 $             ESTABLISH ADDRESSING                  00004400
&INIT    SETB  1                    SO WILL DROP 13 FROM NOW ON         00004500
&NAME    STM   11,12,64(13) $     SAVE REGS USED TO BALR ON             00004600
         LA    12,CHAIN $         R12 POINTS AT ROUTINE TO SAVE         00004700
*                                   REGS AND CHAIN SAVEAREAS            00004800
         BALR  11,12 $            CALL THAT ROUTINE                     00004900
         DROP  15 $               GET RID OF BASE REGISTER              00005000
         USING SAVEAREA,13 $      SET UP PERMANENT BASE REGISTER        00005100
         AIF   (&SAVEXST).DONE                                          00005200
         B     SAVEAREA+72 $      BRANCH AROUND SAVEAREA                00005300
         DS    0F $               ALIGNMENT                             00005400
         DC    AL1(7),CL7'&LAB.' $  IDENTIFIER                          00005500
SAVEAREA DC    18F'0' $           SAVEAREA USED BY ALL ROUTINES         00005600
&SAVEXST SETB  1       SO SAVEAREA WON'T GWT GENERATED AGAIN            00005700
.DONE    MEND                                                           00005800
         EJECT                                                          00005900
         MACRO                                                          00006000
         LTBINS &FLAG                                                   00006100
.*       THIS MACRO CALLS THE ROUTINE THATS MAKES LINE TABLE INSERTS    00006200
.*       &FLAG = NO => DISP IN ORDERS HAS NOT BEEN FUDGED, DON'T SET BI 00006300
.*       &FLAG = YES => DISP IN ORDERS HAS BEEN FUDGED, SET BIT IN      00006400
.*             FLAGWORD                                                 00006500
         AIF   ('&FLAG' EQ 'NO').NOBIT                                  00006600
         OI    FLAGWORD,X'01' $ SET BIT TO DECREMENT DISP IN ORDERS     00006700
*                               IF THIS CALL FINDS A FULL SCREEN        00006800
.NOBIT   BAL   15,LINTBINS $           CALL ROUTINE TO MAKE LINE TAB IN 00006900
         MEND                                                           00007000
         SPACE 10                                                       00007100
*********************************************************************** 00007200
*                                                                     * 00007300
*                       ASSEMBLY VARIABLES                            * 00007400
*                                                                     * 00007500
*********************************************************************** 00007600
         SPACE                                                          00007700
         LCLA  &NUMLINE,&TLFENT,&TLDATL                                 00007800
         LCLC  &SCOPE                                                   00007900
&NUMLINE SETA  38          NUMBER OF LINES FOR MAIN DISPLAY             00008000
&TLFENT  SETA  6                  MAX NUM OF ACTUAL ENTRIES IN TAG-LINK 00008100
&TLDATL  SETA  250                NUM OF WORDS TO STORE TO STORE EXPLS  00008200
&SCOPE   SETC  'MOD3'             LABELS SHOULD STORE X,Y REGS          00008300
&SCOPE   SETC  'MOD1'             NO PROBLEM WITH LINE SPACING          00008400
         EJECT                                                          00008500
         ENTRY DISPLAY,TAGAREA,GTRU,GTRU1,OPOINT,DISPLMAP,LINTBL        00008600
         ENTRY STARTBUF,FLAGWORD,DESNUM,ENDTEXT,OPOINT2                 00008700
         ENTRY TAGBACK,TAGFOR                                           00008800
         SPACE 3                                                        00008900
BEGIN    SAVE   CSECT=YES                                               00009000
        SPACE 4                                                         00009100
*       INITIALIZE VARIOUS POINTERS AND REGISTERS                       00009200
         MVI   NUMCHAR+3,74       SET NUM OF CHARS WANT ON 1 LINE IN BI 00009300
         MVI   MVC+1,0            ZERO INITIAL HANGING INDENT LENTH     00009400
         L     2,OPOINT    GET ID NAME                                  00009500
         ST    2,CURRID    SAVE CURRENT ID                              00009600
         LH    2,STARTBUF              INITIALIZE BUFFER ADDRESS        00009700
         LA    4,BUFFER            R4 INITIALLY POINTS INTO CORE BUFFER 00009800
         L     6,OPOINT+8              GET DISP WITHIN ORDER            00009900
         L     8,=A(DISPM)             LOWER DISPLAY MAP                00010000
        L     11,OPOINT+4             INITIALIZE DISPLACEMENT IN ORDERS 00010100
         SR    14,14               SET INITIAL SPACE ON LINE            00010200
         LA    1,DISPLMAP     UPPER DISPLAY MAP                         00010300
         ST    1,UPPERDM    INITIALIZE                                  00010400
         MVI   DISPFRNP+1,X'F0'        IN CASE NOP WAS SET WRONG WAY AT 00010500
         SPACE 5                                                        00010600
        L     1,=A(LINTBL)            TOP OF LINE TABLE                 00010700
         ST    1,LTBIND     INITIALIZE LINETABLE POINTER                00010800
         NI    FLAGWORD,X'18'     CLEAR EVERYTHING EXCEPT SUPPRESS BITS 00010900
         MVI   NUMLINES+3,X'00'     ZERO NUMBER OF LINES PUT OUT        00011000
         MVC   TLFILE(17),INITADDS INIT ADDS IN TOP OF TLFILE           00011100
         LTBINS NO                                                      00011200
        EJECT                                                           00011300
*       RETRIEVES ITEM IN CURRID ,PUTS ORDERS ADDRESS IN R12,           00011400
*       AND DATA ADDRESS IN R10                                         00011500
*       IT ALSI SETS UP THE UPPER DISPLAY MAP                           00011600
FINDER   NI    CURRID+3,X'FE'  CLEAR BIT JUST IN CASE                   00011700
         LA    1,BLOCK-4    PARAMETER LIST TO BE PASSED TO GETITEM      00011800
         LR    3,14                    SAVE SPACE ON LINE DURING CALL   00011900
         L     15,=V(GETITEM)       WHERE WE ARE GOING                  00012000
         BALR  14,15      RETRIEVE THE ID                               00012100
         LR    14,3                    RESET SPACE ON LINE AFTER CALL   00012200
         L     12,12(1)    GET ADDRESS OF ORDERS ID                     00012300
         A     12,8(12)                ADD DISP TOM ORDERS              00012400
         L     10,16(1)       GET ADDRESS OF DATA ID                    00012500
         A     10,8(10)                ADD DISP TO DATA                 00012600
         L     1,UPPERDM          POINTER INTO UPPER DISPLAT MAP        00012700
         STH   2,0(1)              PUT IN BUFFER ADDRESS                00012800
         MVC   2(4,1),CURRID      PUT ID NAME IN UPPER DISPLAY MAP      00012900
         ST    8,8(1)    PUT LOWER DM POINTER IN UPPER DM               00013000
         LA    1,12(1)   INCREMENT POINTER                              00013100
         ST    1,UPPERDM       SAVE POINTER                             00013200
         EJECT                                                          00013300
SCANLOOP IC    1,0(11,12)              ORDER CIDE OG ORDER BEING SCANNE 00013400
         N     1,=XL4'3F'     KILL ANY HIGH ORDER BITS                  00013500
         SLL   1,2   MULTIPLY CODE BY FOUR                              00013600
         B     *+4(1)                  GO TO PROPER ROUTINE             00013700
         B     NEXORD      IF COD = 0                                   00013800
         B     STRING   CODE = 1                                        00013900
         B     BRANCH   CODE = 2                                        00014000
         B     LINK   CODE = 3                                          00014100
         B     BEGTAG   CODE = 4                                        00014200
         B     TAG   CODE = 5                                           00014300
         B     LABEL    CODE = 6                                        00014400
         B     PARA                TYPE=7                               00014500
         B     CAPITALS     CODE = 8                                    00014600
         B     DRFORM1    CODE"9                                        00014700
         B     DRFORM2   CODE=A                                         00014800
         EJECT                                                          00014900
*     THIS SUBROUTINE PUTS ENTRY'S IN THE TAG-LINK FILE                 00015000
*        R0 = X'40'  PUTS LINK ENTRY IN FILE                            00015100
*        R0 = X'00' PUTS TAG ENTRY IN FILE                              00015200
         SPACE 2                                                        00015300
PUTINTF  L     R7,TLFCURNT        WHERE NEXT ENTRY IN FILE GOES         00015400
         CH    R7,=AL2(4*&TLFENT)  AM ABOUT TO OVERFLOW TLFILE ?        00015500
         BNLR  15                 IF SO, DON'T MAKE ENTRY               00015600
         SLL   0,8                SHIFT OVER CKAR FOR TAGAREA START     00015700
         OR    0,5                COMBINE WITH LENTH                    00015800
         STH   0,TLFENTRY(R7)     PUT FIRST HALF OF ENTRY IN TLFILE     00015900
         L     1,TLFCURDT         ABS POINTER TO WHERE STRING GOES      00016000
         LTR   5,5                IF EXPL LEN = 0, DON'T MOBE           00016100
         BE    NOMOVE             BYEBYE                                00016200
         AR    1,5                WHERE STRING WILL ENF                 00016300
         C     1,=A(TLDAT+4*&TLDATL)    HAVE LEFT STROAGE AREA          00016400
         BNLR  15                 IF SO, TIME TO LEAVE                  00016500
         ST    1,TLFCURDT         WHERE NEXT STRING WILL GO             00016600
         SR    1,5                GET BACK WHERE THIS ONE GOES          00016700
         LA    3,0(10,9)          ABS POINTER TO STRING DATA STR        00016800
         BCTR  5,0                FOR THE MVC                           00016900
         EX    5,MOVETAG          MOVE EXPL INTO STORAGE AREA           00017000
NOMOVE   S     1,TLFTOPDT       GET DISP OF EXPL IN TLDAT               00017100
         STH   1,TLFENTRY+2(R7) PUT SECOND HALF OF ENTRY IN FILE        00017200
         LA    R7,4(R7)           INDEX ON WHERE NEXT FILE ENTRY GOES   00017300
         ST    R7,TLFCURNT        STORE INDEX FOR NEXT TIME             00017400
         BR    15                 RETURN                                00017500
MOVETAG  MVC   0(0,1),0(3)        USED TO MOVE EXPL FROM DS TO TLDAT    00017600
        EJECT                                                           00017700
PUTINBF  AR    9,6             ADD DISP WITHIN ORDER & DISP IN DATA     00017800
         AR    9,10    ADD ADD. OF TOP OF DATA TO THIS                  00017900
NUMCHAR  LA    1,74               NUM OF CHARS ON 1 SCOPE LINE          00018000
         SR    1,14       GET NUMBER OF SPADES LEFT ON LINE             00018100
         CR    1,5  NO OF SPACES LEFT ON LINE VS LENTH TO BE MOVED      00018200
         BL    OVERLINE  IF NO OF SPACES < LENTH                        00018300
      LTR      1,1             SEE IF LENTH IS ZERO                     00018400
      BE       NOTNUFSP         IF IT IS, BRANCH AND MOVE NOTHING       00018500
         LTR   1,5                RET IN R1 NUM OF CHARS MOVED, IF =0,  00018600
         BE    LUCKOUT              SKIP SCREWING AROUND                00018700
         BCTR  5,0     FOR MVC                                          00018800
         EX    5,MOVEBUF    MOVE STRING INTO BUFFER                     00018900
         AR    4,1                 NEW POINTER INTO BUFFER IN CORE      00019000
        AR    14,1                NEW SPACE ON CURRENT SCOPE LINE       00019100
         AR    2,1                 NEW SCOPE BUFFER ADDREAA             00019200
         SR    5,5                 LENTH LEFT TO MOVE = ZERO            00019300
LUCKOUT  SR    6,6                  ZERO DISP WITHIN ORDER IF RETURNING 00019400
*                                 OUT OF HERE(NONE OF ORDER LEFT TO     00019500
*                                  MOVE                                 00019600
         BR    15   RETURN                                              00019700
MOVEBUF  MVC   0(0,4),0(9)                                              00019800
         EJECT                                                          00019900
OVERLINE LR    R7,9                SAVE POINTER TO TOP OF STRING        00020000
         ST    1,WORK             SAVE NUM OF SPACE S LEFT ON LINE      00020100
         AR    R7,1                TOP OF STRING + NUM OF SPACES LEFT   00020200
*                                   ON LINE                             00020300
         CLI   0(R7),C' '           BLANK RIGHT AFTER OUR STRING SEG ?  00020400
         BE    FOUND  IF IS ONE, GO TO FOUND                            00020500
         BCTR  R7,0                 POINT AT LAST CHAR IN OUR SEGMENT   00020600
         CLI   0(R7),C' '          LOOK FOR BLANK                       00020700
         BE    FOUND  IF IS ONE, GO TO FOUND                            00020800
         BCTR   R7,0                DECREMENT POINTER AT STRING         00020900
         BCTR  1,0  DECREMENT NO OF SPACES,I.E. LENTH TO MOVE           00021000
         B     *-12    KEEP LOOKING FOR BLANK                           00021100
         SPACE 3                                                        00021200
FOUND    CR     9,R7                TOP OF STRING VS POINTER TO BLANK   00021300
         BNL   NOTNUFSP  IF NO BLANKS IN STRING, I.E. CANNOT BREAK IT   00021400
NOBLANKS LR    R7,1                R7 HAS LENTH OF STRING TO MOVE(UP    00021500
*                                  TO THE BLANK JUST FOUND)             00021600
         BCTR  R7,0                SUBTRACT ONE FOR BCTR                00021700
         EX    R7,MOVEBUF          MOVE STRING FROM DS INTO BUFFER      00021800
        AR    4,1                 NEW POINTER INTO CORE BUFFER          00021900
        AR    14,1                NEW SPACE ON SCOPE LINE               00022000
        AR    2,1                 NEW SCOPE BUFFER ADDRESS              00022100
         AR    6,1                 NEW DISP WITHIN ORDER                00022200
         SR    5,1             LENTH LEFT TO MOVE                       00022300
         BR    15   RETURN                                              00022400
         SPACE 3                                                        00022500
NOTNUFSP LA    1,74               SEE IF FULL LINE OF NON-BLANKS        00022600
         C     1,WORK                                                   00022700
         BE    NOBLANKS            IF SO, PUT OUT LINE OF GARBAGE       00022800
         SR    1,1                ZERO LENTH MOVED & LEAVE REST SAME    00022900
         BR    15    RETURN                                             00023000
        EJECT                                                           00023100
*                                                                       00023200
*       THIS ROUTINE FILLS OUT THE REST OF THE SCOPE LINE WITH          00023300
*        BLANKS AND CORRECTLY INCREMENTS THE BUFFER ADDRESS AND THE     00023400
*        BUFFER POINTER                                                 00023500
FILLOUT  LA    1,74                R1 HAS NUM OF SPACES ON LINE (MAX)   00023600
         SR    1,14                 MAX LEN OF LINE - LEN ALREADY FILLE 00023700
*                                   = NUM OF SPACES TO PAD              00023800
         BCR   13,15                ON NOT HIGH                         00023900
         MVI   0(4),C' '            PUT A BLANK IN THE BUFFER           00024000
         LA    4,1(4)              INCREMENT CORE BUFFER POINTER        00024100
         LA    2,1(2)               INCREMENT SCOPE BUFFER POINTER      00024200
         BCT   1,*-12               LOOP UNTIL LINE COMPLETELY PADDED   00024300
         BR    15                   RETURN                              00024400
         SPACE 4                                                        00024500
*                                                                       00024600
*        THIS ROUTINE MAKES AN ENTRY IN THE LINETABLE                   00024700
*        IT THEN CHECKS TO SEE IF THE SCOPE PAGE IS FULL                00024800
*        IF OT IS, DISPLAY GENERATION IS STOPPED                        00024900
*        OTHERWISE, IT RETURNS TO WHERE IT WAS CALLED FROM              00025000
*        IT ALSO CHECKS TO SEE IF IT IS IN HANGING INDENT MODE          00025100
*        IF SO, IT INDENTS THE NEXT LINE THE PROPER NUMBER OF SPACES    00025200
*                                                                       00025300
*        DON'T CHANGE THIS ROUTINE TO CLOBBER R3                        00025400
LINTBINS L     1,LTBIND   LOAD INDEX ON LINE TABLE                      00025500
         STH   2,0(1)    PUT BUFFER ADDRESS IN LINETABLE                00025600
         MVI   3(1),0                                                   00025700
         MVC   4(4,1),CURRID     MOVE CURRENT ID INTO TABLE             00025800
         ST    11,8(1)    PUT DISP IN ORDERS IN LINETABLE               00025900
         ST    6,12(1)    PUT DISP WITHIN ORDER IN LINETABLE            00026000
         LA    1,16(1)     INCREMENT INDEX                              00026100
         ST    1,LTBIND    STORE INDEX                                  00026200
         L     1,NUMLINES   GET NO OF LINES ALREADY PUT OUT             00026300
         C     1,DESNUM    COMPARE WITH DESIRED NO                      00026400
         BNL   GETRIGHT         SCREEN FULL, SET DISP IN ORDERS RIGHT   00026500
         LA    1,1(1)    OTHERWISE INCREMENT                            00026600
         ST    1,NUMLINES    STORE NEW INDEX                            00026700
        SR    14,14               INITIAL SPACE ON LINE = ZERO          00026800
         TM    FLAGWORD+1,X'80'    INDENT NEXT LINE?                    00026900
         BZ    LINTNI              NO                                   00027000
         IC    14,MVC+1            CURRENT SPACE AFTER INDENTING        00027100
MVC      MVC   0(0,4),ENDLINE      PROPER NUMBER OF BLANKS TO INSERT    00027200
*                                  PUT HERE BY HANGING INDENT ROUTINE   00027300
         AR    4,14                INCREMENT CORE PINTER                00027400
         AR    2,14                                                     00027500
LINTNI   NI    FLAGWORD,X'FE'      CLEAR FUDGED DISP IN ORDERS BIT      00027600
         BR    15    RETURN                                             00027700
*                                                                       00027800
*                                                                       00027900
*        THIS ROUTINE PREVENTS SCROLLING FROM MOVING OFF THE END OF     00028000
*        A PAGE ( MOVING PAST THE END)                                  00028100
GETRIGHT TM    FLAGWORD,X'01'   BIT SET MEANS DISP IB ORDERS WAS FUDGED 00028200
         BZ    ENDOFDSP                WHEN LINTBINS WAS CALLED         00028300
         S     11,ORDERLN       SUBTRACT FOUR FROM DISP IN ORDERS       00028400
         B     ENDOFDSP         NEXPAGE SHOULD NOW BE SET RIGHT         00028500
         EJECT                                                          00028600
*                                                                       00028700
*        THIS ROUTINE CLEARS BLANKS FROM THE BEGINNING OF A CHAR STRING 00028800
*        IT IS CALLED AT THE BEGINNING OF EACH SCOPE LINE               00028900
*                                                                       00029000
*        DON'T CHANGE THIS ROUTINE TO CLOBBER R3                        00029100
CLRBLANK LA    1,0(9,10)           ABS POINTER TO TOP OF STRING IN DS   00029200
        AR    1,6                 TOP OF STRING + DISP WITHIN ORDER     00029300
         CLI   0(1),C' '           IS CHAR (FIRST ) A BLANK?            00029400
         BCR   7,15              NO, SO RETURN                          00029500
         LA    6,1(6)                  INCREMENT DISPLACEMENT WITHIN OR 00029600
         BCTR  5,0     DECREMENT LENTH                                  00029700
         LTR   5,5                 IF LEN HAS BECOME ZERO,              00029800
         BCR   8,15                THEN TIME TO RETURN HOME             00029900
         LA    1,1(1)                  INCREMENT POINTER AT STRING      00030000
         B     CLRBLANK+6          LOOP AGAIN                           00030100
         SPACE 4                                                        00030200
*        DON'T CLOBBER R0                                               00030300
*        ENTRY = BAL 3,CHKSPACE                                         00030400
*        INPUT = CHAR TO PUT IN BUFFER IN LOW ORDER BYTE OF REG 0       00030500
CHKSPACE C     14,=F'74'           IF ON END OF LINE, MAKE ENTRY IN LIN 00030600
*                                  TABLE AND RESET SPACE ON LINE        00030700
         BL     *+8                 IF NOT ON END OF LINE,SKIP THIS     00030800
         LTBINS NO                                                      00030900
         ST    11,0(8)              PUT DISP IN ORDERS IN DM            00031000
         STH   2,0(8)               PUT CSOPE BUFFER ADDRESS IN DM      00031100
         STC   0,0(4)               PUT INPUT CHAR IN CORE BUFFER       00031200
         LA    4,1(4)               INCREMENT CORE BUFFER               00031300
         LA    2,1(2)               INCREMENT SCOPE BUFFER ADFRESS      00031400
         LA    14,1(14)            INCREMENT SPACE ON LINE              00031500
         BR    3                    RETURN                              00031600
         SPACE 2                                                        00031700
*        THIS ROUTINE ALIGNS THE POINTER INTO THE CORE BUFFER ON A      00031800
*        HALFWORD BOUNDRY BEFORE INSERTION OF A GRAPHIC ORDER.          00031900
*        IT ADJUSTS THE POINTER AND THE SCOPE BUFFER ADDRESS APPROPRIAT 00032000
ALIGN    ST     4,WORK              SO CAN TEST LAST BIT                00032100
         TM    WORK+3,X'01'         IF ADDRESS ODD, HAVE TO ALIGN       00032200
         BCR   8,15                 ON ZERO, RETURN                     00032300
         MVI   0(4),X'00'          A NULL CHAR TO ALIGN AND NOT DISTURB 00032400
*                                   DISPLAY                             00032500
         LA    4,1(4)               INCREMENT CORE BUFFER POINTER       00032600
         LA    2,1(2)               INCREMENT SCOPE BUFFER ADDRESS      00032700
         BR    15                   RETURN                              00032800
         EJECT                                                          00032900
*        RETURN CODES                                                   00033000
*        R6 = 0 => SKIPLINES                                            00033100
*             4 => INDENT                                               00033200
*             8 => PARA OR PARACAP                                      00033300
*              12=S CENTER OR AS-IS                                     00033400
*              16=S NEW COL OR PAGE                                     00033500
*              20=S HEADING                                             00033600
*         24 => HANGING INDENT                                          00033700
*        RETURN ON R3 IF NOT ONE OF OUR CODES                           00033800
*        RETURN ON R15 IF IT IS ONE BEING DISPLAYED                     00033900
         SPACE 4                                                        00034000
CHKFRMTP LA    1,0(11,12)          POINTS TO TOP OF ORDER               00034100
         SR    6,6                 SET UP FOR CONDITION CODE RETURN     00034200
         CLI   1(1),X'05'          IS IT AN UNDERLINE OR CAP FORMAT     00034300
         BCR 13,3                                                       00034400
         CLI   1(1),X'2B'         SPECIAL BLANK NOT END HANGING INDENT  00034500
         BER   3                                                        00034600
         CLI   1(1),X'31'         SPECIAL CHARS ALSO NOT END IT         00034700
         BER   3                                                        00034800
         CLI   1(1),X'2E'          SEE IF SPECIAL BALNK                 00034900
         BE    FORPRAGR                                                 00035000
         MVI   LINSTART+1,0        INDICATE LINE STARTS AT SPACE 0      00035100
         NI FLAGWORD+1,X'7F'       DISABLE HANGING INDENT FLAG          00035200
         CLI   1(1),19             SKIPLINES                            00035300
         BER   15                                                       00035400
         LA    6,4                 CHANGE RETURN CODE                   00035500
         CLI   1(1),20             INDENT                               00035600
         BER   15                                                       00035700
         LA    6,8                 CHANGE RETURN CODE                   00035800
         CLI   1(1),7              PARAGRAPH                            00035900
         BER   15                                                       00036000
         CLI   1(1),27             PARACAP                              00036100
         BER   15                                                       00036200
         LA    6,12                                                     00036300
         CLI   1(1),10             AS-IS                                00036400
         BER   15                                                       00036500
         CLI   1(1),9              CENTER                               00036600
         BER   15                                                       00036700
         LA    6,16                                                     00036800
         CLI   1(1),6              NEW PAGE                             00036900
         BER   15                                                       00037000
         CLI   1(1),17             NEW COLUMN                           00037100
         BER   15                                                       00037200
         LA    6,20                                                     00037300
         CLI   1(1),22             HEADING                              00037400
         BER   15                                                       00037500
         LA    6,24                                                     00037600
         CLI   1(1),21             HANGING INDENT                       00037700
         BER   15                                                       00037800
         SR    6,6                 CLEAR R6 FOR LATER                   00037900
         BR    3                   DIDN'T FIND ONE OF OUR GUYS          00038000
FORPRAGR LA    0,C'¢'              MARKER FOR SPECIAL BLANK             00038100
         BR    3                   NORMAL EXIT                          00038200
         SPACE 3                                                        00038300
*        ROUTINE TO SET BIT IF NECESSARY TO FORCE A LATE LINE TABLE     00038400
*              INSETR.  THIS IS NECESSARY BECAUSE OF WAY OF SCROLLING   00038500
*              PAST PARAGRAPHS                                          00038600
ENDPAGE  LA    1,0(11,12)         GET POINTER TO TOP OF ORDER           00038700
         TM    0(1),X'80'         SEE IF LAST ORDER BIT SET             00038800
         BZR   3                  IF NOT, RETURN                        00038900
         OI    FLAGWORD,B'00100000' SET 'LATE LINE TABLE INSERT' BIT    00039000
         BR    3                  RETURN                                00039100
         EJECT                                                          00039200
TAG      LA    0,C'@'               CHAR TO PUT IN BUFFER               00039300
         BAL   3,CHKSPACE           PUT MARKER IN BUFFER AND ADJUST POI 00039400
         MVI   4(8),X'05'          PUT TAG TYPE IN DM                   00039500
         LH    5,2(11,12)         GET LENTH OF TAG EXPLAINER            00039600
         LH    9,4(11,12)         GET DISP IN DATA OF TAG EXPLAINER     00039700
*        KEEP TYPE = C'@' IN BOTTOM OF R0                               00039800
         B     EXPLENT              SET UP AND MAKE ENTRY IN TLFILE     00039900
         SPACE 1                                                        00040000
BEGTAG   EQU   SAVEAREA+2                                               00040100
*        IF YOU BOMB OUT AT 'SAVEAREA + 2', THEN WE FOUND ORDER CODE OF 00040200
         SPACE 6                                                        00040300
LABEL    TM    FLAGWORD,X'08'     ARE LABELS TO BE DISPLAYED ?          00040400
         BO    NEXORD              IF SO, DON'T TRY TO DISPLAY IT       00040500
         LA    R7,0(12,11)        R7 POINTS AT TOP OF LABEL ORDER       00040600
         TM    0(R7),X'40'         AN INTERNAL LABEL PERHAPS ?          00040700
         BO    NEXORD                  IF IT IS, DON'T TRY TO DISPLAY   00040800
         CH    14,=H'66'          CAN PUT LABEL ON THIS LINE?           00040900
         BL    *+12    YES , BRANCH                                     00041000
         BAL   15,FILLOUT    FILL OUT LINE WITH BLANKS                  00041100
         BAL   15,LINTBINS    PUT IN LINETABLE                          00041200
         MVI   0(4),C' '   MOVE IN TWO BLANKS                           00041300
         MVI   1(4),C' '                                                00041400
         ST    11,0(8)      DISP IN ORDERS IN DM                        00041500
         STH   2,0(8)    BUFFER ADDRESS IN DM                           00041600
         MVI   4(8),X'06'     TYPE FOR LABEL = 6                        00041700
         MVC   2(6,4),1(R7)        MOVE LABEL FROM DS TO BUFFER         00041800
         LA    2,8(2)                  NEW BUFFER ADDRESS               00041900
         LA    14,8(14)    NEW SPACE ON LINE                            00042000
         LA    4,8(4)   NEW BUFFER POINTER                              00042100
         BAL   15,ALIGN             ALIGN BUFFER AT HALFWORD BOUNDRY    00042200
         AIF   ('&SCOPE' EQ 'MOD1').MOD11   WHETHER TO STORE XY REGS    00042300
         LA    3,XYREGS-UNDERLN(2)   GET WHERE IN BUFFER TO STORE REGS  00042400
         STH   3,STREGS+2         PUT BUFFER ADDRESS IN GRAPHIC ORDER   00042500
.MOD11   MVC   0(LINELEN,4),UNDERLN   MOVE IN LINE DRAWN THRU LABEL     00042600
         LA    4,LINELEN(4)        INCREMENT CORE BUFFER POINTER        00042700
         LA    2,LINELEN(2)        INCREMENT SCOPE GUFFER ADDRESS       00042800
         C     14,=F'73'     CAN PUT IN BLANKS?                         00042900
         BH    NEXORD    NO, THEN DON'T                                 00043000
         MVI   0(4),C' '                                                00043100
         MVI   1(4),C' '   MOVE IN THE TWO BLANLS AFTER THE LABEL       00043200
         LA    4,2(4)   NEW  BUFFER POINTER                             00043300
         LA    14,2(14)    NEW SPACE ON LINE                            00043400
         LA    2,2(2)   NEW BUFFER ADDRESS                              00043500
         B     NEXORD    GO TO NEXT ORDER                               00043600
         EJECT                                                          00043700
         PRINT NOGEN                                                    00043800
         GINIT BPX=500            TO PREVENT MNOTES                     00043900
UNDERLN  GDPD                      DISABLE LIGHT PEN DETECTS ON LINE    00044000
         AIF   ('&SCOPE' EQ 'MOD1').MOD12                               00044100
STREGS   GSXY   0    STORE XY REGS TO FIX CHAR GEN                      00044200
.MOD12   GEVI2                    ENTER INCREMENTAL VECTOR MODE         00044300
         GDV   -215,0,U                                                 00044400
         GDV   -170,0,U                                                 00044500
         GDV   215,0,B                                                  00044600
         GDV   170,0,B                                                  00044700
         GESD                      RE-ENABLE LIGHT PEN DETECTS          00044800
         AIF   ('&SCOPE' EQ 'MOD1').MOD13                               00044900
         GEVM                     ENTER ABS VECTOR MODE TO AUTO SKIP    00045000
XYREGS   GDV   0,0,B              HAVE SCOPE STORE XY REGS HERE         00045100
.MOD13   GECP  B                  LEAVE VECTOR MODE                     00045200
LINELEN  EQU   *-UNDERLN           LENTH OF GRAPHICS FOR THE UNDERLINE  00045300
         PRINT GEN                                                      00045400
        SPACE 5                                                         00045500
         MVI   DISPFRNP+1,X'00'        ON FORMAT PHASE CAPS, FALL THROU 00045600
PARA     BAL   5,SKPORNOT          SKIP A LINE IF NECESSARY             00045700
         BAL   5,SKIPAG            SKIP A LINE                          00045800
PARABUF  MVC   0(3,4),END1         INDENT THREE SPACES                  00045900
         LA    4,3(4)              POINT PAST THREE SPACES              00046000
         LA    2,3(2)              INCREMENT SCOPE BUFFER ADDRESS       00046100
         LA    14,3                SET SPACE ON LINE                    00046200
DISPFRNP B     NEXORD                  DISPLAY OR DON'T DISPLAY HATCH   00046300
         MVI   *-3,X'F0'               SET BACK TO BRANCH               00046400
         LA    0,C'#'                  SYMBOL TO DISPLAY                00046500
         B     DRFORM1+4               TRY TO DISPLAY HATCH             00046600
         EJECT                                                          00046700
BRANCH   LTR   14,14             ON BEGINNING OF LINE ?                 00046800
         BE    *+20   IF SO, BRANCH                                     00046900
         MVI   0(4),X'15'   PUT IN NEW LINE CHARACTER                   00047000
         LA    4,1(4)   NEW BUFFRE POINTER                              00047100
         LA    2,1(2)    NEW BUFFER ADDRESS                             00047200
        BAL   15,LINTBINS         PUT LINE JUST CREATED IN LINE TABLE   00047300
         MVC   0(5,4),=C'  *  '    PUT THING IN BUFFER                  00047400
*        MAKE DM ENTYR FOR '  *  ' SO CAN LP IT                         00047500
         ST    11,0(8)            STORE DISP IN ORDERS                  00047600
         STH   2,0(8)             STORE SCOPE BUFFER ADDRESS            00047700
         LA    1,0(11,12)         R1 POINTS AT BRANCH ORDER             00047800
         MVC   8(6,8),4(1)        MOVE LABEL INTO DISPLAY MAP           00047900
         MVI   4(8),X'02'         ORDER TYPE FOR BRANCH = 2             00048000
         MVI   5(8),X'05'         PUT LENTH OF STRING IN DM             00048100
         LA    8,16(8)            POINT AT NEXT ENTRY                   00048200
         LA    4,5(4)      NEW BUFFER POINTER                           00048300
         LA    2,5(2)   NEW BUFFER ADDRESS                              00048400
         LA    14,5                SET SPACE ON LINE(FOR MARKER)        00048500
        SR    5,5                 FOR THE INSERT CHAR                   00048600
         IC    5,1(12,11)    LENTH OF EXPLAINER                         00048700
NEXLINE  LH    9,2(12,11)    GET  DISP IN DATA                          00048800
         ST    11,0(8)    PUT DISP IN ORDERS IN DM                      00048900
         STH   2,0(8)    PUT BA IN DM                                   00049000
         LA    1,0(12,11)          R1 POINTS AT BRANCH ORDER            00049100
         MVC   8(6,8),4(1)         MOVE LABEL INTO DM                   00049200
         LTR   14,14               ON BEGINNING OF LINE ?               00049300
         BNE   *+8                 YES, THEN FALL THROUGH               00049400
         BAL   15,CLRBLANK                                              00049500
         ST    6,4(8)    PUT DISP WITHIN ORDER IN DM                    00049600
         BAL   15,PUTINBF    PUT STRING IN BUFFER                       00049700
         STH   1,4(8)              PUT LENTH OF STRING ON THIS LINE IN  00049800
         MVI   4(8),X'02'   TYPE = 2                                    00049900
         LTR   5,5     LENTH LEFT = 0 ?                                 00050000
         BE    ZIP                     IF YES,GO TO ZIP                 00050100
         BAL   15,FILLOUT   FILLOUT LINE WITH BLANKS                    00050200
         BAL   15,LINTBINS   PUT ENTRY IN LINETABLE                     00050300
         LA    8,16(8)    INCREMENT DM POINTER                          00050400
         B     NEXLINE   LOOP AGAIN                                     00050500
         SPACE 2                                                        00050600
ZIP      LA    R15,0(12,11)        TOP OF ORDERS + DISP IN ORDERS       00050700
*                                  R15 NOW POINTS AT BRANCH JUST SCANNE 00050800
         TM    0(R15),X'80'        BRANCH JUST SCANNED LAST ORDER ?     00050900
*        THIS WILL CAUSE PROGLEMS IF BRANCH ON BOTTOM OF PAGE IN        00051000
*              MIDDLE OF AREA                                           00051100
         BO    NEXORD             IF NOT MANY PROBLEMS                  00051200
         LA    R15,12(R15)         INCREMENT PAST THIS ORDER            00051300
CHCKLOOP EQU   *                                                        00051400
         IC    1,0(R15)            GET ORDER CODE OF NEXT ORDER         00051500
         N     1,=XL4'3F'                                               00051600
         C     1,=F'2'             IS NEXT ORDER A BRANCH?              00051700
         BE    NEXORD           KEEP SCANNING                           00051800
         LTR   1,1                 IF NEXT ORDER IS A NOOP,             00051900
         BNE   INCRDM             LOKK PAST IT, OTERWISE INCR DM POINTE 00052000
         TM    0(R15),X'80'        IS THIS THE LAST ORDER ?             00052100
         BO    INCRDM             IF SO, JUST INCR DM POINTER AND STOP  00052200
         LA    R15,4(R15)          POINT PAST NOOP                      00052300
         B     CHCKLOOP            KEEP TRYING                          00052400
         SPACE 2                                                        00052500
INCRDM   LA    8,16(8)            POINT PAST CURRENT ENTRY IN DM        00052600
         B     SCRLCHCK           SEE ABOUT SCROLL BY LINE AND NO SCRLP 00052700
         EJECT                                                          00052800
LINK     LA    0,C'*'               MARKER TO PUT IN BUFFER             00052900
         BAL   3,CHKSPACE           PUT IN BUFFER AND ADJUST POINTERS   00053000
         MVI   4(8),X'03'   TYPE IN DM = 03                             00053100
         LA    1,0(11,12)          DISP IN DATA + TOP OF DATA           00053200
         MVC   8(6,8),4(1)         MOVE LABEL INTO DM                   00053300
         SR    5,5                FOR THE INSERT CHAR                   00053400
         IC    5,1(12,11)   GET EXPLAINER LENTH                         00053500
         LH    9,2(12,11)    GET DISP IN DATA                           00053600
*        KEEP TYPE = C'*' IN BOTTOM BYTE OF R0                          00053700
EXPLENT  BAL   15,PUTINTF         MAKE TAG-LINK FILE ENTRY              00053800
         B     NEXORD     GO ON TO NEXT ORDER                           00053900
         EJECT                                                          00054000
STRING  LH    5,2(12,11)          LENTH OF CHAR STRING                  00054100
         SR    5,6                     LENTH - DISP WITHIN LRDER        00054200
         LH    9,4(12,11)     GET DISP IN DATA                          00054300
         ST    11,0(8)      PUT DISP IN ORDERS IN DM                    00054400
         STH   2,0(8)    PUT BUFFER IN  ADDRESS IN DM                   00054500
         CH    14,LINSTART                                              00054600
         BNE   *+8                 IF NOT, DON'T CLEAR LEADING BLANKS   00054700
         BAL   15,CLRBLANK     CLEAR INITIAL BLANKS                     00054800
         ST    6,4(8)       PUT DISP WITHIN ORDER IN DM                 00054900
         BAL   15,PUTINBF                                               00055000
         STH   1,4(8)              PUT LENTH MOVED IN DM                00055100
        MVI   4(8),X'01'          PUT ORDER CODE FOR CHARS IN DM        00055200
         LTR   5,5    CHECK LENTH LEFT                                  00055300
         BE    NEXORD              GO IF NONE LEFT TO MOVE              00055400
         CLI   5(8),X'00'          IF LEN OF STRING JUST MOVED = 0,     00055500
         BE    *+8                THEN WIPE OUT ITS DM ENTRY NEXT TIME  00055600
         LA    8,8(8)     INCREMENT  DM POINTER                         00055700
         BAL   15,FILLOUT     FILL OUT LINE WITH BLANKS                 00055800
         BAL   15,LINTBINS    MAKE ENTRY IN LINETABLE                   00055900
         B     STRING+6            PUT OUT NEXT LINE FROM THIS ORDER    00056000
         SPACE 5                                                        00056100
CAPITALS EQU   SAVEAREA                                                 00056200
*        IF YOU BOMB OUT AT'SAVEAREA', THEN YOU HIT AN ORDER CODE OF 8  00056300
         EJECT                                                          00056400
DRFORM1  LA    0,C'$'              SCREEN MARKER FOR COMPLEX FOEMATS    00056500
         TM    FLAGWORD,X'10'     ARE FORMATS BEING DISPLAYED ?         00056600
         BO    NEXORD             IF NOT, DON'T DISPLAY THEM            00056700
         BAL   3,CHKSPACE          PUT IN BUFFER AND ADJUST POINTERS    00056800
         IC    0,0(11,12)         GET TYPE OF ORDER                     00056900
         N     0,=XL4'3F'         ZAP LO   HIGH ORDER BITS              00057000
         STC   0,4(8)             PUT TYPE IN DISPLAY MAP               00057100
         B     NEXORD                                                   00057200
DRFORM2  LA    0,C'#'               SCREEN MARKER FOR SIMPLE FORMATS    00057300
         LA    3,DRFORM1+4         WHERE TO GO IF PLAIN FORMAT          00057400
         BAL   15,CHKFRMTP         SEE IF FORMAT TO BE DISPLAYED        00057500
         L     15,TYPADDS(6)       USE RETURN CODE TO FIND OUT WHERE TO 00057600
         SR    6,6                 CLEAR R6 FOR LAYER                   00057700
         BAL   3,ENDPAGE          SEE IF LATE LINE TABLE INSERT         00057800
         BR    15                  GO TO PROPER PLACE                   00057900
TYPADDS  DC    A(SKIPLINE,INDENT,PARA-4)                                00058000
         DC    A(ASIS,NEWCOLPG,HEAD)                                    00058100
         DC    A(HANGIND)                                               00058200
         SPACE 5                                                        00058300
INDENT   BAL   5,SKPORNOT          SKIP A LINE MAYBE                    00058400
NOLINE   SR    5,5                                                      00058500
         IC    5,2(11,12)          NUM OH SPACES TO INDENT              00058600
         CH    5,=H'30'           DON'T INDENT TOO MUCH                 00058700
         BNH   *+8                                                      00058800
         LA    5,30               MAX                                   00058900
         EX    5,INDNTMVC         MOVE IN PROPER NUM OF BLANKS          00059000
         AR    4,5                INCREMENT CORE POINTER                00059100
         AR    2,5                SCOPE BUFFER ADDRESS                  00059200
         AR    14,5                                                     00059300
         OI    FLAGWORD,B'00000100'  ONLY SKIP ONE LINE (LATE LTB INS)  00059400
         MVI   HANGIND+1,X'F0'     MAKE HANGIND UNCONDITIONAL BRANCH    00059500
         MVI   HANGOUT+1,X'F0'     FIX BRANCH IN NEXORD TO LEAVE        00059600
*                                  HANGIND OPED                         00059700
         B     DRFORM1+4          PUT OUT NICE LITTLE MARKER            00059800
INDNTMVC MVC   0(0,4),ENDLINE     USED BY EX TO INDENT                  00059900
HANGIND  BC    0,NOLINE2                                                00060000
         BAL   5,SKPORNOT          SKIP A LINE MAYBE                    00060100
NOLINE2  SR    5,5                                                      00060200
         IC    5,2(11,12)          NO OF SPACES TO INDENT               00060300
         CH    5,=H'30'            DON'T INDENT TOO MUCH                00060400
         BNH   *+8                                                      00060500
         LA    5,30                MAX # TO INDENT                      00060600
         STC   5,MVC+1             ALTER MVC IN LINTBINS SO IT WILL     00060700
*                                  MOVE IN PROPER NUMBER OF BLANKS      00060800
         STH   5,LINSTART          SET LINE START                       00060900
         OI    FLAGWORD+1,X'80'    SET BIT SO LINTBINS WILL INDENT      00061000
         B     DRFORM1+4                                                00061100
*                                                                       00061200
*                                                                       00061300
*SKPORNOT TESTS WHETHER TO SKIP A LINE AFTER AN INDENT,HANGING INDENT   00061400
* OR PARA TYPE HAS BEEEN ENCOUNTERED.  IT SKIPS A LINE IF NOT ALREADY   00061500
* ON A NEW LINE.  IT IS NECESSARY TO CHECK WHETHTER FORMAT SYMBOLS      00061600
* ARE BEING DISPLAYED, FOR IF SO , A NEW LINE WILL START AT SPACE ONE   00061700
* AND NOT AT SPACE ZERO.                                                00061800
*                                                                       00061900
*                                                                       00062000
SKPORNOT LTR   14,14               SPACE ZERO?                          00062100
         BZ    DONSKIP             DON'T SKIP                           00062200
         TM    FLAGWORD,X'10'      FORMAT SYMBOLS BEING DISPLAYED       00062300
         BZ    SPACE1              IF SO, SEE IF WE'RE ON A SPACE1      00062400
SKIPAG   MVI   0(4),X'15'          FORCE TO A NEW LINE                  00062500
         LA    4,1(4)                                                   00062600
         LA    2,1(2)                                                   00062700
         BAL   3,ENDPAGE                                                00062800
         LA    11,4(11)            SO SCROLLING WILL WORK               00062900
         TM    FLAGWORD,B'00100000' INSERT IN LINETABLE NOW             00063000
         BO    *+12                NO,GO AROUND                         00063100
         LTBINS YES                                                     00063200
         S     11,ORDERLN                                               00063300
DONSKIP  BR    5                   RETURN                               00063400
SPACE1   CH    14,=H'1'            ARE WE ON SPACE 1                    00063500
         BNE   SKIPAG                                                   00063600
         BR    5                                                        00063700
CENTER   EQU   *                                                        00063800
ASIS     LA    5,1                 SKIP 0 LINES                         00063900
         B     NEWCOLPG+4                                               00064000
HEAD     SR    5,5                                                      00064100
         IC    5,2(11,12)          GET HEADING TYPE                     00064200
         IC    5,HEADSKIP-1(5)     GET NO. OF LINES TO SKIP             00064300
         B     NEWCOLPG+4                                               00064400
HEADSKIP DC    X'060404040202'                                          00064500
         EJECT                                                          00064600
SKIPLINE SR    5,5                 ZERO                                 00064700
         IC    5,2(11,12)          NUM OF LINES TO SKIP                 00064800
         LA    5,1(5)             ADD 1 TO FORCE TO NEXT LINE           00064900
         CH    5,=H'6'             WANTS TO SKIP TOO MANY LINES ?       00065000
         BNH   *+8                                                      00065100
NEWCOLPG LA    5,6                 MAX (-1)                             00065200
         LA    11,4(11)           FOR SCROLLING                         00065300
         STH   5,ENDTEXT           SAVE NUMBER SKIPPED FOR LTBINS       00065400
         OI    FLAGWORD,B'00000010'  SO LTBINS WILL BE CALLED PROP NUM  00065500
SKIPLOOP MVI   0(4),X'15'         SKIP A LINE                           00065600
         LA    4,1(4)             CORE POINTER                          00065700
         LA    2,1(2)             SCOPE BUFFER ADDRESS                  00065800
         TM    FLAGWORD,X'20'     LATE LINE TABLE INSERT                00065900
         BO    *+12             SKIP IF NOT                             00066000
         LTBINS YES                                                     00066100
         BCT   5,SKIPLOOP          SKIP PROPER NUMBER                   00066200
         S     11,ORDERLN         GET BACK ORIGB  DISP IN ORDERS        00066300
         B     DRFORM1+4          PUT OUT NICE LITTLE MARKER            00066400
         EJECT                                                          00066500
NEXORD   LA    0,0(11,12)         R0 POINTS AT ORDER BEING SCANNED      00066600
         IC    R7,0(11,12)        CODE FOR ORDER JUST SCANNED           00066700
         N     R7,=XL4'3F'         ZONK ANY STRAY BITS                  00066800
         SLL   R7,2                MULTIPLY BY FOUR                     00066900
         A     11,ORDERLN(R7)      INCREMENT DISP IN ORDERS             00067000
HANGOUT  BC    0,*+8      IF THIS IS OPED, DONT TURN OFF HANGIND        00067100
         MVI   HANGIND+1,X'00'     TURN OFF HANGIND                     00067200
         MVI   HANGOUT+1,X'00'     TURN OFF HANGOUT                     00067300
         CH    R7,=H'24'          EVERYTHING UNDER LABEL ALWAYS DISPLAY 00067400
         BNL   SPECASE          LABELS AND OVER ARE BAD                 00067500
NOCHAN   A     8,MAPENTLN(R7)     INCREMENT DM POINTER                  00067600
         LR    R15,0              R15 => ORDER JUST SCANNED             00067700
CHKEND   TM    0(R15),X'80'       SEE IF ORDER JUST SCANNED LAST        00067800
         BO    ENDOFID                 YES, SEE IF AT END OF AREA       00067900
         NI    FLAGWORD,B'11011000'   CLEAR APPROP STUFF                00068000
         B     SCANLOOP                GO ON TO NEXT ORDER              00068100
SPECASE  L     1,SPECADDS(R7)   USE ORDER CODE TO GO RIGHT PLACE        00068200
         BR    1    GO YE                                               00068300
COMPFORM TM    FLAGWORD,B'00010000'  FORMATS BEING DISPLAYED ?          00068400
         BZ    NOCHAN             INCREMENT IF FORMATS ARE DISPLAYED    00068500
         B     NOCHAN+4           NO INCERNEMT, BUT CLEAR BITS          00068600
CHKLAB   TM    FLAGWORD,B'00001000'  ARE LABELS BEING DISPLAYED ?       00068700
         BO    NOCHAN+4           NO, DON'T INCREMENT                   00068800
         LR    R15,0              R15 => ORDER JUST SCANNED             00068900
         TM    0(R15),X'40'       INTERNAL LABEL "?                     00069000
         BO    NOCHAN+4           DON'T INCREMENT HTEB                  00069100
         B     NOCHAN             IN THAT CASE, INCREMENT               00069200
*********************************************************************** 00069300
         DS    0F               ALIGNMENT                               00069400
SPECADDS EQU   *-24                                                     00069500
         DC    A(CHKLAB,NOCHAN+4,0,COMPFORM,SIMPFORM)                   00069600
         SPACE 3                                                        00069700
*        SEARCH THE VF UNTIL THE ID CURRENTLY BEING SCANNED IS FOUND    00069800
*        ON EXIT, R3 POINTS AT THIS ENTRY IN THE VF                     00069900
ENDOFID  L     1,=V(VFADD)        ADD OF POINTER TO VF                  00070000
         L     1,0(1)             R1 POINTS AT VF IN CORE               00070100
        L     3,0(1)              R3 HAS LENTH OF VF                    00070200
        AR    3,1                 JUST PAST VF(END OF BXLE LOOP)        00070300
        LR    0,2                 SAVE SCOPE BUFFER ADDRESS             00070400
         LA    2,4                 INCREMENT FOR BXLE                   00070500
         S     3,=F'8'            BECAUSE OF NATURE OF BXLE             00070600
SEARCHER CLC   5(3,1),CURRID+1     VF ENTRY VS ID I'M SCANNING NOW      00070700
         BE    CHKAGN              YES, GO SEE IF IT'S END OF CONT TEXT 00070800
        BXLE  1,2,SEARCHER        SCAN WHOLE FILE AND THEN BOMB         00070900
         DC    X'00',C'ID NOT IN VERSION FILE'                          00071000
         SPACE 5                                                        00071100
*        MAKE SURE DM POINTER IS POINTING AT THE LAST ENTRY IN IT       00071200
*        IF NECESSARY, BACK UP IF LAST ORDER SCANNED WAS A NOOP OR A    00071300
*        PARAGRAPH.  BACK UP UNTIL A 'GOOD' ORDER IS FOUND              00071400
*        THEN SEE IF THIS ID IS THE END OF A CONTINUOUS                 00071500
*        PIECE OF TEXT                                                  00071600
*        IF MORE TEXT FOLLOWS, TAG LAST ENTRY IN DM AND START SCANNING  00071700
*        THE NEXT GUY                                                   00071800
*        IF THIS IS THE END OF CONTINUOUS TEXT, GO TO ENDOUT            00071900
CHKAGN   LR    2,0                 RESTORE SCOPE BUFFER ADDRESS         00072000
FOUNDID  TM    4(1),X'80'          CUR PAGE END OF A PIECE OF TEXT      00072100
         BO    NOINC              YES, GO PUT   *** END *** LINE OUT    00072200
         MVC   CURRID+1(3),9(1)     OTHERWISE GET NEXT ID (SKPI LAST BI 00072300
         MVI   4(8),X'FF'         SET END OF DM FLAG                    00072400
         LA    8,8(8)             POINT PAST MARKER                     00072500
         SR    11,11           ZERO DISP IN ORDERS                      00072600
         TM    FLAGWORD,X'20'     CHECK IF PARA WAS LAST ON PRE PAGE    00072700
         BZ    CLRBIT             IF NOT, CLEAR INDENT AND SKIP BITS    00072800
         TM    FLAGWORD,X'02'     WERE SKIPPING LINES                   00072900
         BO    MANYCALL                                                 00073000
         LR    0,14               SAVE SPACE ON LINE                    00073100
         LTBINS NO                                                      00073200
         TM    FLAGWORD,X'04'   IF WAS IN INDENT NODE, ONLY CALL ONCE   00073300
         BO    *+8                                                      00073400
         LTBINS NO                                                      00073500
         LR    14,0               RESET SPACE ON LINE                   00073600
CLRBIT   NI    FLAGWORD,B'11011000'    PARA ON END,INDENT,SKIP,FUDGE    00073700
         B     FINDER     START SCANNING NEXT ID                        00073800
MANYCALL LH    3,ENDTEXT          NUM OF LINES TO SKIP                  00073900
         LTR   3,3              DON'T GTE BLOWN BY THIS                 00074000
         BE    CLRBIT                                                   00074100
         BAL   15,LINTBINS                                              00074200
         BCT   3,*-4              LOOP                                  00074300
         B     CLRBIT             CLEAR PROPER BITS                     00074400
         EJECT                                                          00074500
*        A GECF B IS INSERTED AT THE END OF THE TEXT OND THE REST OF TH 00074600
*        BUFFER IS ZEROED                                               00074700
NOINC    BAL   15,ALIGN            ALIGN GRAPHIC ORDER                  00074800
         MVC   0(2,4),TAGBUF-2    MOVE IN GECF                          00074900
         LA    4,2(4)                                                   00075000
         LA    2,2(2)                                                   00075100
         LR    0,2              PRESERVE SCOPE BUFFER ADDR THROUGH FILL 00075200
        BAL   15,FILLOUT              PAD THIS LINE WITH BLANKS         00075300
         LR    2,0              REEST SCOPE BUFFER ADRR                 00075400
         L     3,DESNUM             R3 HAS DESIRED NUM OF LINES         00075500
         S      3,NUMLINES   MINUS CUR NUM OF LINES = NUM LEFT          00075600
         BCTR  3,0                  FOR ONE JUST FILLED OUT             00075700
         LTR   3,3                  SEE IF HAVE JUST FILLED SCREEN      00075800
         BNH   *+18                 IF SO, SKIP ZEROING                 00075900
        XC    0(74,4),0(4)            ZAP BUFFER                        00076000
        LA    4,74(4)                 INCREMENT BUFFER POINTER          00076100
        BCT   3,*-10                  ZAP THE REQUIRED NUM OF LINES     00076200
         EJECT                                                          00076300
*        OPOINT2 AND ENDTEXT ARE USED ON DIRECT INSERTS( NO LIGHTPENING 00076400
*                                                                       00076500
        L     1,CURRID                GET CURRENT ID                    00076600
        ST    1,OPOINT2               DS POINTER FOR DIRECT INSERTS     00076700
        ST    11,OPOINT2+4            DISP IN ORDERS                    00076800
        ST    6,OPOINT2+8             DISP WITHIN ORDER                 00076900
         MVC   0(74,4),ENDLINE PUT OUT ENDLINE                          00077000
         LA    4,74(4)         INCREMENT POINTER INTO DISPLAY BUFFER    00077100
*                                                                       00077200
*        IF ONLY ONE ENTRY IN LINETABLE, CAN'T SCROLL BY LINE           00077300
*        IF COMING THROUGH HERE, OBVIOUSLY CAN'T SCROLL BY PAGE         00077400
SCRLCHCK EQU   *                                                        00077500
NOSCRLP  OI    FLAGWORD,X'40'     SET NO SCROLLP BIT                    00077600
         STH   2,ENDTEXT        WHERE TO INSERT CURSUR FOR AFTER 'INS'  00077700
*                               I.E. NO LP HIT REQUIRED                 00077800
         SPACE 5                                                        00077900
*        COMES HERE WHEN DONE PUTTING OUT THE WHOLE DISPLAY             00078000
*        WHETHER IT FILL THE ENTIRE SCREEN OR NOT                       00078100
*                                                                       00078200
*        ALIGN THE GTRU AT THE END OF THE MAIN DISPLAY AND PUT IT IN.   00078300
*        TAG THE VERY LAST ENTRY IN THE DM , UPPER DM, LINETABLE,       00078400
*        AND THE TAG-LINK FILE                                          00078500
GRAPHORD MVI   4(8),X'FF'         SET END OF DM GLAG                    00078600
         MVC   0(6,4),ENDLINE    SO WON'T PATCH GTRU                    00078700
         LA    4,6(4)               FOR BLANKS JUST MOVED IN            00078800
         BAL   15,ALIGN             ALIGN THE GTRU                      00078900
         MVC   0(4,4),GTRU          PUT GTRU IN BUFFER                  00079000
         L     1,UPPERDM    POINTS TO NEXT ENTRY IN UPPER DM            00079100
         S     1,=F'12'     POINT TO PREVIOUS ENTRY                     00079200
         OI    8(1),X'80'    TAG LAST ENTRY                             00079300
         LA    1,TLFILE+12      SO CAN ADD DISP TO NEXT ENTRY TO GET    00079400
*                       THE LAST ENTRY                                  00079500
         A     1,TLFILE+4          ADD DISP TO WHERE NEXT ENTRY GOES    00079600
         OI    0(1),X'80'    SET LAST BIT                               00079700
         L     1,LTBIND        GET INDEX ON LINETABLE                   00079800
         S     1,=F'16'        R1 POINTS TO LAST ENTRY                  00079900
         OI    3(1),X'80'              TAG LAST ENTRY                   00080000
         EJECT                                                          00080100
*        PUT OUT ANY EXPLAINER IN TAGAREA THAT SHOULD BE THERE          00080200
*        THIS COULD BE NOTHING, PERHAPS                                 00080300
*                                                                       00080400
TAGENT   L     11,TLFILE     R11 POINTS TO ENTRY TO BE DISPLAYED        00080500
         LA    4,TAGBUF                POINTER INTO BUFFER              00080600
         TM    0(11),X'FF'    ARE THERE ANY ENTRIES AT ALL?             00080700
         BO    GOHOME    NO, GO HOME                                    00080800
         IC    1,0(11)            GET CHAR TYPE FROM FILE ENTRY         00080900
         STC   1,TAGBUF           PUT CHAR IN BUFFER                    00081000
         NI    TAGBUF,X'7F'     GET RID OF HIGH ORDER BIT               00081100
         MVI   TAGBUF+1,C' '   MOVE IN TWO BLANKS                       00081200
        MVI   TAGBUF+2,C' '                                             00081300
         LA    4,3(4)                   INCREMENT PAST MARKER & BLANKS  00081400
         L     10,TLFILE+8   POINTER TO TOP OF DATA SECTION             00081500
         LH    9,2(11)      DISP TO EXPLAINER                           00081600
         SR    5,5      LENTH TO PUT OUT                                00081700
         IC    5,1(11)           GET LENTH OF EXPLAINER OUT OF TLFILE   00081800
         SR    6,6        ZERO DISP WITHIN ORDER                        00081900
         LA    14,3                    SPACE ON FIRST LINE(MARKER & BLA 00082000
         MVI   NUMCHAR+3,59       SET NUM OF CHARS ON 1 LINE IN EXPL    00082100
         LA    3,4                MAX NUMBER OF LINES TO PUT OUT        00082200
LOOOP    BAL   15,PUTINBF    PUT STRING IN TAGAREA                      00082300
         LTR   5,5  IF LENTH LEFT = 0, GO TO GOHOME                     00082400
         BNH   GOHOME                                                   00082500
         BAL   15,FILLOUT    FILL REST OF LINE WITH BLANKS              00082600
         LH    9,2(11)     GET DISP IN DATA SECTION                     00082700
         BAL   15,CLRBLANK     CLEAR INITIAL BLANKS                     00082800
         SR    14,14                                                    00082900
         BCT   3,LOOOP            ONLY PUT OUT 4 LINES AT MOST          00083000
         EJECT                                                          00083100
*        ALIGN THE GTRU AT THE END OF TAGAREA AND PUT IT IN TAGAREA     00083200
*        THEN RETURN TO THE CALLING PROGRAM                             00083300
GOHOME   BAL   15,ALIGN             ALIGN FOR THE GTRU                  00083400
         MVC   0(4,4),GTRU1    MOVE IN THE GTRU                         00083500
         LA    2,TAGAREA          WHAT TO WRTIE                         00083600
         LA    3,450         HOW MUCH                                   00083700
         LA    4,GTRU+2           WHERE TO WRITE (BUFFER ADDR)          00083800
         BAL   5,WRITE            WRITE OUT TAGAREA                     00083900
         LA    2,DISPLAY          WHAT TO WRITE (MAIN DISPLAY)          00084000
         LA    3,3750             HOW MUCH                              00084100
         L     4,=V(START)        WHERE IN THE SCOPE BUFFER             00084200
         BAL   5,WRITE            PUT OUT MAIN DISPLAY                  00084300
RET      L     13,4(13)             HSA ADDRESS                         00084400
         LM    14,12,12(13)       RELOAD CALLERS REGS                   00084500
         LA    15,8               RETURN CODE IN CASE WERE SCROLLING    00084600
         BR    14                 RETURN                                00084700
WRITE    L     1,=V(GDECB)        ADDR OF A GRAPHIC DECB                00084800
         MVI   0(1),0             CLEAR ECB                             00084900
         MVI   4(1),X'A0'         SET TYPE OF I/O                       00085000
         ST    2,12(1)            SET AREA ADDR                         00085100
         ST    3,20(1)            SET LENTH                             00085200
         ST    4,28(1)            SET BUFFER ADDR                       00085300
         L     15,8(1)                                                  00085400
         L     15,48(15)          GIOCR ADDR FROM DCB                   00085500
         BALR  14,15              LINK TO I/O ROUTINE                   00085600
         LA    0,1                NUMBER OF ECB'S TO WAIT ON            00085700
         SVC   1                  WAIT FOR I/O TO FINISH                00085800
         BR    5                  RETURN                                00085900
         EJECT                                                          00086000
TAGFOR   SAVE                                                           00086100
         L     11,TLFILE            R11 POINTS AT ENTRY BEING DISPLAYED 00086200
         TM    0(11),X'80'         IF LAST ENTRY IN FILE,               00086300
         BO    RET                  DON'T ADVANCE                       00086400
         LA    11,4(11)             POINT AT NEXT ENTRY IN FILE         00086500
         ST    11,TLFILE            RESET POINTER                       00086600
         B     TAGENT+4             REDISPLAY THE EXPLAINER             00086700
         SPACE 4                                                        00086800
TAGBACK   SAVE                                                          00086900
         L     11,TLFILE            R11 POINTS AT ENTRY CURRENTLY BEING 00087000
         C     11,INITADDS          CUR ENTRY VS WHERE TOP ENTRY GOES   00087100
         BE    RET                 IF FIRST ENTRY BEING PUT OUT,        00087200
*                                   DON'T BACK UP                       00087300
         S     11,=F'4'             DECRMENT POINTER AT ENTRY TO DISPLA 00087400
         B     TAGBACK-8            STORE POINTER AND REGENERATE        00087500
         SPACE 3                                                        00087600
         USING *,12                                                     00087700
CHAIN    STM   14,10,12(13)         SAVE REST OF REGS                   00087800
         LR    14,13                SAVE HSA ADDRESS                    00087900
         L     13,=A(SAVEAREA)      R13 POINTS TO SAVEAREA              00088000
         ST    14,4(13)             CHAIN FORWARD                       00088100
         ST    13,8(14)            CHAIN BACK                           00088200
         BR     11                                                      00088300
         DROP   12                                                      00088400
         EJECT SA                                                       00088500
*        PASS AREA WHEN CALLING GETITEM                                 00088600
*                                                                       00088700
         DC    F'0'                                                     00088800
BLOCK    DC    4F'0'       PASS AREA TO GETITEM                         00088900
         SPACE 2                                                        00089000
*        CALLING PROGRAM PUTS THE NUMBER OF LINES DESIRED ON DISPLAY IN 00089100
*        THIS FULLWORD                                                  00089200
*                                                                       00089300
NUMLINES DC    F'0'               THE NUMBER OF LINES GENERATED UP TO   00089400
*                                                                       00089500
*        SCROLL HAS A DSECT FOR OPOINT AND LTBIND;  KEEP THWM IN THIS   00089600
*                                                                       00089700
OPOINT DC F'2',2F'0'                                                    00089800
LTBIND   DS    F                  DYNAMIC POINTER INTO LABEL TABLE      00089900
DESNUM   DC    F'&NUMLINE.'       THE NUMBER OF LINES TO GENERATE       00090000
OPOINT2  DC   3F'0'                                                     00090100
MAPENTLN DC   F'0,8,16,16,8,8,8,0,8,8,8'                                00090200
ORDERLN  DC    F'4,8,12,12,4,8,8,4,8,8,4'      LENTHS OF ORDERS IN DS   00090300
UPPERDM  DC    F'0'       SAVES POINTER INTO UPPER DISPLAY MAP          00090400
INITADDS DC    A(TLFILE+16,0,TLDAT,TLDAT),X'FF'                         00090500
WORK     DC    F'0'                                                     00090600
STARTBUF DC    H'3000'                 STARTING BUFFER ADDEESS          00090700
ENDTEXT  DC   H'0'                                                      00090800
*                                                                       00090900
LINSTART DC H'0'                   SPACE AT WHICH LINE STARTS           00091000
FLAGWORD DC    X'0000'            MAKE SURE SUPPRESS BITS AREN'T ON     00091100
*                                                                     * 00091200
*        BIT 0 ON = NO SCROLLL                                          00091300
*        BIT 1 ON = NO SCROLLP                                          00091400
*        BIT 2 ON = PARAGRAPH IS LAST ORDER ON PAGE.  MAKE DELAYED      00091500
*              LINE TABLE INSERT                                        00091600
*        BIT 3 ON = FORMAT SYMBLOS ARE NOT TO BE DISPLAYED              00091700
*                                                                       00091800
*        BIT 4 ON = LABELS ARE NOT TO BE DISPLAYED                      00091900
*        BIT 5 ON = ONLY CALL LINTBINS ONCE LATE ( WAS IN INDENT MODE)  00092000
*        BIT 6 ON = CALL LTBINS PROPER NUM OF TIMES LATE (WAS IN SKIP   00092100
*              LINES MODE)                                              00092200
*        BIT 7 ON = DECREMENT DISP IN ORDERS BY 4 IF SCREEN FILLS IN    00092300
*              LTBINS ROUTINE                                           00092400
*        BIT 8 ON = HANGING INDENT BEING DISPLAYED                      00092500
*                                                                     * 00092600
*********************************************************************** 00092700
         PRINT NOGEN                                                    00092800
         LTORG                                                          00092900
GTRU     GTRU  978                                                      00093000
ENDLINE  DC    C'                              * * *  END  * * *'       00093100
END1     DC    C'                           '                           00093200
        EJECT                                                           00093300
*********************************************************************** 00093400
*                                                                     * 00093500
*              WHAT THE POINTERS AT TOP OF TLFILE ARE                 * 00093600
*        1.    ABS POINTER TO ENTRY BEING DISPLAYED                   * 00093700
*        2.    REL DISP RFOM BEGINNING OF ENTRIES TO WHERE NEXT ENTRY G 00093800
*        3.    ABS POINTER TO TOP OF DATA STORAGE AREA                * 00093900
*        4.    ABS POINTER TO WHERE TO PUT NEXT EXPL                  * 00094000
*                                                                     * 00094100
***R******************************************************************* 00094200
TLFILE   DS    (4+&TLFENT)F       TLFILE POINTERS AND ENTRIES           00094300
DISPLMAP DC    12F'0'             UPPER DISPLAY MAP                     00094400
         GINIT                                                          00094500
TAGAREA  GDPD                                                           00094600
         GEVM                                                           00094700
         GDV   0,690,B                                                  00094800
         GDV   4090,690,U       CROSS SCREEN LINE                       00094900
         GDV   3300,510,B                                               00095000
         GDV   4090,510,U          CROSS SCREEN LINE                    00095100
         GDV   3412,590,B                                               00095200
         GDV   3412,430,U          VERTICAL LINE                        00095300
         GDV   3328,585,B          POSITION FOR + LINE                  00095400
         GECP  B                                                        00095500
         GTXT  '-  ',0                                                  00095600
         GESD                                                           00095700
         GECP  B                                                        00095800
T1       GTXT  '2 ',0                                                   00095900
T2       GTXT  '8 ',0                                                   00096000
T3       GTXT  '16 ',0                                                  00096100
T4       GTXT  'PAGE',0                                                 00096200
         GDPD                                                           00096300
         GEVM                                                           00096400
         GDV   3328,435,B          POSITION FOR - LINE                  00096500
         GECP  B                                                        00096600
         GTXT  '+  ',0                                                  00096700
         GESD                                                           00096800
         GECP  B                                                        00096900
T5       GTXT  '2 ',0                                                   00097000
T6       GTXT  '8 ',0                                                   00097100
T7       GTXT  '16 ',0                                                  00097200
T8       GTXT  'PAGE',0                                                 00097300
T9       GEVM                                                           00097400
         GDV   4090,330,B                                               00097500
         GDV   0,330,U                                                  00097600
         GDV   0,620,B                                                  00097700
        GECF  B                                                         00097800
TAGBUF   DS    300X               BUFFER FOR TAGAREA                    00097900
GTRU1    GTRU  0                                                        00098000
         CNOP  2,4                                                      00098100
         GINIT                                                          00098200
DISPLAY  GSRT                                                           00098300
         GEVM                                                           00098400
         GDV   0,4000,B                                                 00098500
         GECP  B                                                        00098600
BUFFER   DS    800F                                                     00098700
LINTBL   DS    156F       STORAGE FOR LINE TABLE                        00098800
DISPM    DS    1000F                                                    00098900
TLDAT    DS    (&TLDATL)F         WHERE STRINGS (EXPLS) STORED          00099000
         EJECT                                                          00099100
R7       EQU   7                                                        00099200
R15      EQU   15                                                       00099300
CURRID   EQU   BLOCK                                                    00099400
SIMPFORM EQU   COMPFORM           IN EITHER CASE, SEE IF MARKER TO BE   00099500
*                                 PUT OUT                               00099600
TLFDISPL EQU   TLFILE             POINTER TO ENTRY BEING DISPLAYED      00099700
TLFCURNT EQU   TLFILE+4           POINTER TO WHERE NEXT FILE ENTRY GOES 00099800
TLFTOPDT EQU   TLFILE+8           POINTER TO TOP OF DATA AREA FOR EXPLS 00099900
TLFCURDT EQU   TLFILE+12         WHERE THE NEXT EXLP GOES               00100000
TLFENTRY EQU   TLFILE+16          WHERE ACTUAL FILE ENTRIES START       00100100
ENDOFDSP EQU   GRAPHORD                                                 00100200
         END                                                            00100300
