:READ  CREATEID ASSEMBLE C1 WORK    3/26/19  21:59
CREATEID ENTER                                                          00000100
        L     6,COUNTER          GET NUMBER USED TO NAME PAGES          00000200
        TM    COUNTER+3,1        GET COUNTER EVEN(ORDERS PAGE NAME)     00000300
         BZ    *+8         IF EVEN, KEEP. AS IS                         00000400
         LA    6,1(6)                                                   00000500
         LA    1,MAINBLCK              LOAD ADDRESS OF PARAMETER LIST   00000600
         L     15,=V(MAINTAIN)                                          00000700
         BALR  14,15          ADD FOUR BYTES TO LENTH OF VFU            00000800
         L     7,MAINBLCK+8      NEW ADDRESS OF VERSION FILE            00000900
         L     4,0(7)                                                   00001000
        LA    3,0(4,7)           R3 => JUST PAST END OF CURRENT VF      00001100
*                                (I.E. WHERE THIS AREA WILL GO IN VF)   00001200
         ST    6,0(3)                STORE ID NAME IN VF                00001300
         MVI   0(3),X'80'            SET LAST BIT IN VF SEQUENCE        00001400
         LA    4,4(4)                ADVANCE                            00001500
         ST    4,0(7)                                                   00001600
         ST    6,SCANNER             STORE IDNAME IN OUTPUT AREA        00001700
         LA    9,2                   BCT COUNTER FOR DATA, ORDER IR     00001800
         LA    2,20                     LENTH OF ORDERS MODEL           00001900
         LA    3,IDMODELO            MODEL: ORDERS                      00002000
         LA    1,PASS1                 GET R1 TO POINT TO IR RAM LIST   00002100
         SPACE 1                                                        00002200
MODELING ST    6,0(1)                STORE ID NAME IN PARAM LIST        00002300
         STH   2,6(1)                STORE LENGTH IN PARAM LIST         00002400
        L     15,=V(MAINTAIN)    PAGING ROUTINE                         00002500
        BALR  14,15              CALL PAGING                            00002600
         L     4,8(1)                GET CORE ADDRESSOF CREATED AREA    00002700
         ST    6,0(4)                  PUT IDNAME INTO MODEL            00002800
         S     2,=F'5'      4 FOR THE ID NAME & 1 FOR THE MVC           00002900
         EX    2,MVC                 MOVE THE APPROPRIATE MODEL IN      00003000
         LA    6,1(6)                INCREMENT IR NAME COUNTER          00003100
         LA    2,90                     LENTH OF DATA MODEL             00003200
         LA    3,IDMODELD            ADDRESS OF MODEL:  DATA            00003300
         BCT   9,MODELING            RETURN TO DO DATA MODEL            00003400
        ST    6,COUNTER          PUT NEXT AVAILABLE NAME IN COUNTER     00003500
         L     13,4(13)                                                 00003600
         RETURN  (14,12)                                                00003700
***********   DATA FOR CREATEID   ***********                           00003800
MVC      MVC   4(0,4),0(3)           MOVES MODEL INTO CREATED COREAREA  00003900
MAINBLCK DC    F'0',X'4000',3H'0',F'4'      RETRIEVE & INCREMENT BY 4   00004000
VFADD   EQU   MAINBLCK+8         WHERE MODIFY RETIRNS ADDR OF VF        00004100
         ENTRY VFADD                                                    00004200
COUNTER  DC    F'2'                                                     00004300
PASS1    DC    F'0'                  IDNAME                             00004400
         DC    H'0'                  CREATE BYTE                        00004500
         DC    H'0'                  LENGTH                             00004600
         DC    F'0'                  (ADDRESS)                          00004700
SCANNER  DC    3F'0'                                                    00004800
         ENTRY COUNTER,SCANNER                                          00004900
         LTORG                                                          00005000
         SPACE 1                                                        00005100
IDMODELO DC    F'20'                   LENGTH                           00005200
         DC    F'12'           DISPL OF ORDERS                          00005300
         DC    XL8'8100004A00040001'   LAST,CS,74CH,1ST DATA ENTRY      00005400
         SPACE 3                                                        00005500
IDMODELD DC    F'90'           LENGTH                                   00005600
         DC    F'12'           DISP OF DATA                             00005700
         DC    F'78'           DATA LENGTH                              00005800
         DC    CL74'***************                    START           X00005900
                       ****************'                                00006000
         END                                                            00006100
