:READ  GETID    ASSEMBLE C1 WORK    3/26/19  21:59
         PRINT NOGEN                                                    00000100
***** GETID *****                                                       00000200
****** ROUTINE TAKES IDNAME OUT OF OPOINT                               00000300
**********    RETURNS   ORDERS ADD IN ORDERS, DATA ADDR, IN DATA        00000400
*******                                                                 00000500
         SPACE 2                                                        00000600
*       INPUT                                                           00000700
*             R2 => BUNCH OF WORDS WITH LENTHS OF ORDERS                00000800
*             R3 => OTYPE                                               00000900
GETID   CSECT                                                           00001000
        LR    12,15              SET UP BASE                            00001100
        USING GETID,12           ESTABLISK ADDRESSABILITY               00001200
        LR    8,3                SO WON'T HAVE TO REPUNCH A LLT         00001300
         LR    11,14              SAVE RETURN ADDR                      00001400
         LA    1,PASS2               GET PARMA LIST ADDRESS IN REG 1    00001500
         MVC   4(4,1),4(8)           MOVE ID NAME INTO PASS AREA, OPOIN 00001600
         CLI   3(8),X'FF'            TEST FOR A DELETE                  00001700
         BE    DELSET                  IF SO, NO INCREMENT              00001800
         L     3,0(8)                GET TYPE OF MODIFY                 00001900
         SLL   3,2                   PREPAREA FOR BRANCH TABLE          00002000
         B     *+4(3)                                                   00002100
         B     NOINCR                0                                  00002200
         B     INCR                  1                                  00002300
         B     INCR                  2                                  00002400
         B     INCR                  3                                  00002500
         B     NOINCR                4                                  00002600
         B     INCR                5                                    00002700
         B     NOINCR                6                                  00002800
        B     REARRNG            7 => AM INSERTING REARRANGE            00002900
         B     INCR                  8                                  00003000
         B     INCR               9                                     00003100
         B     NOINCR             10                                    00003200
         SPACE 2                                                        00003300
***** INCREMENT THE ITEM CORE AREA, SO AS TO ALLOW ROOM TO UPDATE       00003400
INCR     LH    4,24(8)               GET STRING LNGTH                   00003500
         L     5,0(2,3)            INDEX FOWN ORDER LENS FOR TYPE OF    00003600
         ST    4,8(1)     DATA INCREMENT IN SECOND HALFWORD             00003700
         SR    6,6                 GET A ZERO                           00003800
         C     6,12(8)             IS DISP WITHIN ORDER = 0 (I.E. NO SP 00003900
         BE    *+8                                                      00004000
         LA    5,8(5)       OTHERWISE, ADD LENTH OF THE BOTTOM OF SPLIT 00004100
         STH   5,8(1)              PUT ORDERS INCR IN PARAM LIST        00004200
         L     15,=V(GETITEM)      ADD OF RETRIEVAL INTERFACE           00004300
         BALR  14,15    RETRIEVE THE PAGE !                             00004400
         SPACE 2                                                        00004500
         BR    11         RETURN                                        00004600
         SPACE 2                                                        00004700
NOINCR   SR    4,4       A DATA INCREMENT OF ZERO                       00004800
         B     INCR+4              GO SET UP PARAM LIST                 00004900
DELSET   SR    4,4                     A DATA INCREMET OF ZERO          00005000
         SR    5,5                     LENGTH OF TYPE EQUAL ZERO        00005100
         CLC   8(4,8),20(8)   DELETE IN SAME ORDER ?                    00005200
         BNE   INCR+8    IF NOT, THEN ORDER WON|H  WON'T BE SPLIT       00005300
         LA    5,8            INCREMENT TO ORDERS(SPLIT)                00005400
         B     INCR+8                  GO SET UP PARAM LIST             00005500
REARRNG L     4,=V(LENDATA)      WHERE LENTH'S AREA                     00005600
        L     5,4(4)             LENTH OF ORDERS INCR                   00005700
        L     4,0(4)             LENTH OF DATA TO BE INSERTED           00005800
         B     INCR+8             SET UP PARAM LIST AND SEE IF SPLIT    00005900
         SPACE 1                                                        00006000
PASS2    DC    5F'0'                 PARAMETER LIST FOR GETITEM         00006100
ORDERS   EQU   PASS2+12           ADDR OF ORDERS PAGE                   00006200
DATA     EQU   PASS2+16           ADDR OF DATA PAGE                     00006300
         ENTRY PASS2,ORDERS,DATA                                        00006400
         LTORG                                                          00006500
         END                                                            00006600
