:READ  HOOTMON2 ASSEMBLE C1 WORK    3/26/19  21:59
         PRINT NOGEN                                                    00000100
HOOTMON2 CSECT                                                          00000200
         USING *,12                                                     00000300
         LR    12,15                                                    00000400
TOPLOOP  LOAD  EP=TRANSMON                                              00000500
         LR    13,0                                                     00000600
         BAL   11,72(13)                                                00000700
         DELETE EP=TRANSMON                                             00000800
         MVI   ECB,0                                                    00000900
         ATTACH SF=(E,ATTACHL),MF=(E,CALL)                              00001000
         LR    2,1                                                      00001100
         WAIT  ECB=ECB                                                  00001200
         MVC   FLAGFLD(1),29(2)                                         00001300
         MVC   FLAGFLD+1(3),17(2)                                       00001400
         ST    2,PARAM                                                  00001500
DETACH   DETACH PARAM                                                   00001600
         B     TOPLOOP                                                  00001700
LINKLIB  DCB   DDNAME=LOADMODS,MACRF=(E),DSORG=PO,DEVD=DA,EXLST=EXLST   00001800
ATTACHL  ATTACH ECB=ECB,EP=X,DCB=LINKLIB,LPMOD=1,SHSPV=123,SF=L         00001900
EP       EQU   ATTACHL+28                                               00002000
CALL     CALL  ,(PARAM),VL,MF=L                                         00002100
ECB      DC    F'0'                                                     00002200
FLAGFLD  DC    F'0'                                                     00002300
PARAM    DC    H'0',CL40' '                                             00002400
DSNAME   DC    CL44' '                                                  00002500
EXLST    EQU   *                                                        00002600
         END   HOOTMON2                                                 00002700
