:READ  INITIAL  ASSEMBLE C1 WORK    3/26/19  22:00
         TITLE 'ROUTINE TO CREATE A HYPERTEXT DATA SET ONLINE'          00000100
*********************************************************************** 00000200
*                                                                     * 00000300
*        THESE ARE THE VARIABLES THAT CAN BE SET:                     * 00000400
*                                                                     * 00000500
*        &DISK     SHOULD BE SET TO YOUR SPECIFIC DISK UNIT           * 00000600
*                       (2311 OR 2314)                                * 00000700
*        &VOLUME   SHOULD BE SET TO THE NAME OF THE VOLUME FROM WHICH * 00000800
*                  YOU WISH TO DELETE DATA SETS                       * 00000900
*        &MAXSIZE  SHOULD BE SET TO THE MAXIMUM SIZE (IN TRACKS) OF   * 00001000
*                  THE DATA SET WHICH CAN BE CREATED ONLINE.          * 00001100
*                  THIS WAS DONE TO KEEP PEOPLE FROM EATING UP THE DISK 00001200
*                                                                     * 00001300
*                                                                     * 00001400
*        THE PROGRAM ENTERS "CONTINUOUS DELETE" MODE IF, WHEN THE     * 00001500
*             INITIAL DISPLAY APPEARS, THE PASSWORD, DEFINED BY       * 00001600
*             "PASSWORD" BELOW, IS TYPED IN, LEFT-JUSTIFIED.          * 00001700
*        THE PASSWORD CAN BE CHANGED BEFORE THE ASSEMBLY BY CHANGING  * 00001800
*             ITS DC BUT IT CANNOT BE CHANGED ONCE IT HAS BEEN        * 00001900
*             ASSEMBLED.                                              * 00002000
*                                                                     * 00002100
*        THE OBJECT DECK FOR ALLOCATE WAS INCLUDED WITH THE HYPERTEXT * 00002200
*             OBJECT LIBRARY SENT EARLIER.                            * 00002300
*                                                                     * 00002400
*                                                                     * 00002500
*                        G O O D   L U C K                            * 00002600
*                                                                     * 00002700
*                                                                     * 00002800
*********************************************************************** 00002900
         SPACE 3                                                        00003000
         LCLC  &DISK                                                    00003100
         LCLC  &VOLUME                                                  00003200
         LCLA  &MAXSIZE                                                 00003300
         SPACE 3                                                        00003400
**********************************************************************  00003500
&DISK    SETC  '2311'                                                   00003600
&DISK    SETC  '2314'                                                   00003700
&VOLUME  SETC  'AVDPAK'     REPLACE WITH DESIRED VOLUME NAME            00003800
&MAXSIZE SETA  50   MAX NO. OF TRACKS ALLOWED ONLINE                    00003900
**********************************************************************  00004000
         EJECT                                                          00004100
         PRINT NOGEN                                                    00004200
INITIAL  CSECT                                                          00004300
         USING *,13                                                     00004400
         B     84(15)                                                   00004500
         DC    AL1(7),CL7'INITIAL'                                      00004600
INISAV01 DC    18F'0'                                                   00004700
         STM   14,12,12(13)                                             00004800
         LR    14,13                                                    00004900
         LA    13,12(15)                                                00005000
         USING INISAV01,13                                              00005100
         ST    14,4(13)                                                 00005200
         ST    13,8(14)                                                 00005300
         OPEN  GDCB                                                     00005400
         ASGNBFR GDCB,BUFLEN                                            00005500
         SPAR  GACB                                                     00005600
         GREADR CLEAR,MIP,GDCB,INISAV01                                 00005700
         WAIT  1,ECB=CLEAR                                              00005800
         LH    2,GDCB+16          RELOCATE EVERYTHING IN SIGHT          00005900
         STH   2,ZERO                                                   00006000
         LH    3,WHNAME                                                 00006100
         AR    3,2                                                      00006200
         STH   3,WHNAME                                                 00006300
         LA    3,15(3)                                                  00006400
         STH   3,CURSADD                                                00006500
         LH    3,WHSIZE                                                 00006600
         AR    3,2                                                      00006700
         STH   3,WHSIZE                                                 00006800
         GWRITE REQUEST,BUF,GDCB,300,REQMESS,ZERO                       00006900
         WAIT  1,ECB=REQUEST                                            00007000
         GCNTRL INSERTC,INS,GDCB,CURSADD                                00007100
         WAIT  1,ECB=INSERTC                                            00007200
         GCNTRL START,STR,GDCB,ZERO                                     00007300
         WAIT  1,ECB=START                                              00007400
         WAITR 1,ECB=MAINLINE                                           00007500
         CLOSE (GDCB)                                                   00007600
         L     13,4(13)                                                 00007700
         RETURN (14,12)                                                 00007800
         EJECT                                                          00007900
         USING *,15                                                     00008000
ATTNROUT STM   14,12,12(13)                                             00008100
         B     SAVEA+72                                                 00008200
SAVEA    DC    18F'0'                                                   00008300
         LR    14,13                                                    00008400
         LA    13,SAVEA                                                 00008500
         ST    13,8(14)                                                 00008600
         ST    14,4(13)                                                 00008700
         DROP  15                                                       00008800
         USING SAVEA,13                                                 00008900
         SR    15,15                                                    00009000
         IC    15,COMAREA+3       GET ATTENTION TYPE                    00009100
         SLL   15,2                                                     00009200
         L     15,ADDR-4(15)                                            00009300
         BR    15                                                       00009400
END      MVI   INNAME,0                                                 00009500
         GREAD INNAME,BUF,GDCB,44,DSNAME,WHNAME                         00009600
         WAIT  1,ECB=INNAME                                             00009700
         CLI   PASSFLAG,1         IS HE IN SCRATCH MODE?                00009800
         BE    SCRATCH            YES, LET HIM SCRATCH THE DATA SET     00009900
         CLC   DSNAME(44),PASSWORD                                      00010000
         BNE   CREATEDS  IF HE DOESN'T GET IT, HE MUST BE               00010100
*                                 WANTING TO CREATE A DATA SET SO LET'M 00010200
         MVI   PASSFLAG,1         OTHERWISE SET FLAG SO HE CAN SCRATCH  00010300
         MVC   DSMESS(55),DELETE     TELL HIM HE'S IN DELETE MODE       00010400
         MVI   SIZEMESS,C' '     CLEAR OUT 'HIT JUMP' MESS              00010500
         MVC   SIZEMESS+1(63),SIZEMESS                                  00010600
         B     REWRITE                                                  00010700
CREATEDS MVI   INSIZE,0     CLEAR WAIT BIT                              00010800
         GREAD INSIZE,BUF,GDCB,3,SIZE,WHSIZE                            00010900
         WAIT 1,ECB=INSIZE                                              00011000
         LA    6,3                READ THREE DIGITS                     00011100
         SR    5,5                                                      00011200
         SR    4,4                                                      00011300
NUMLOOP  CLI   SIZE,C' '                                                00011400
         BE    BLANK                                                    00011500
         MH    5,=H'10'                                                 00011600
         TM    SIZE,X'F0'                                               00011700
         BNO   BADN                                                     00011800
         NI    SIZE,X'0F'                                               00011900
         IC    4,SIZE                                                   00012000
         AR    5,4                                                      00012100
BLANK    MVC   SIZE(3),SIZE+1                                           00012200
         BCT   6,NUMLOOP                                                00012300
         LTR   5,5                IF SIZE=0 DON'T WRITE ANYTHING        00012400
         BE    BADN                                                     00012500
         CH    5,=H'&MAXSIZE.'   MAXIMUM SIZE ALLOWED ONLINE            00012600
         BH    TOOBIG                                                   00012700
         STH   5,LENGTH                                                 00012800
         LA    1,PARMLIST                                               00012900
         L     15,=V(ALLOCATE)                                          00013000
         BALR  14,15                                                    00013100
         STM   15,0,SAVERC                                              00013200
         B     *+4(15)                                                  00013300
         B     OK                                                       00013400
         B     CANT                                                     00013500
         B     CANT                                                     00013600
         B     EXISTS                                                   00013700
CANT     MVC   DSMESS(55),IOERRMES                                      00013800
         B     REWRITE                                                  00013900
EXISTS   MVC   DSMESS(55),BADNMESS                                      00014000
         B     REWRITE                                                  00014100
ADDR     DC    A(END,CANCEL,0,0,CANCEL)                                 00014200
PASSFLAG DC    X'0'                                                     00014300
         SPACE 5                                                        00014400
*                                                                       00014500
*                                                                       00014600
PASSWORD DC    CL44'THIS IS THE NEW PASSWORD'                           00014700
*                                                                       00014800
*                                                                       00014900
         EJECT                                                          00015000
OK       LH    5,LENGTH                                                 00015100
WRITE    WRITE OUT,SF,CREATE,NODE                                       00015200
         CHECK OUT                                                      00015300
         BCT   5,WRITE                                                  00015400
DONE     CLOSE (CREATE)                                                 00015500
CANCEL   POST  MAINLINE                                                 00015600
WAITAGN  L     13,4(13)                                                 00015700
         RETURN (14,12)                                                 00015800
         EJECT                                                          00015900
SCRATCH  SR    0,0                R0 MUST BE ZERO FOR A SCRATCH         00016000
         MVI   RETCODE,0          CLEAR OUT RETURN CODE                 00016100
         SCRATCH DATASET        SCRATCH DATA SET                        00016200
         CLI   RETCODE,0      SEE IF IT WAS SCRATCHED OK                00016300
         BE    REWRITE                                                  00016400
         CLI   RETCODE,1          SEE IF IT DOESN'T EXIST               00016500
         BE    NOTHERE                                                  00016600
         MVC   BADLEN(34),IOTROUB      MUST BE SOMETHING ELSE SO TELL   00016700
         B     SKIPBLNK                                                 00016800
NOTHERE  MVC   BADLEN(34),ALLGONE                                       00016900
         B     SKIPBLNK                                                 00017000
         SPACE 2                                                        00017100
DATASET  CAMLST SCRATCH,DSNAME,,VOLIST                                  00017200
VOLIST   DC    H'1'   ONLY 1 VOLUME                                     00017300
         AIF   ('&DISK' EQ '2311').UNIT11                               00017400
         DC    X'30C02008'     FOR 2314                                 00017500
         AGO   .OUT1                                                    00017600
.UNIT11  DC    X'30002001'     HYOPEFULLY FOR 2311'S                    00017700
.OUT1    ANOP                                                           00017800
         DC    CL6'&VOLUME.'     VOLUME NAME                            00017900
         DC    H'0'    SEQUENCE NUMBER = 0                              00018000
RETCODE  EQU   *-1        SCRATCH RETURN CODE PLACED HERE               00018100
IOTROUB  DC    CL34'UNABLE TO SCRATCH DESIRED DATA SET'                 00018200
ALLGONE  DC    CL34'NO FICTICIOUS NAMES ALLOWED'                        00018300
         EJECT                                                          00018400
REWRITE  MVI   BADLEN,C' '                                              00018500
         MVC   BADLEN+1(33),BADLEN                                      00018600
SKIPBLNK MVI   AGAIN,0                                                  00018700
         GWRITE AGAIN,BUF,GDCB,300,REQMESS,ZERO                         00018800
         WAIT  1,ECB=AGAIN                                              00018900
         MVI   INSC,0                                                   00019000
         GCNTRL INSC,INS,GDCB,CURSADD                                   00019100
         WAIT  1,ECB=INSC                                               00019200
         MVI   RESTART,0                                                00019300
         GCNTRL RESTART,STR,GDCB,ZERO                                   00019400
         WAIT  1,ECB=RESTART                                            00019500
         B     WAITAGN                                                  00019600
TOOBIG   MVC   BADLEN(34),BADBIG                                        00019700
         B     *+10                                                     00019800
BADN     MVC   BADLEN(34),BADSIZE                                       00019900
         MVC   DSMESS(55),ORIGMESS                                      00020000
         B     SKIPBLNK                                                 00020100
PARMLIST DC    A(DSNAME)                                                00020200
EXLST    DC    X'87',AL3(JFCBAREA)                                      00020300
         DC    A(LENGTH)                                                00020400
         DC    A(CREATE)                                                00020500
IOERRMES DC    CL55'TEMPORARILY OUT OF ORDER; PLEASE CANCEL ME WITH DUMX00020600
               P'                                                       00020700
BADNMESS DC    CL55'THAT ONE ALREADY EXISTS; TRY ANOTHER OR CANCEL:'    00020800
ORIGMESS DC    CL55'TYPE IN NAME OF DATA SET YOU WISH TO CREATE:'       00020900
DELETE   DC    CL55'HI THERE: THIS IS CONTINUOUS DELETE MODE; KEY 0 ENDX00021000
               S IT'                                                    00021100
BADSIZE  DC    CL34'THAT''S A BAD NUMBER; TRY ANOTHER'                  00021200
BADBIG   DC    CL34'THAT''S TOO BIG; ONLINE MAX = &MAXSIZE.'            00021300
         EJECT                                                          00021400
         GINIT                                                          00021500
REQMESS  GSRT                                                           00021600
         GEVM                                                           00021700
         GDV   10,3200,B                                                00021800
         GECP  B                                                        00021900
DSMESS   DC    CL55'TYPE IN NAME OF DATA SET YOU WISH TO CREATE:'       00022000
         GCNL  3                                                        00022100
         GECF  L                                                        00022200
NAME     DC    CL44'SYS1.P1518.AVD.'                                    00022300
         GECP  B                                                        00022400
         GCNL  3                                                        00022500
SIZEMESS GTXT  'HIT JUMP KEY AND  TYPE IN SIZE (NO. OF TRACKS) OF THE DX00022600
               ATA SET: '                                               00022700
         GECF  L                                                        00022800
FORSIZE  GTXT  '   '                                                    00022900
         GEVM                                                           00023000
         GDV   700,1400,B                                               00023100
         GECP  L                                                        00023200
BADLEN   DC    CL34' '                                                  00023300
BACK     GTRU  0                                                        00023400
WHNAME   DC    AL2(NAME-REQMESS)                                        00023500
WHSIZE   DC    AL2(FORSIZE-REQMESS)                                     00023600
CURSADD  DS    H                                                        00023700
MAINLINE DC    F'0'                                                     00023800
COMAREA  DC    4F'0'                                                    00023900
ZERO     EQU   BACK+2                                                   00024000
BUFLEN   DC    H'8192'                                                  00024100
LENGTH   DC    H'0'                                                     00024200
         DC    CL12'RETURN CODES'                                       00024300
SAVERC   DC    2F'0'                                                    00024400
DSNAME   DC    CL44' '                                                  00024500
SIZE     DC    CL3' '                                                   00024600
         LTORG                                                          00024700
         EJECT                                                          00024800
         AIF   ('&DISK' EQ '2311').DCB2311                              00024900
CREATE   DCB   DDNAME=NEWDS,DSORG=PS,MACRF=(W,R),RECFM=F,EXLST=EXLST,  X00025000
               LRECL=7200,BLKSIZE=7200                                  00025100
         AGO   .OUT                                                     00025200
.DCB2311 ANOP                                                           00025300
CREATE   DCB   DDNAME=NEWDS,DSORG=PS,MACRF=(W,R),RECFM=F,EXLST=EXLST,  X00025400
               LRECL=3600,BLKSIZE=3600                                  00025500
.OUT     ANOP                                                           00025600
GDCB     DCB   DSORG=GS,MACRF=(WC,RC),GTYPE=BASIC,DDNAME=SCOPE          00025700
GACB     SAEC  DCB=GDCB,EP=ATTNROUT,COMAREA=COMAREA,                   X00025800
               ATTNTYP=(END,CANCEL),PFKMSK=(0)                          00025900
         EJECT                                                          00026000
NODE     DC    F'-1'                                                    00026100
         DC    221F'0'                                                  00026200
         DC    X'FF010000'                                              00026300
         DC    2F'0'                                                    00026400
         DC    X'00010100'                                              00026500
         DC    H'400',H'0'                                              00026600
         DC    100F'0'                                                  00026700
JFCBAREA DS    200X                                                     00026800
         END   INITIAL                                                  00026900
