:READ  NORMAL   ASSEMBLE C1 WORK    3/26/19  22:00
         MACRO                                                          00000100
&LAB     MCALL &ENTRY,&CHECK=NO                                         00000200
&LAB     L     15,=V(&ENTRY)      LOAD BRANCH ADDRESS                   00000300
         AIF   ('&CHECK' EQ 'NO').NOCHECK                               00000400
         LTR   15,15             IF PROGRAM NOT PRESENT,                00000500
         BE    *+6               DON'T BRAMCH                           00000600
.NOCHECK BALR  14,15             BRANCH TO ROUTINE                      00000700
          MEND                                                          00000800
         SPACE 5                                                        00000900
         LCLC  &MERGE                                                   00001000
         LCLC  &SYSSIZE                                                 00001100
         LCLC  &GJP                                                     00001200
         LCLC  &SCOPE                                                   00001300
&GJP     SETC  'NO'               HYPRTEXT CAN USE CANCEL KEY           00001400
&GJP     SETC  'YES'              PANIC KEY MUST BE A FUNCTION KEY      00001500
&SCOPE   SETC  'MOD1'             CAN SPLIT TEXT WITH INCREMENTAL VECTO 00001600
&SCOPE   SETC  'MOD3'             INCREMENTAL VECTORS NOT ALLOWED       00001700
&SYSSIZE SETC  'MINI'             LEAVE OUT LITTLE USED FUNCTIONS       00001800
&SYSSIZE SETC  'BIG'              PUT IN ALL THE GLOP                   00001900
&MERGE   SETC  'NO'               DON'T WANT MERGE                      00002000
&MERGE   SETC  'YES'              DO WANT MERGE                         00002100
         SPACE 3                                                        00002200
*****    THIS IS A LARGE FONT SYSTEM                                    00002300
*******************                                                     00002400
*******************       ABENDS       ******************************** 00002500
*                                                                     * 00002600
*        U 001 => LP'ED ABEND                                         * 00002700
*        U 002 => MISMATCH ON PAGE NAMES WHEN STORING                 * 00002800
*********************************************************************** 00002900
         SPACE 2                                                        00003000
         ENTRY GDCB,COMAREA,BLANKS,GACB                                 00003100
         ENTRY BUFFER,BUFFERA,MESSADD,START,RLTAGADD,TYPE,POINT,LABEL   00003200
         ENTRY POP,LINK1,PSW,MAPENTLN,GDECB                             00003300
         ENTRY GTRU2                                                    00003400
         SPACE 3                                                        00003500
NORMAL   CSECT                                                          00003600
         USING *,15               ESTABLISH ADDRESSABILITY              00003700
         B     84(15)                   BRANCH AROUND SAVEAREA          00003800
         DC    AL1(7),CL7'NORMAL'       IDENTIFIER                      00003900
SAVEREGS DC    18F'0'                   SAVEAREA                        00004000
         STM   14,12,12(13)             SAVE REGS                       00004100
         LR    14,13                                                    00004200
         LM    11,13,BASES           LOAD THEM BASE REGS                00004300
         USING SAVEREGS,13,12,11                                        00004400
         DROP  15                                                       00004500
         ST    14,4(13)                 CHAIN FORWARD                   00004600
         ST    13,8(14)                 CHAIN BACK                      00004700
         BAL   9,GOPEN                 LET'S OPEN TO THE SCOPE AND ASGN 00004800
          EJECT                                                         00004900
         LA    3,RELOCADD            R3 POINTS TO LIST OF ADDS          00005000
         LA    4,4                   INCREMENT FOR BXLE                 00005100
         LA    5,UNDO-4              COMPARAND FOR BXLE                 00005200
         LH    8,GDCB+16          GET BUFFER START ADDRESS              00005300
RELOC    L     6,0(3)                R6 POINTS AT GRAPHIC ORDER         00005400
         LH    7,2(6)                GET SCOPE BUFFER ADD TRANSFER IS T 00005500
         AR    7,8                ADD BUFFER START FIELD FROM DCB       00005600
         STH   7,2(6)                STORE BACK RELOCATED ADDRESS       00005700
         BXLE  3,4,RELOC             LOOP                               00005800
         B     UNDO                                                     00005900
RELOCADD DC    A(GTRU1,GTRU,START-2,TAGADD-2,RLTAGADD-2,PATCH,ABMEND)   00006000
         DC    A(G1,MESSADD-2,RENTADD,DUMPADD)                          00006100
         DC    A(STARTBUF-2)                                            00006200
UNDO     EQU   *                                                        00006300
         EXTRN STARTBUF                                                 00006400
         EXTRN GTRU1,GTRU                                               00006500
         SPACE 3                                                        00006600
         L     5,=V(BLKSIZE)      ADDR OF MAX PAGE SIZE                 00006700
         LH    5,0(5)             R5 HAS MAX PAGE SIZE                  00006800
         S     5,TWENTY4          SUBTRACT A LITTLE FOR PAGE HEADER     00006900
         L     6,=V(MAXLEN)       SET UP SO SCRUNCH WILL HAVE RIGHT MAX 00007000
         ST    5,0(6)             PUT LEN INSIDE SCRUNCH                00007100
          EJECT                                                         00007200
         SPIE  ABCOND,((1,15))                                          00007300
         SPACE 3                                                        00007400
         MVC   ENDMESS-4(4),ABMEND   MOVE GTRU YO END OF DS REQUEST     00007500
         LA    5,INITMESS              WHAT TO WRITE                    00007600
         LA    6,ENDMESS-INITMESS      LENTH OF MESSAGE                 00007700
         LA    7,START                                                  00007800
         BAL   9,WRITE                 WRITE OUT OUR MEASLY REQUEST     00007900
         LA    7,2990+CURSMESS-INITMESS   DISP TO WHERE CURSUR IS PUT   00008000
         AH    7,GDCB+16               RELOCATE IN BUFFER               00008100
         STH   7,CURSADD                                                00008200
         BAL   9,INSERTC      PUT OUT THE CURSUR                        00008300
         LA    5,COMAREA          AREA TO PUT MIP DATA INTO             00008400
         MVI   IOTYPE,X'08'       CODE FOR R  GREADR MIP                00008500
         BAL   9,WRITE+4          DO THE SCOPE I/O                      00008600
         BAL   9,RESTART               LET USER SEE THE DISPLAY         00008700
         BAL   9,SPAR        SET UP ATTENTION HANDLER                   00008800
         B     WAIT                                                     00008900
          EJECT                                                         00009000
READDSNM LA    5,LINKSTCK       WHERE TO READ USER'S FILE NAME INTO     00009100
         LA    6,44                  HOW MUCH                           00009200
         LA    8,DSNAME-INITMESS+2990  DISP IN BUFFER TO WHERE NAME     00009300
         AH    8,GDCB+16          TUPED IN + BUFFER START ADDRESS       00009400
         STH   8,CURSADD          STORE AD  SCOPE BUFFER ADD TO INSERT  00009500
         LA    7,CURSADD             WHERE TO READ FROM                 00009600
         BAL   9,READ                READ IN REQUESTED DS NAME          00009700
         BAL   10,WRITRENT        GO WRITE OUT RENT MESSAGE             00009800
         LA    1,LINKSTCK       R1 => DSET USER WISHES TO ACCES         00009900
         MCALL INIT                                                     00010000
         SPACE 3                                                        00010100
RETRVF   MVI   BLOCK+4,X'40'         TO RETRIEVE A PAGE                 00010200
         LA    1,BLOCK         ADDRESS OF PARAMETER LIST                00010300
         MCALL MAINTAIN        TRY TO RETRIEVE                          00010400
         LTR   15,15           CHECK RETURN CODE                        00010500
         BE    NOTFIRST                                                 00010600
*********************************************************************** 00010700
         LA    6,4                LEMTH OF BOTH VF AND LABEL TABLE      00010800
         L     2,=XL4'80000008'                                         00010900
         ST    2,BLOCK+4                                                00011000
         L     3,=V(VFADD)                                              00011100
         BAL   5,INITPAGE         GO INITIALIZE VF                      00011200
         OI    BLOCK+3,X'01'                                            00011300
         L     3,=V(LABTABAD)  ADD OF WHERE ADD OF LABLE TABLE IS STORE 00011400
         BAL   5,INITPAGE         INITIALIZE THE LABEL TABLE            00011500
         MCALL CREATEID        OTHERWISE, CREATE INITIAL ID             00011600
         B     BEGCALL                                                  00011700
INITPAGE MCALL MAINTAIN           CREATE THE PAGE                       00011800
         L     4,BLOCK+8          ADDR OF PAGE JUST CREATED             00011900
         ST    4,0(3)          PUT LABEL TABLE ADD IN LABTABAD          00012000
         ST    6,0(4)             PUT LENTH IN FIRST WORD OF PAGE       00012100
         BR    5                  RETURN                                00012200
         EJECT                                                          00012300
NOTFIRST L     2,BLOCK+8               ADDRESS OF VF                    00012400
         L     3,=V(VFADD)                                              00012500
         ST    2,0(3)                                                   00012600
          A     2,0(2)    R2 NOW POINTS TO WHERE COUNTER STORED         00012700
         L     4,0(2)              GET COUMTER                          00012800
         L     3,=V(COUNTER)           ADDRESS OF COUNTER USED FOR LABE 00012900
         ST    4,0(3)              PUT IT IN 'COUNTER'                  00013000
*               (TO P OF VF + LENTH OF ACTUAL VF )                      00013100
         B     BEGCALL                                                  00013200
         SPACE 3                                                        00013300
CANCLKEY EQU   *                                                        00013400
         TM    FLAG,X'08'         SHOULF RETURN INTO ROUT ANYWAY ?      00013500
         BOR   10                 RET IF B  FLAG SET                    00013600
         MVI   DISABLE3+1,9   RESET FOR E OR C INTERRUPTS (GETPICT)     00013700
         NI    FLAG,X'A2' ANTI-TEXTSCAN,PUNCH,NEWAREA,BORROW,BUSTED ROU 00013800
         MVI   LABNOP+1,X'F0'     SO WE WON'T GO AROUND INSERTING       00013900
*                                 INTERNAL LABELS EVERYWHERE            00014000
         MVI   FREENOP+1,X'00'     CLEAR THE FREEMAIN SWIRCH            00014100
         NI    TRAVMASK,X'FB'   DISABLE NEWAREA KEY                     00014200
BEGCALL  MVC   GACB+8(4),=X'FBFFFFFF'   ENABLE ALL BUT NEWAREA          00014300
         MVI   GACB+15,2          ENABLE SCROLL GAS PEDAL ( LP )        00014400
CALLL    MVC   BUFFER(12),TRANSTAB  BLANK OUT ROUTINE NAME              00014500
         LA    2,1560                                                   00014600
         LA    2,N1(2)       ADDRESS OF STRING                          00014700
         MVC   BUFFER+12(60),0(2) MOVE'HIT FUNCT KEY OF DESIRED ' TO BU 00014800
         SPACE                                                          00014900
FREENOP  NOP   CALLER         ****** FREEMAIN SWITCH *********          00015000
         CLI   FREE,X'00'    SHOULD FREEMAIN A BLOCK?                   00015100
         BE    CALLER        NO, JUST CALL BEGIN                        00015200
         MVI   FREE,X'00'    CLEAR FLAG                                 00015300
         SPACE                                                          00015400
FREEMAIN FREEMAIN E,LV=0,A=COREADD                                      00015500
         SPACE                                                          00015600
CALLER   MCALL BEGIN                                                    00015700
          EJECT                                                         00015800
NOINITIZ BAL   3,WRITPRMT         WRIRE PROMPT AND START BUFFER         00015900
NOP3     NOP   WAIT    DON' T RETURN TO SUPER WHEN WAITWORD WAS POSTED  00016000
         LA    10,BIGWAIT         IF GUY LP'S MAIN TEXT, RETURN IMMED   00016100
         CLI   GACB+8,X'FB'       AM REENTERING ROUTINE ?               00016200
         BE    BIGWAIT     NO, GO TO BIGWAIT                            00016300
         MVC   GACB+8(4),=X'FBFFFFFF'   CLEAR IN CASE LTRAV CALLED REGU 00016400
         MVI   GACB+15,2          ALLOW LP FOR GAS PEDAL SCROLL         00016500
         TM    FLAG,X'01'         I REALLY SHOULD RETURND INTO ROUTINE? 00016600
         BZ    BIGWAIT            NO, IT WAS JUST A FALSE ALARM(REG     00016700
         NI    FLAG,X'FE'         TURN OFF FLAG SINCE I KNOW ITS ON     00016800
         OI    FLAG,X'02'         CAN'T WRITE BLANKS ON A REARRANGE NOW 00016900
         L     5,BACKRTAD    GET ADDRESS TO RETURN TO IN ROUTINE(PREVIO 00017000
         BR    5    GO BACK TO ROUTINE                                  00017100
         SPACE 3                                                        00017200
WRITPRMT LA    5,BUFFERA          WANT TO WRITE OUT PROMPYS             00017300
         LA    6,235              LENTH OF PROMPT AREA                  00017400
         LA    7,MESSADD                                                00017500
         BAL   9,WRITE                                                  00017600
         BAL   9,RESTART                RESTART                         00017700
         BR    3                  RETURN TO CALLER                      00017800
         EJECT                                                          00017900
WAIT     MVI   NOP3+1,X'00'                                             00018000
         MVI   WAITWORD,0                                               00018100
         OI    FLAG,X'80'         AM ENTERING ATTEN ROUTINE             00018200
         SPACE 2                                                        00018300
*********************************************************************** 00018400
*              POSTS OF MAINLINE WAIT                                   00018500
*                                                                       00018600
*        255 => TIME TO CLOSE UP SHOP AND GO HOME TO REST               00018700
*        100 => GO TO FORMAT PHASE                                      00018800
*        0 => GO TO SCROLLER                                            00018900
***************                                                         00019000
         WAITR ECB=WAITWORD   ************* MAINLINE WAIT ***********   00019100
         SPACE 2                                                        00019200
         NI    FLAG,X'7F'         NO LONGER IN ATTEN ROUTINE            00019300
         MVI   NOP3+1,X'F0'     SO AS NOT TO RETURN TO SUPER            00019400
         CLI   WAITWORD+3,100     CALL FOR DAVE?                        00019500
         BE    CALLTEXT                                                 00019600
         CLOSE GDCB                                                     00019700
         CLI   WAITWORD+3,255  TIME TO CLOSE UP SHOP ?                  00019800
         BE    CLOSSHOP             THEN GO RETURN TO SUPER             00019900
         LA    1,PSW                                                    00020000
         MCALL GOLDBUG,CHECK=YES                                        00020100
         EJECT                                                          00020200
         BAL   9,GOPEN            OPEN TO SCOPE AGAIN AND ASGNBFR       00020300
         BAL   9,SPAR        SET UP ATTENTION HANDLING                  00020400
         B     BEGCALL                                                  00020500
         SPACE 3                                                        00020600
         DS    0F                 ALIGN                                 00020700
         DC    CL4'GACB'          IDENTIGIER                            00020800
GACB     SAEC  EP=ATTNROUT,DCB=GDCB,COMAREA=COMAREA,PFKMSK=NULL,       X00020900
               ATTNTYP=(END),RESTART=YES                                00021000
         SPACE 3                                                        00021100
COMAREA  DC    4F'0'                                                    00021200
WAITWORD DC    F'0'                                                     00021300
BAKRTAD1 DC    F'0'                                                     00021400
RLTAGADD DC    H'978'                                                   00021500
TAGADD   DC    X'0436'            BUFFER ADDR IN EXPL AREA JUST PAST G  00021600
          EJECT                                                         00021700
CALLTEXT OI    FLAG,X'20'         TO KNOW WHERE TO GO ON BOMBOUT        00021800
         LA    1,GACB             GIVE HIM ADDR SO HE CAN CHANGE ADDRS  00021900
         MCALL TXT360,CHECK=YES                                         00022000
         NI    FLAG,X'DF'         SO TXT360BM WONHT BE CALLED ON NEXT B 00022100
         LA    2,ATTNROUT          ADDR OF EP OF MY ATTENTION ROUTINE   00022200
         ST    2,GACB+16          CHANGE IN GACB PARAMS                 00022300
         LA    2,COMAREA          WHERE TO STORE TYPE OF INTERR INFO    00022400
         ST    2,GACB+0           PUT INTO GACB                         00022500
         MVC   BUFFER+72(4),G1    MOVE GTRU TO HIDE DAVE'S MESSAGES     00022600
         B     BEGCALL                                                  00022700
         SPACE 5                                                        00022800
WHATNEXT LA    5,DUMPMESS         WRITE OUT MESSAGE ASKING WHAT TO      00022900
         LA    6,DUMPLEN          DO NEXT (WRITE TO DISK,               00023000
         LA    7,START            ABEND, ETC)                           00023100
         BAL   9,WRITE            WRITE OUT                             00023200
         BAL   9,RESTART          START SCOPE BUFFER RUNNING            00023300
         OI    FLAG,X'40'         DON'T CALL TEXTSCAN ON LP HIY         00023400
         BAL   10,DISABLE2        WAIT FOR CANCEL OR LP                 00023500
         LH    1,COMAREA+6        BUFFER ADDRESS WHERE HIT OCCURED      00023600
         SH    1,DUMPADD+2        MINUS MESSAGE START ADDRESS           00023700
         SH    1,=H'10'           MINUS LENTH OF GRAPHIC ORDERS         00023800
         SRL   1,3                DIVIDE BY 8 (8 CHARS IN EACH ALTERNA) 00023900
         SLL   1,2                MULTIPLY BY 4 TO GET INDEX            00024000
         L     4,ABNDADDS(1)      LOAD ADDRESS OF PROPER ROUTINE        00024100
         BR    4                  GO TO ROUTINE                         00024200
ABNDADDS DC    A(COPYDISK,FINISH,ABEND)                                 00024300
         EJECT                                                          00024400
CLOSSHOP L     13,4(13)           HSA ADDR                              00024500
          RETURN  (14,12)                                               00024600
         SPACE 3                                                        00024700
GOPEN    OPEN  (GDCB)                                                   00024800
         ASGNBFR  GDCB,BUFLEN                                           00024900
         BR    9                  RETURN                                00025000
         SPACE 3                                                        00025100
SPAR     SPAR  GACB                                                     00025200
         BR    9                   RETURN                               00025300
         EJECT                                                          00025400
         USING ATTNROUT,15                                              00025500
ATTNROUT STM   14,12,12(13)     SAVE INTERRUPT HANDLERS REGS            00025600
         LR    14,13                                                    00025700
         ST    14,HYSAV     SAVE ADDR OF  SUPER'S SAVE AREA             00025800
         LM    10,13,MYSAVE       LOAD RETURN ADDR AND BASE REGS        00025900
         ST    13,8(14)                                                 00026000
         DROP  15                                                       00026100
         SR    15,15    ZERO R 15                                       00026200
         IC    15,COMAREA+3    GET TYPE OF INTERRUPT                    00026300
         SLL   15,2     MULTIPLY BY FOUR                                00026400
         L     15,ADDRESS-4(15)       GET ADDRESS OF TYPE ROUTINE       00026500
         BR    15    GO YE                                              00026600
LP       TM    FLAG,X'40'         CHECK IF TEXTSCAN TO BE CALLED        00026700
         BOR   10                 IF NOT, JUST GO TO ROUTINE            00026800
         LR    1,13               SET ALLOW SCROLL FLAG                 00026900
         CLI   GACB+8,X'80'       SEE IF ONLY PANIC KEY ENABLED         00027000
         BNE   *+6                BRANCH IF TRACVEL OR REG MASK IN      00027100
         SR    1,1                SORRY, NO SCROLLING ALLOWED           00027200
         L     15,=V(TEXTSCAN)    ROUTINE TO SCAN DISPL MAP             00027300
         BALR  14,15                                                    00027400
         B     *+4(15)            CHECK RETURN CODE                     00027500
         B     BIGWAIT+4          DON'T CLOBBER ADDRESS TO RETURN INTO  00027600
EORC     B     0(10)              RETURN INTO ROUTINE                   00027700
*        IF HERE, HE USED THE GAS PEDAL SCROLL                          00027800
         BAL   3,WRITPRMT         REWRITE PROMPT AND START BUFFER       00027900
         OI    FLAG,2             SET FOR NO BUFFER DELETE ON REARRANGE 00028000
         B     BIGWAIT+4          DON'T CLOBBER ADDR TO RETURN INTO     00028100
ADDRESS  DC    A(EORC,KEYBOARD,LP,0,CANCLKEY)                           00028200
TIMEIT   DC    F'0'                                                     00028300
         SPACE 3                                                        00028400
KEYBOARD CLI   GACB+8,X'FB'     AM REALLY ATTEMPTING TRAVLE IN OTHER    00028500
         BE    TIMER                   NO, GO TO TIMER                  00028600
         MVC   BACKRTAD(4),BAKRTAD1    PUSH REENTER ADDRESS             00028700
         OI    FLAG,X'01'         AM REALLY BEING INTERRUPTED IN ROUT   00028800
          MVI   FREENOP+1,X'F0'         WHRN BEGIN CALLED, DON'T FRREE  00028900
         NI    FLAG,X'BF'         CLEAR NO TEXTSCAN FLAG                00029000
         SPACE 1                                                        00029100
TIMER    L     1,HUGE    GET X'80000000'                                00029200
         SR    7,7      SO SA NOT TO INDEX BAD                          00029300
         IC    7,COMAREA+2    GET FUNCTION KEY NO.                      00029400
         SRL   1,0(7)       SLIDE ON BIT TO APPROPRIATE POSITION        00029500
         ST    1,TIMEIT        STORE MASK OF FUNCTION KEY TO LIGHT      00029600
         SLL   7,2     MULTIPLY BY 4                                    00029700
         LA    5,TIMEIT           AREA TO LIGHT KEYS FROM               00029800
         MVI   IOTYPE,X'50'       WANT TO LIGHT FUNCTION KEYS           00029900
         BAL   9,WRITE+4          GO LIGHT THE KEYS                     00030000
         SPACE 3                                                        00030100
         B     *+4(7)      GO TO ROUTINE                                00030200
         AIF   ('&GJP' EQ 'NO').SCRLER                                  00030300
         B     CANCLKEY         PANIC KEY ON SYSTEMS WITH GJP           00030400
         AGO   .GJPRD                                                   00030500
.SCRLER  B     BIGWAIT            AN UNUSED KEY                         00030600
.GJPRD   B     WHATNEXT           BUTTON TO GET OFF SYSTEM WITH         00030700
         B     BIGWAIT            MY ONE FUNCTION KEY                   00030800
         B     NICEPRNT                                                 00030900
         B     POP1                                                     00031000
         B     NEWAREA                                                  00031100
         AIF   ('&MERGE' EQ 'NO').MINI1                                 00031200
         B     PUNCH              PUNCHES ALL TEXT BETWEEN TWO LPHS     00031300
         AGO   .MAX1                                                    00031400
.MINI1   B     BIGWAIT            *** UNUSED ***                        00031500
.MAX1    B     FRMDISPL           DISPLAY OR DON'T DISPLAY FORMATS      00031600
         B     SINGDEL            DELETE A SINGLE CHAR                  00031700
         B     GOODY            BOMBOUT                                 00031800
         B     GETLAB                                                   00031900
         B     MAKELAB                                                  00032000
         B     MAKETAG                                                  00032100
         B     TAGFOR              MOVE EXP.AIMER FORWARD               00032200
         B     TAGBACK                                                  00032300
         B     SCROLLR           GO SET UP TO CALL SCROLLER             00032400
         B     DELELAB           DELETE A LABEL FROM THE LABEL TABLE    00032500
         B     MAKELINK                                                 00032600
         AIF   ('&SYSSIZE' EQ 'MINI').MINI2                             00032700
         B     INSTANCE                 KEY 2                           00032800
         B     INSINST                  KEY 8                           00032900
         AGO   .MAX2                                                    00033000
.MINI2   B     BIGWAIT            *** UNUSED ***                        00033100
         B     BIGWAIT            *** UNUSED ***                        00033200
.MAX2    B     COPY               COPY A SECTION OF TEXT                00033300
         B     REARNG                   KEY 4                           00033400
         B     LINKORBR           KEY TO TAKE BRANCH OR LINK            00033500
         B     MAKEBRAN                                                 00033600
         AIF   ('&SYSSIZE' EQ 'MINI').MINI3                             00033700
         B     BORROW             OUR NEW FUNCTION                      00033800
         AGO   .MAX3                                                    00033900
.MINI3   B     BIGWAIT            *** UNUSED ***                        00034000
.MAX3    B     DELETE             DELETE A SECTION OF TEXT              00034100
         B     SUBSTITU       **** KEY 6 **********                     00034200
         B     INSERT                   KEY 6                           00034300
         B     SCRLBKPG          SCROLL BACK BY PAGE                    00034400
         B     SCRLBACK                                                 00034500
         B     SCROLP                   KEY 15                          00034600
         B     SCROLL                   KEY 7                           00034700
         SPACE 3                                                        00034800
BIGWAIT  ST    5,BAKRTAD1       SAVE REEENTER ADDRESS AFTER LINK        00034900
         ST    10,MYSAVE          SAVE WHERE TO GO BACK TO AFTER INTERR 00035000
         L     13,HYSAV    GET ADDR OF SUPER'S SAVE AREA                00035100
         LM    14,12,12(13)                                             00035200
         BR    14                                                       00035300
          EJECT                                                         00035400
MYSAVE   DC    A(READDSNM)   USDE TO SAVE RETURN ADDR INTO PROPER ROUT  00035500
BASES    DC    A(SAVEREGS+8192,SAVEREGS+4096,SAVEREGS)                  00035600
HUGE     DC    X'80000000'                                              00035700
         SPACE 3                                                        00035800
FRMDISPL LA    2,480              ASK WHAT HE WANTS TO DISPLAY          00035900
         BAL   3,MVINST           WRITE OUT PROMPT                      00036000
         OI    FLAG,X'40'         SO TEXTSCAN WON'T BE CALLED           00036100
         LA    5,FRMDISPL              WHERE TO RETURN INTO ROUTINE     00036200
*                                      AFTER TRAVELLING                 00036300
         BAL   10,DISABLE2        LP OR CANCEL                          00036400
*        CHECK TO SEE IF HE LP'ED PROMPT                                00036500
         LA    1,84               LENTH OF PROMPT AREA                  00036600
         AH    1,GDCB+16          ADD BUFFER STARTV  ADRRES             00036700
         CH    1,COMAREA+6        END OF PROMPT VS HIT ADDRESS          00036800
         BNH   BIGWAIT            IF LP NOT IN PROMPT, WAIT UNTIL IT IS 00036900
*        SEE WHICH REQUEST HE LP'ED                                     00037000
         L     2,=V(FLAGWORD)     WHERE SUPPRESS FLAGS ARE              00037100
         LA    1,49               RIGHT BETWEEN REQUESTS                00037200
         AH    1,GDCB+16          RELOCATE                              00037300
         CH    1,COMAREA+6        SEE IN WHICH HALF OF MESSAGE HIT OCCU 00037400
         BL    SWITFORM           IF HIT SECOND HALF, BRANCH            00037500
*        CHANGE LABELS                                                  00037600
         XI    0(2),X'08'         SET BIT FOR LAGELS                    00037700
         B     *+8                DON'T CHAMGE OTHER BIT                00037800
*        DON'T DISPLAY FORMATS                                          00037900
SWITFORM XI    0(2),X'10'         CHANGE FORMAT SUPPRESS BIT            00038000
         LA    8,FRMDISPL+12           WHERE TP GO ON FUDGE RETURN      00038100
         B     SETUPRET           RETURN INTO THIS ROUTINE              00038200
         SPACE 2                                                        00038300
NICEPRNT LA    0,100              COMPLETION CODE TO CALL TXT360        00038400
         SR    2,2                ZERO                                  00038500
         ST    2,GACB+8           DISABLE ALL INTERRUPTS                00038600
         MVI   GACB+15,0          NO LP'S, CANCEL, OR END               00038700
         LA    1,WAITWORD         ECB TO BE POSTED                      00038800
         SVC   2                  ISSUE POST SVC                        00038900
        B     BIGWAIT                                                   00039000
SCROLLR  SR    0,0                COMPLETION CODE TO CALL SCROLLER      00039100
         B     NICEPRNT+4         POST AND RETURN                       00039200
         SPACE 2                                                        00039300
SCRLBKPG LA    1,37               MOVE BACK SCREEN - 1 LINE             00039400
         L     15,=V(SCRLBACK)    ROUTINE TO BACK UP DS                 00039500
BALR     BALR  14,15              LINK TO ROUTINE                       00039600
         B     NOINITIZ                                                 00039700
SCROLL   LA    1,1                NUMBER OF LINES TO SCROLL FORWARD     00039800
         L     15,=V(SCROLLL)      ROUTINE TO SCROLL FORWARD            00039900
         B     BALR               GO LINK TO ROUTINE                    00040000
         EJECT                                                          00040100
SCROLP   LA    1,37               PUT BOTTOM LINE AT TOP                00040200
         B     SCROLL+4           LINK TO SCROLL FORWARD ROUTINE        00040300
SCRLBACK LA    1,1               NUM OF LINES TO MOVE BACK              00040400
         B     SCRLBKPG+4         GO LINK TO SCROLLBACK ROUTINE         00040500
         SPACE 2                                                        00040600
BACKRTAD DC    F'0'     RETURN ADDRESS AFTER SCROLL OR RETRIEVR         00040700
HYSAV    DC    F'0'                                                     00040800
BUFLEN   DC    H'8192'                                                  00040900
         SPACE 2                                                        00041000
TAGFOR   L     15,=V(TAGFOR)      MOVE EXPL FORWARD                     00041100
         B     BALR               GO LINK TO ROUTINE                    00041200
TAGBACK  L     15,=V(TAGBACK)     MOVE EXPL BACK ONE                    00041300
         B     BALR               GO LINK TO ROUTINE                    00041400
          EJECT                                                         00041500
         AIF   ('&MERGE' EQ 'NO').MINI4   LEAVE OUT MERGE ?             00041600
PUNCH    LA    2,156              DISP TO ROUTINE NAME                  00041700
         BAL   3,MVRTNAM          PUT OUT ROUTINE NAME                  00041800
         LA    2,300         DISP TO PROMPT                             00041900
         BAL   3,MVINST           PUT OUT PROMPT                        00042000
         OI    FLAG,X'40'         DON'T CALL TEXTSCAN                   00042100
PUNWAIT  LA    5,PUNCH            WHERE TO COME BACK INTO ROUTINE       00042200
         BAL   10,DISABLE5        LP, CANCEL, AND TRAVEL                00042300
*********************************************************************** 00042400
         LA    1,80                LEN OF PROMPT + GRAPHIC ORDERS       00042500
         AH    1,GDCB+16          ADD BUFFER START ADDRESS              00042600
         CH    1,COMAREA+6        SEE IF LP'SD PROMPT OR TEXT           00042700
         BL    SEEIFTXT           SEE IF HE LP'ED TEXT SINCE HE DIDN'T  00042800
*                                 HIT THE PROMPT                        00042900
*        SEE WHAT HE HIT IN PROMPT                                      00043000
         SH    1,=H'19'           GET POINTER BETWEEN LAST 2 OPTIONS    00043100
         CH    1,COMAREA+6        MAKE SURE IDIOT DIDN'T HIT TEXT PROMP 00043200
         BL    GETNUM             IF HIT ADDR >, THEN HE WANT TYPE IN   00043300
*        IF HERE, HE LP'ED ONE OF THE FIRST TWO OPTIONS                 00043400
         SH    1,=H'20'           GET POINTER BETWEEN FIRST TWO OPTIONS 00043500
         CH    1,COMAREA+6           OUR POINTER VS HIT ADDR            00043600
         BH    BIGWAIT         IF OUR PINTER > HIT ADDR, HE LP'ED TRAVE 00043700
*        SET FLAG TO CARRY LABELS                                       00043800
         L     15,=V(PRINTER)      ADDR OF MERGE PROGRAM                00043900
         LTR   15,15              SEE IF PROGRAM IS THERE               00044000
         BE    BIGWAIT            IF NOT HERE, DON'T BOMB               00044100
         OI    12(15),X'0F'        SET FLAG TO CARRY LABELS             00044200
         B     BIGWAIT                                                  00044300
*        SO HE WANTS TO SET BRANCH OPTION                               00044400
GETNUM   SR    2,2                DISP TO PROMPT                        00044500
         BAL   8,FORNAME          GIVE HIM CURSUR IN TAGAREA            00044600
*                                                                       00044700
*        READ IN AND CONVERT HIS THREE IDIOT DIGITS                     00044800
*                                                                       00044900
         LA    5,MYSAVE           WHERE TO READ INTO                    00045000
         LA    6,4                      READ ONE EXTRA SO CAN FIND CURS 00045100
        BAL   9,READCURS         READ IN HIS NUMBER                     00045200
         SR    1,1                INITIALLY NUMBER = 0                  00045300
         LA    2,3                MAX NUM OF DIGITS                     00045400
         SR    4,4                ZERO REGISTER INITIALLY               00045500
CONVLOOP CLI   0(5),X'1A'         CURSIR ?                              00045600
         BE    DONE               ALL OVER IF SO                        00045700
         TM    0(5),X'F0'         A LEGAL NUMBER IN CHAR FORM ?         00045800
         BNO   GETNUM             IF NOT, LET HIM  GIVE US ANOTHER NUM  00045900
         NI    0(5),X'0F'         CLEAR TOP DIGIT                       00046000
         IC    4,0(5)             PICK UP DIGIT                         00046100
        MH    1,=H'10'                                                  00046200
         AR    1,4                                                      00046300
        LA    5,1(5)             POINT AT NEXT DIGIT                    00046400
         BCT   2,CONVLOOP         LOOP                                  00046500
DONE     L     9,=V(BROPTION)     PLACE IN PRINTER TELLING WHICH BRANCH 00046600
         LTR   9,9                IF BROPTION NOT HERE, DONHT BOMB      00046700
         BE    *+8                                                      00046800
         STH   1,0(9)             SET UP BROPTION                       00046900
         B     PUNCH+8            SET UP ORIG PROMPT                    00047000
*********************************************************************** 00047100
         SPACE 2                                                        00047200
SEEIFTXT LR    1,13               ALLOW SCROLL                          00047300
         L     15,=V(TEXTSCAN)    ROUTINE TO SEE WHAT WAS LP'ED         00047400
         BALR  14,15              SEE IF HIT IN TEXT                    00047500
         B     *+4(15)            CHECK RETURN CODE                     00047600
         B     BIGWAIT+4          HIT NOT ANYWHERE NICE                 00047700
         B     *+12               HIT WAS IN MAIN TEXT AREA             00047800
         BAL   3,WRITPRMT         GAS PEDAL SCROLL, SO WRITE PROMPT     00047900
         B     BIGWAIT+4          RESTART BUFFER AND WAIT AGAIN         00048000
         TM    FLAG,X'10'         SEE IF THIS IS SECOND HIT             00048100
         BO    SECNDHIT           IF SET, AM ALL SER TO PUNCH           00048200
         OI    FLAG,X'10'         SEE   MAKE SURE NEXT TIME WE PUNCH    00048300
         MVC   STRTPNT(12),POINT  SAVE WHERE LP HIT OCCURED             00048400
         B     PUNWAIT            ALLOW HIM TO SET BROPTION IN MIDDLE   00048500
*********************************************************************** 00048600
SECNDHIT SR    2,2                WANT A ZERO INCREMENT FROM GETITEM    00048700
         ST    2,BLOCK+8          SET IN PARAM AREA                     00048800
         L     2,POINT            PAGE NAME WHERE SECOND HIT OCCURED    00048900
         ST    2,BLOCK+4          PUT PAGE NAME IN PARAM ARAE           00049000
         LA    1,BLOCK            R1 POINTS TO PARAM AREA               00049100
         MCALL GETITEM            RETRIEVE PAGE                         00049200
         L     2,BLOCK+12         R2 POINTS TO TOP OF ORDERS PAGE       00049300
         AH    2,POINT+6          ADD DISP TO HIT ORDER                 00049400
         IC    3,12(2)            + LEN OF PAGE HEADER = ORDER CODE     00049500
         OI    12(2),X'80'        SET BIT IF NOT ALREADY THERE          00049600
*        SET END OF AREA BIT IN VF                                      00049700
         L     4,=V(VFADD)        ADDR OF ADDR OF VF                    00049800
         L     4,0(4)             ADDR OF VF                            00049900
         CLC   5(3,4),POINT+1     LOOK FOR PAGE OF SECOND LP HIT        00050000
         LA    4,4(4)                                                   00050100
         BNE   *-10                                                     00050200
         IC    5,0(4)             SAVE HIGH ORDER BYTE                  00050300
         OI    0(4),X'80'         SET END OF AREA BIT                   00050400
         L     6,=V(OPOINT)         PRESERVE OPOINT FROM GETITEM        00050500
         MVC   ENTPNT(12),0(6)      THROUGH PRINTER                     00050600
         L     7,STACKIND         INDEX ON RETURN KEY STACK             00050700
         LA    1,STRTPNT          ¢  R1 => WHERE TO START               00050800
         L     15,=V(PRINTER)                                           00050900
         LTR   15,15              IF PRINTER NOT PRESENT, LET'S         00051000
         BE    *+10               NOT BOMB OUT                          00051100
         OI    12(15),X'F0'       SET FLAG SAYING THIS A MERGE          00051200
         BALR  14,15              CALL THE PUNCHER                      00051300
         ST    7,STACKIND         BECUASE PRINTER CALLS LINK1 WHO STACK 00051400
         MVC   0(12,6),ENTPNT       RESTORE OPOINT                      00051500
         STC   5,0(4)             RESET BIT    IN VF                    00051600
*        RECALL GETITEM TO TUNR OFF LAST BIT                            00051700
         L     2,POINT            RESET PAGENAME BECAUSE PRINTER CALLS  00051800
         ST    2,BLOCK+4          LINK1 WHO MESSES UP BLOCK             00051900
         LA    1,BLOCK                                                  00052000
         MCALL GETITEM                                                  00052100
         L     2,BLOCK+12         R2 => ORDERS PAGE                     00052200
         AH    2,POINT+6          ADD DISP TO SECOND HIT ORDER          00052300
         STC   3,12(2)            RESET ORDERCODE                       00052400
         NI    FLAG,X'AF'      TURN OFF NO TEXTSCAN & WANT SECOND PUNCH 00052500
         B     BEGCALL            ALL DONE                              00052600
         EJECT                                                          00052700
.MINI4   ANOP                                                           00052800
*GENERAL  SUBROUTINES                                                   00052900
*  EVENOROD TELLS WHETHER HIT ADD EVEN OR ODD                           00053000
* R2 HAS  WHERE TO WRITE WRITE IT OUT                                   00053100
*  R3 HAS LENGTH OF TEXT                                                00053200
*  R4 POINTS TO TEXT                                                    00053300
*  PTCHCHAR  HAS CHARS INSERTED AROUND TEXT                             00053400
ADDTEXT  LA    14,PTCHAREA+2    POINTER INTO BUFFER                     00053500
         LA    15,PTCHCHAR                                              00053600
         SR    1,1                      ZERO REG 1                      00053700
         IC    1,EVENOROD               WAS HIT ADD ODD OR EVEN         00053800
         B     *+4(1)                                                   00053900
         B     ODDADD                   BRANCH IF ADDRESS ODD           00054000
         LA    1,4                      MOVE 5 CHARS TO END OF TEXT     00054100
         MVC   PTCHAREA+2(1),PTCHCHAR   MOVE IN FIRST CHAR              00054200
         LA    14,1(14)                 INCREMENT                       00054300
         LA    15,1(15)                 INCREMENT                       00054400
         B     *+8                                                      00054500
ODDADD   LA    1,5       MOVE SIX CHARS TO END OF 1 TEXT (ODD ADD)      00054600
NOP20    NOP   NODOWN          FALL IF WANT TEXT SPREAD                 00054700
         MVI   *-3,X'F0'                                                00054800
         BAL   7,ALIGN       ALIGN BUFFER POINTER TO PROPER BOUNDARY    00054900
         AIF   ('&SCOPE' EQ 'MOD1').MOD11                               00055000
         MVI   CHARTYP+1,X'40'         CHAR MODE UNPROTECTED            00055100
         BAL   7,MOVEDOWN              MOVE TEXT DOWN TO TYEP IN AREA   00055200
         AGO   .MOD33                                                   00055300
.MOD11   MVC   0(GDVDNLN,14),GDVDWN  JUMP THE TEXT DOWN                 00055400
         LA    14,GDVDNLN(14)     INCREMENT BUFFER POINTER              00055500
.MOD33   ANOP                                                           00055600
NODOWN   LR    0,14                                                     00055700
         S     0,=A(PTCHAREA)                                           00055800
         AH    0,0(2)                                                   00055900
         STH   0,CURSADD                                                00056000
         MVI   0(14),C' '      A BLANK FOR THE CURSUR                   00056100
         LA    14,1(14)        INCREMENT AROUND BLANK                   00056200
         CH    3,=H'255'         IF INSERT LONGER THAN 255, THEN        00056300
         BNH   *+8           CUT LEN TO 255                             00056400
         LA    3,255             SUBSTITUTE MAX LEN                     00056500
         EX    3,MOVEIN                 MOVE REMAINDER OF TEXT IN       00056600
         AR    14,3          POINT PAST STRING                          00056700
NOP21    NOP   ASID            FALL IF TEXT TO SPREAD                   00056800
         MVI   *-3,X'F0'                                                00056900
         BAL   7,ALIGN       ALIGN BUFFER POINTER TO HALFWORD BOUNDARY  00057000
         AIF   ('&SCOPE' EQ 'MOD3').MOD31                               00057100
         MVC   0(6,14),GDVDWN                                           00057200
         MVI   5(14),X'44'       SET PROTECTED CHAR MODE                00057300
         LA    14,6(14)                                                 00057400
         AGO   .MOD13                                                   00057500
.MOD31   MVI   CHARTYP+1,X'44'         CHAR MODE PROTECTED              00057600
         BAL   7,MOVEDOWN              MOVE TEXT DOWN AFTER TYPE IN ARE 00057700
.MOD13   ANOP                                                           00057800
ASID     EX    1,MVPTIN        MOVE IN CHARS FROM PTCHCHAR              00057900
         LA    14,1(1,14)               GET NEW ADDR                    00058000
         BAL   7,ALIGN                  PUT GRAPH ORDS ON HALFWORD BOUN 00058100
         MVC   0(4,14),GTRU2 MOVE IN GTRU BACK TO WHERE PATCH FROM      00058200
         LA    5,PTCHAREA               WRITE ZEROS                     00058300
         LA    6,60(3)       LEMN TO WRITE = STRG LEN + ORDERS LEN      00058400
         LR    7,2           GET ARDRESS OF WHERE TO WRITE OUT          00058500
         BAL   9,WRITE                                                  00058600
         BR    10                       RETURN                          00058700
         AIF   ('&SCOPE' EQ 'MOD1').MOD14                               00058800
         SPACE 4                                                        00058900
MOVEDOWN LA    0,RESTRMDE-BOTMDOWN(14)   GET DISP WITHIN CORE BUFFER    00059000
         S     0,=A(PTCHAREA)          OF WHERE TO STORE X,Y REGS       00059100
         AH    0,0(2)                  ADD WHERE IT WILL BE WRITTEN     00059200
         STH   0,STRREGS+2        SET BUFFER ADDR TO STRORE X,Y REGS    00059300
         MVC   0(KLUGELEN,14),BOTMDOWN MOVE IN INCREMENTALS             00059400
         LA    14,KLUGELEN(14)         INCRE POINTER INTO BUFFER        00059500
         BR    7                       RETURN                           00059600
.MOD14   ANOP                                                           00059700
         EJECT                                                          00059800
ALIGN    ST    14,MYSAVE        STORE TO REST LOW ORDER BIT             00059900
         TM    MYSAVE+3,1       ON HALFWORD BOUNDARY ?                  00060000
         BZR   7             REURN IF ALREADY EVEN                      00060100
         MVI   0(14),X'00'                                              00060200
         LA    14,1(14)                                                 00060300
         BR    7             RETURN                                     00060400
         SPACE 3                                                        00060500
MVPTIN   MVC   0(0,14),0(15)            FOR MOVING FROM PTCHCHAR        00060600
MOVEIN   MVC   0(0,14),0(4)             FOR MOVING FROM TEXT            00060700
         SPACE 2                                                        00060800
         GINIT BPY=100            TO PREVENT MNOTE                      00060900
PTCHAREA GECF  B                                                        00061000
         DC    314AL1(0)          AREA TO USE AS BUFFER FOR JUNK        00061100
GTRU2    GTRU  0                    PLACED AT END OF PATCH(HSA          00061200
*                                   DUMMY ADDRESS TO GO TO)             00061300
         SPACE 3                                                        00061400
TEXTDOWN MVI   NOP20+1,X'00'                                            00061500
         MVI   NOP21+1,X'00'                                            00061600
         B     ADDZEROS                                                 00061700
TEXTASIS MVI   NOP20+1,X'F0'                                            00061800
         MVI   NOP21+1,X'F0'                                            00061900
         B     ADDZEROS                                                 00062000
         SPACE 5                                                        00062100
         AIF   ('&SCOPE' EQ 'MOD3').MOD32                               00062200
GDVDWN   GEVI2                                                          00062300
         GDV   0,-80,B                                                  00062400
         GECF  B                                                        00062500
GDVDNLN  EQU   *-GDVDWN           FOR LENTH OF ORDERS                   00062600
         AGO   .MOD12                                                   00062700
.MOD32   ANOP                                                           00062800
BOTMDOWN GEVI2                                                          00062900
         GDV   0,-80,B                 MOVE DOWN ONE LINE               00063000
STRREGS  GSXY  0                       ADDR FILLED IN AT RUN TIME       00063100
         GEVM                                                           00063200
RESTRMDE GDV   0,0,B                   RESET TO ABS CHAR MODE           00063300
CHARTYP  GECF  B                       MODE CHANGED AT RUN TIME         00063400
KLUGELEN EQU   *-BOTMDOWN              LENTH OF GRAPHIC ORDERS          00063500
.MOD12   ANOP                     PATCH IN BUFFER)                      00063600
         EJECT                                                          00063700
* R2  POINTS TO  H  WITH HIT ADDR                                       00063800
* CHARS  STORED IN PTCHCHAR                                             00063900
* ADDRESS IN BUFFER TO RETURN TO STORED IN PTCHADD                      00064000
* R 10   RETURN                                                         00064100
ADDPTCH  LA    5,PTCHCHAR               WHERE TO READ                   00064200
         LA    6,6                      HOW MANY                        00064300
         TM    1(2),1                   ADD ODD                         00064400
         BZ    *+24                     BRANCH IF NOT                   00064500
         MVI   EVENOROD,0      SET FLAG FOR ODD                         00064600
         LA    15,1                     ROUND  ADDRESS                  00064700
         AH    15,0(2)                                                  00064800
         STH   15,0(2)                                                  00064900
         B     *+8                      BRANCH AROUND FLAGSETTING       00065000
         MVI   EVENOROD,4      SET FLAG FOR EVEN                        00065100
         LR    7,2                      GET HIT ADD                     00065200
         BAL   9,READ                   READ IN CHARS                   00065300
         LA    5,PATCH                  SET TO WRITE PATCH              00065400
         BAL   9,WRITE                  WRITE                           00065500
         LH    15,0(2)                  SET RETURN ADDRESS IN PTCHADD   00065600
         LA    15,4(15)                                                 00065700
         STH   15,PTCHADD                                               00065800
         BR    10                       RETURN                          00065900
PTCHCHAR DC    6C' '                                                    00066000
PATCH    GTRU  7000                                                     00066100
         GECP  B                                                        00066200
         SPACE 5                                                        00066300
         EJECT                                                          00066400
*  R3 CONTAINS  00  LETTERS ARE NOT  INSERTED                           00066500
*  R3 CONTAINS  F0  LETTERS ARE INSERTED                                00066600
ADDZEROS STC   3,NOP1+1                 SET GATE                        00066700
         MVC   SAVECHAR(6),PTCHCHAR     SAVE PTCHCHAR                   00066800
NOP1     B     LEAVCHAR                                                 00066900
         XC    PTCHCHAR(6),PTCHCHAR     ZERO PTCHCHAR                   00067000
LEAVCHAR ST    10,RETT                                                  00067100
         LA    3,256      HOW MANY ZEROS                                00067200
         LA    4,ZEROS                  WHERE ZEROS ARE                 00067300
         BAL   10,ADDTEXT               CONSTRUCT PTCHAREA              00067400
         MVC   PTCHCHAR(6),SAVECHAR     RESET PTCHCHAR                  00067500
         L     10,RETT                                                  00067600
         BR    10                       RETURN                          00067700
RETT     DC    F'0'                                                     00067800
SAVECHAR DC    6C' '                                                    00067900
ZEROS    DC    C' ',280X'00'                                            00068000
EVENOROD DC    X'00'                                                    00068100
         SPACE 2                                                        00068200
BLANKS   DC    260C' '                                                  00068300
         SPACE                                                          00068400
CHKORD   CLC   TWO(2),THREE     FIRST BUFFER ADDRESS LESSV THAN SECOND  00068500
         BL    BACKK    IF SO, GO TO BACKK                              00068600
         LH    1,THREE   SWAP BUFFER ADDRESSES                          00068700
         MVC   THREE(2),TWO                                             00068800
         STH   1,TWO                                                    00068900
         LM    1,3,STRTPNT    SWAP POINTS                               00069000
         MVC   STRTPNT(12),ENDPNT                                       00069100
         STM   1,3,ENDPNT                                               00069200
BACKK    BR    4   RETURN                                               00069300
         SPACE 2                                                        00069400
GETMAIN  ST    6,GETCORE+4   LENTH TO BE GETMAINED                      00069500
         ST    6,FREEMAIN+4     IS ALSO THE LENTH TO BE FRREEMAINED     00069600
         LR    4,6           LENTH FOR SWAPOUT                          00069700
GETCORE  GETMAIN EC,LV=0,A=COREADD       GET AREA TO READ STRING INTO   00069800
         B     *+4(15)       CHECK RETURN CODE FROM GETMAIN             00069900
         B     SAFE          DID GET THE CORE                           00070000
         L     15,=V(SWAPOUT)                                           00070100
         BALR  14,15         MAKE ROOM IN CORE                          00070200
         B     GETCORE       TRY AGAIN                                  00070300
         SPACE                                                          00070400
SAFE     L     5,COREADD     LOAD ADDRESS OF GETMAINED AREA             00070500
         MVI   FREE,X'FF'    SET FLAG TO FREEMAIN THIS BLOCK LATER      00070600
         BR    10            RETURN                                     00070700
COREADD  DC    F'0'                                                     00070800
FREE     DC    X'00'                                                    00070900
         EJECT                                                          00071000
* R2= POINT                                                             00071100
* R3= LABEL                                                             00071200
* R4= ADDR OF STRING                                                    00071300
* R5= LENTH OF STRING                                                   00071400
* (R6)= TYPE                                                            00071500
ADDTODS  L     15,=V(OTYPE)    GET ADDRESS OF OTYPE                     00071600
         STC   6,3(15)         SET TYPE OF  MODIFY                      00071700
         MVC   4(12,15),0(2)   MOVE IN A POINT                          00071800
         MVC   16(8,15),0(3)   MOVE IN LABEL                            00071900
         STH   5,24(15)     PASS LENTH OF STRING                        00072000
         ST    4,28(15)      PUT ADDRESS OF STRING IN OSTRING           00072100
CALL     MCALL MODIFY                                                   00072200
         STM   2,6,12(13)         STORE REGS FOR STKXHK                 00072300
         LR    3,6                TYPE OF INSERT                        00072400
         SLL   3,24               ZERO TOP OF REG                       00072500
         SRL   3,22               MULT BU 4                             00072600
         L     0,ORDERLN(3)       PASS LENTH OF INSERT                  00072700
*        HAVE R2 => POINT                                               00072800
         MVI   NOP50+1,X'F0'                                            00072900
         BAL   1,SETUPCHK         WE KNOE DS HAS BEEN MOVED             00073000
         MVI   NOP50+1,X'00'                                            00073100
         BR    10              RETURN                                   00073200
         SPACE 2                                                        00073300
DELFRDS  L     9,=V(OTYPE)                                              00073400
         MVI   3(9),X'FF'        SET TYPE = DELETE                      00073500
         MVC   4(12,9),0(2)      MOVE IN FIRST POINT                    00073600
         CLC   0(4,2),0(3)       IF PAGE NAMES DIFFERENT, THEN          00073700
         BNE   OVERLAP           CALL MODIFY FOR EACH PAGE              00073800
         MVC   16(12,9),0(3)     MOVE IN SECOND POINT                   00073900
GLT      MCALL MODIFY                                                   00074000
         LA    0,8                AMOUNT DS MOVED (IF AT ALL)           00074100
         BAL   1,STCKCHK          UPDAT STACK ENTRIES IF DS MOVED       00074200
         BR    10                                                       00074300
         EJECT                                                          00074400
DISABLE1 MVI   GACB+15,X'0B'     LP, END, OR CANCEL                     00074500
         MVC   GACB+8(4),TRAVMASK  TRAVEL KEYS AND PANIC                00074600
         B     BIGWAIT                                                  00074700
DISABLE2 MVI   GACB+15,X'0A'     LP AND CANCEL                          00074800
         AIF   ('&GJP' EQ 'NO').NOKEYS                                  00074900
         MVC   GACB+8(4),HUGE  ALLOW ONLY THE PANIC KEY                 00075000
         AGO   .WAIT                                                    00075100
.NOKEYS  SR    0,0                ALLOW NO FUNCTION KEYS                00075200
         ST    0,GACB+8                                                 00075300
.WAIT    B     BIGWAIT            WAIT FIR THE NEXT INTERRUPT           00075400
DISABLE3 MVI   GACB+15,X'09'   E OR C ONLY                              00075500
         B     DISABLE2+4                                               00075600
DISABLE5 MVI   GACB+15,X'0A'      LP AND CANCEL ONLY FOR NOW            00075700
         B     DISABLE1+4         ALLOW HIM TO TRAVEL NOEW              00075800
         SPACE 2                                                        00075900
TRAVMASK DC    X'8820020F'     FUNCTION KEY MASK FOR TRAVELLING         00076000
         EJECT                                                          00076100
MVRTNAM  LA    2,M1(2)                                                  00076200
         MVC   BUFFER(12),0(2)                                          00076300
         BR    3                                                        00076400
MVINST   LA    2,N1(2)                                                  00076500
         MVC   BUFFER+12(60),0(2)                                       00076600
         LA    5,BUFFERA                                                00076700
         LA    6,100                                                    00076800
         LA    7,MESSADD                                                00076900
         BAL   9,WRITE                                                  00077000
         BAL   9,RESTART                                                00077100
         BR    3                                                        00077200
MESSADD  DC    H'0'                                                     00077300
BUFFERA  GEVM                                                           00077400
         GDV   0,240,B                                                  00077500
         GECF  B                                                        00077600
BUFFER   DC  CL12' ',CL62'HIT FUNCTION KEY OF DESIRED ACTION',148C' '   00077700
G1       GTRU  2990                                                     00077800
         EJECT                                                          00077900
OVERLAP  MVC   16(12,9),4(9)     SET IDENTICAL POINTS                   00078000
         L     5,4(9)                  R5 HAS PAGE NAME (1ST)           00078100
         ST    5,BLOCK+4               STORE IN MAINTAIN'S PARAM LIST   00078200
         SR    4,4                 ZERO INCREMENT                       00078300
         ST    4,BLOCK+8           ZERO INCR TO BOTH PAGES              00078400
         LA    1,BLOCK             R1 POINTS TO PARAM LIST              00078500
         MCALL GETITEM                                                  00078600
         L     7,12(1)             R7 POINTS TO TOP OF ORDERS PAGE      00078700
         L     6,4(7)            R6 HAS LRN OF ORDERS                   00078800
         BCTR    7,0                                                    00078900
         SR    4,4                                                      00079000
         IC    4,0(7,6)          CODE OF LAST ORDER                     00079100
         C     4,=F'1'           IF NOT STRING, DISP WITHIN = 0         00079200
         BE    *+12                                                     00079300
         C     4,=F'8'                                                  00079400
         BNE   ZAPLEN                                                   00079500
         S     7,=F'5'             TO GET LENTH OF STRING               00079600
         LH    5,0(7,6)                R5 HAS LEN OF STRING             00079700
STORLEN  ST    5,24(9)                 SET DISP WITHIN ORDER IN 2ND     00079800
         SLL   4,2               R4 HAS TYPE OF LAST ORDER              00079900
         S     6,ORDERLN(4)                                             00080000
         S     6,=F'12'          FOR PAGE HEADER                        00080100
         ST    6,20(9)           STORE IN SECOND POINT                  00080200
         MCALL MODIFY                                                   00080300
         LA    2,4(9)             R2 POINTS TO PAIR OF POINTS           00080400
         BAL   1,STCKCHK          UPDAT STACK ENTRIES IF DS MOVED       00080500
         MVC   4(12,9),0(3)      SECOND PAGE NAME                       00080600
         MVC   16(12,9),0(3)     SECOND POINT SANE AS FIRST             00080700
         L     3,4(9)              R3 HAS PAGE NAME OF SECOND DELETE    00080800
         ST    3,BLOCK+4           STORE IN PARAM LIST                  00080900
         LA    1,BLOCK            PARAMTTER LIST FOR GETITEM            00081000
         MCALL GETITEM             R1 ALREADY POINTS TO PARAM LIST      00081100
         L     7,12(1)             R7 POINTS TO TOP OF ORDERS PAGE      00081200
         CLI   12(7),X'01'       IF FIRST ORDER STRING, GET ITS LENTH   00081300
         BNE   NOLEN                                                    00081400
         LA    3,1                 DELETE FROM FIRST LETTER             00081500
STORSECL ST    3,12(9)           STORE LEN OF FIRST 'HIT' IN 1ST POINT  00081600
         SR    14,14                   DISP TO 'FIRST' HIT              00081700
         ST    14,8(9)            DISP TO FIRST ORDER = ZERO            00081800
         B     GLT                CALL MODIFY, STCCHK AND RET           00081900
         SPACE 1                                                        00082000
ZAPLEN   SR    5,5                     ZERO DISP WITHIN                 00082100
         B     STORLEN                                                  00082200
NOLEN    SR    3,3                                                      00082300
         B     STORSECL                                                 00082400
         EJECT                                                          00082500
INSERT   MVI   LNKORBR,1   FOR INSERT, TYPE = 1                         00082600
         LA    2,12                                                     00082700
          MVI   NOP11+1,X'F0'                                           00082800
         L     3,=V(FLAGWORD)     ADD OF NO SCROLLP FLAG                00082900
         TM    0(3),X'40'         CHECK SCROLLP BIT                     00083000
         BNO   NOPA               IF OFF, THEN CAN SCROLL(NO CURSUR)    00083100
         L     1,=V(ENDTEXT)                                            00083200
         LH    3,0(1)      ADD TO B A OF END OF TEXT PROPER             00083300
         STH   3,CURSADD                                                00083400
         BAL   9,INSERTC                                                00083500
         L     1,=V(OPOINT2)                                            00083600
         MVC   POINT(12),0(1)                                           00083700
         MVI    NOP11+1,X'00'                                           00083800
NOPA     BAL   3,MVRTNAM                                                00083900
         LA    2,60                                                     00084000
         BAL   3,MVINST                                                 00084100
         MVI   GACB+15,X'0B'   LP, END, OR CANCEL                       00084200
         BAL   10,DISABLE2+4      ZAP FUNCTION KEYS                     00084300
*********************************************************************** 00084400
         CLI   COMAREA+3,X'01'                                          00084500
         BE    FIND               IF END KEY, DO SUPER INSERT           00084600
NOP11    B     AAAB                                                     00084700
          MVI   NOP11+1,X'F0'                                           00084800
         MVI   IOTYPE,X'62'       WANT TO RMVE CURSUR                   00084900
         BAL   9,INSERTC+4        WHICH IS ALMOST LIKW INSERTING CURSUR 00085000
AAAB     LA    2,COMAREA+6         WHERE TO PATCH                       00085100
         BAL   10,ADDPTCH                                               00085200
         LA    3,X'F0'   PUT LETTERS AROUND TEXT                        00085300
         LA    2,PATCH+2       WWHERE TO WRITER ZEROS                   00085400
         BAL   10,TEXTDOWN                                              00085500
         BAL   9,INSERTC                                                00085600
         LA    2,120                                                    00085700
         BAL   3,MVINST                                                 00085800
         BAL   10,DISABLE3        END OR CANCEL ONLY                    00085900
CONTIG   LA    6,256              LENTH OF PATCHED INSERT               00086000
         BAL   10,GETMAIN    GET CORE AREA                              00086100
         BAL   9,READCURS                                               00086200
         LR    4,5                                                      00086300
         LR    5,6                                                      00086400
         IC    6,LNKORBR                                                00086500
CALLADD  LA    2,POINT            WHERE TO MAKE INSERTION               00086600
         LA    3,LABEL                                                  00086700
         BAL   10,ADDTODS                                               00086800
         B     BEGCALL                                                  00086900
GOREAD   L     5,COREADD     ADDRESS OF STRING IN CORE                  00087000
         BAL   9,READCURS               READ                            00087100
         LA    2,POINT                  WHERE INSERT                    00087200
         LA    3,LABEL     LABEL                                        00087300
         LR    4,5                      WHERE STRINGIS                  00087400
         LR    5,6                      LENGTH OF STRING                00087500
         IC    6,LNKORBR     GET TYPE                                   00087600
         BAL   10,ADDTODS               ADD TO DS                       00087700
LABNOP   B     BEGCALL            ****** SWITCH *************           00087800
*        SWITCH CLEARED BY MAKELINK TO INSERT LABEL ABOVE LINK          00087900
*                                 FROM POINT                            00088000
         MVI   *-3,X'F0'          CHANGE BACK TO BRANCH                 00088100
         MVC   POINT(12),STRTPNT  RESTORE POINTER TO WHERE LABEL GOES   00088200
         BAL   9,SYSLAB           GENERATE A SYSTEM LABEL               00088300
         BAL   9,ENTLAB           ENTER THAT LABEL IN THE LABEL TABLE   00088400
         B     BEGCALL                                                  00088500
CURSADD  DC    H'0'                                                     00088600
FIND     L     6,=F'6400'         APPROX END OF MAIN DISPLAY IN BUFFER  00088700
         AH    6,GDCB+16        RELOCATE IN BUFFER                      00088800
         SH    6,CURSADD      GWT LRNTH OF BUFFER TO SEARCH             00088900
         MVI   IOTYPE,X'92'       DO A FIND CURSUR                      00089000
         MVI   IOTYPE+1,X'18'                                           00089100
         LA    7,CURSADD          WHERE TO START LOOKING                00089200
         LA    5,ABSAVE           WHERE TO STORE SENSE INFO             00089300
         BAL   9,WRITE+4          GO GET THE CURSUR                     00089400
         MVI   IOTYPE+1,0         CLEAR THAT BYTE SINCE NO ONE ELSE USE 00089500
         LH    6,ABSAVE+2          BUFFERADRD WHERE I/O TERMINATED      00089600
         SH    6,CURSADD           MINUS BUFFER ADDR WHERE I/O STARTED  00089700
         LA    6,1(6)              PLUS 1 = LENTH OF STRING TYPED IN BY 00089800
         B     CONTIG+4           GETMAIN AND READ                      00089900
         EJECT                                                          00090000
         AIF   ('&SYSSIZE' EQ 'MINI').MINI5   LEAVE OUT INSTANCE ?      00090100
INSTANCE LA    2,24                                                     00090200
         LA    4,180                    DISP TO PROMPT                  00090300
         BAL   10,TWOHITS               WAIT FOR TWO LP HITS            00090400
         L     5,ININDEX                GET WHERE TO READ INSTANCE      00090500
         MVI   0(5),C' '                                                00090600
         LA    5,1(5)                                                   00090700
         LH    6,THREE   GET FIRST B A                                  00090800
         SH    6,TWO   SUBTRACT FIRST FOR      LENTH                    00090900
         LA    6,2(6)   GET LENTH + 2                                   00091000
         LA    7,TWO     WHERE TO READ FROM                             00091100
         BAL   9,READ                   READ IN INSTANCE                00091200
         L     1,INSTIND              GET ADDRESS OF NEXT ENTRY IN TAB  00091300
         BCTR  5,0   GET STORAGE ADDRESS OF INSTANCE                    00091400
         STH   6,6(1)                   STORE LENGTH IN TABLE           00091500
         ST    5,8(1)          STORE CORE ADDRESS OF INSTANCE           00091600
         AR    5,6                                                      00091700
         ST    5,ININDEX                                                00091800
         LA    8,INTNAME    TO RETURN FROM INTERRUPT                    00091900
         LA    2,240                                                    00092000
.MINI5   ANOP                                                           00092100
FORNAME  LA    3,0   INSERT NO CHARS AROUND PATCH                       00092200
         ST    2,INSTRADD                                               00092300
         MVC   PTCHADD(2),MESSADD                                       00092400
         LA    2,TAGADD           WHERE TO WRITE OUT                    00092500
         BAL   10,TEXTASIS                                              00092600
         BAL   9,INSERTC       INSERT CURSUR TO GET INST NAME           00092700
         L     2,INSTRADD                                               00092800
         BAL   3,MVINST                                                 00092900
         LR    10,8    GET RETURN ADDRESS                               00093000
         B     DISABLE3                                                 00093100
         AIF   ('&SYSSIZE' EQ 'MINI').MINI8                             00093200
INTNAME  L     5,INSTIND     READ NAME DIRECTLY INTO TABLE              00093300
         LA    6,6                      READ SIX CHARS                  00093400
         LA    7,CURSADD                                                00093500
         BAL   9,READ                   READ                            00093600
         LA    5,12(5)                  UPDATE ADD ON INT TABLE         00093700
         ST    5,INSTIND                STORE NEW ADDRESS               00093800
         B     BEGCALL                                                  00093900
INSTIND  DC    A(INTABLE)                                               00094000
INTABLE  DC    30F'0'                                                   00094100
ININDEX  DC    A(STOR)                                                  00094200
         EJECT                                                          00094300
INSINST  LA    2,36                                                     00094400
         BAL   3,MVRTNAM                                                00094500
         LA    2,240                                                    00094600
RETYPE   BAL   8,FORNAME          PUT OUT CURSUR IN TAGAREA             00094700
         LA    5,INSTNAM                WHERE TO READ                   00094800
         LA    6,6                      HOW MANY                        00094900
         LA    7,CURSADD                                                00095000
         BAL   9,READ                   READ INST NAME                  00095100
         LA    8,INTABLE     ADDR OF TOP OF INST FILE                   00095200
LOOPS    CLC   0(6,8),INSTNAM                                           00095300
         BE    FOUND                    IF FOUND ENTRY,GO TO FOUND      00095400
         LA    8,12(8)                  INCREMENT                       00095500
         C     8,INSTIND                END OF TABLE?                   00095600
         BL    LOOPS                                                    00095700
         LA    2,1380                                                   00095800
         BAL   3,MVINST                                                 00095900
         LA    10,RETYPE+4   WHERE TO RETURN AFTER NEXT ENDKEY          00096000
         B     BIGWAIT                                                  00096100
FOUND    LA    2,60          DISP TO PROMPYYT                           00096200
         ST    8,INSTRADD         SAVE ADDR IN TABLE OF INST ENTRY      00096300
         BAL   3,MVINST                                                 00096400
         LA    5,FOUND                 WHERE TO RETURN AFTER TRAVELLING 00096500
         BAL   10,DISABLE5        LP, CANCEL, AND SCROLL                00096600
FL1      MVC   INSTADD(2),COMAREA+6    SAVE BUFFER ADDRESS              00096700
         LA    2,INSTADD     *                                          00096800
         BAL   10,ADDPTCH      PUT IN PATCH                             00096900
         L     8,INSTRADD         GET POINTER TO OUR ENTRY IN TABLE     00097000
         L     4,8(8)                   ADD OF INST                     00097100
         LH    3,6(8)                   LENGTH                          00097200
         LA    2,PATCH+2       WRITE OUT TEXT AT 7000                   00097300
         MVI   NOP20+1,X'00'                                            00097400
         MVI   NOP21+1,X'00'                                            00097500
         BAL   10,ADDTEXT               CONSTRUCT TEXT                  00097600
         LA    2,60               DISP TO PROMPT                        00097700
         BAL   3,MVINST                                                 00097800
         LA    5,FOUND         WHEREE TO RETURM AFTER TRAVELLING        00097900
         BAL   10,DISABLE1        LP, END, CANCEL, ANDSCROLLING         00098000
LIKES    CLI   COMAREA+3,1     ENDKEY?                                  00098100
         BE    ACCEPT          IF SO, GO TO ACCEPT                      00098200
         LA    5,PTCHCHAR      TO WRITE OVER PATCH                      00098300
         LA    6,6             6 CHARS                                  00098400
         LA    7,INSTADD       WHERE TO WRITE                           00098500
         BAL   9,WRITE         WIP OUT PATCH                            00098600
         B     FL1     CREATE NEW PATCH                                 00098700
ACCEPT   LA    2,POINT                  WHERE TO INSERT                 00098800
         SR    3,3                TO PREVENT ADDR BOMB                  00098900
         L     8,INSTRADD         GET POINTER TO OUR TABLE ENTRY        00099000
         L     4,8(8)                                                   00099100
         LH    5,6(8)    LENTH                                          00099200
         LA    6,1                      TYPE                            00099300
         BAL   10,ADDTODS               ADD TO DS                       00099400
         B     BEGCALL                                                  00099500
INSTADD  DC    H'0'                                                     00099600
         EJECT                                                          00099700
.MINI8   ANOP                                                           00099800
INSTRADD DC    F'0'                                                     00099900
REARNG   MVI   NP3+1,X'00'   FALL THROUGH                               00100000
         MVI   ACC+1,X'00'   FALL THROUGH                               00100100
         MVI   NOP10+1,X'00'                                            00100200
         NI    FLAG,X'FD'         CLEAR NO BUFFER DELETE FLAG           00100300
         LA    2,48                                                     00100400
         LA    4,420         DISP TO PROMPT                             00100500
         BAL   10,TWOHITS    WAIT FOR TWO LP HOITS                      00100600
         LH    6,THREE                  GET LENGTH OF TEXT              00100700
         SH    6,TWO                                                    00100800
         LA    6,1(6)           ADD 1 FOR LAST CHAR BETWWEN             00100900
         CH    6,=H'255'               ONLY READ IN ENOUGH TO PATCH     00101000
         BNH   *+8                      BUFFER                          00101100
         LA    6,255                    MAX TO READ IN                  00101200
         STH   6,LENGTH2       SAVE LENTH OF TEXT                       00101300
         BAL   10,GETMAIN      GET CORE TO READ STRING INTO             00101400
         LA    7,TWO                    WHERE IN BUFFER                 00101500
         BAL   9,READ                   READ                            00101600
         LA    2,60                                                     00101700
NOP10    NOP   *+8                PICK UP RIGHT ROUTINE NAME            00101800
         LA    2,48                                                     00101900
         BAL   3,MVRTNAM                                                00102000
         LA    2,60               ASK FOR THIRD LP HIT                  00102100
         BAL   3,MVINST                                                 00102200
         LA    5,NOP10-4                WHERE TO RETIRN IF TRAVEL       00102300
         BAL   10,DISABLE5        LP, CAMCEL, AND TRAVEL                00102400
         MVC   ONE(2),COMAREA+6                                         00102500
         MVC   ENTPNT(12),POINT     SAVE HIT POINT                      00102600
NP3      NOP   NEXTPTCH    BRANCH IF COPY                               00102700
         TM    FLAG,X'02'         SHOULD BLANK OUT BUFFER ?             00102800
         BO    NEXTPTCH    NO, GO TO NEXTPTCH                           00102900
         LA    5,BLANKS            WHAT TO WRITE OUT                    00103000
         BAL   8,DELEBUF           ZAP OUT THE BLANKS                   00103100
NEXTPTCH LA    2,ONE                                                    00103200
         BAL   10,ADDPTCH                                               00103300
         LH    3,LENGTH2       GET LENTH OF TEXT                        00103400
         L     4,COREADD     ADDRESS OF STRING IN CORE                  00103500
         LA    2,PATCH+2       WHERE TO WRITE TEXT                      00103600
         MVI   NOP20+1,X'00'                                            00103700
         MVI   NOP21+1,X'00'                                            00103800
         BAL   10,ADDTEXT               CONSTRUCT TEXT                  00103900
         LA    2,360                                                    00104000
         BAL   3,MVINST                                                 00104100
         LA    5,NOP10-4          WHERE TO RETURN IF HE TRAVELS         00104200
         BAL   10,DISABLE1        LP, END, CANCEL, AND TRAVEL           00104300
          MVI   FREENOP+1,X'00'         CLEAR THE FREEMAIN SWITCH       00104400
         CLI   COMAREA+3,3                                              00104500
         BE    ACE                                                      00104600
         LA     1,STRTPNT               WHERE TO START SCRUNCHING ORDER 00104700
         MCALL RSCRUNCH                                                 00104800
ACC      NOP   OKK     BRANCH IF COPY                                   00104900
         LA    2,STRTPNT    WHERE TO BEGIN DELETE                       00105000
         LA    3,ENDPNT                 END DELETE                      00105100
         BAL   10,DELFRDS               DELETE FROM DS                  00105200
         CLC   ENTPNT(6),STRTPNT    SAME ID?                            00105300
         BNE   OKK   NO, GO TO OKK                                      00105400
         CLC   ENTPNT+6(6),STRTPNT+6     IS INSERT PNT ABOVE DELETE PNT 00105500
         BL    OKK      IF SO, GO TO OKK                                00105600
         CLC   ENTPNT+6(2),STRTPNT+6   ARE IN SAME ORDER?               00105700
         BNE   CHKDELND           SEE IF INSERT IN SAME ORD AS LAST DEL 00105800
         LH    15,ENTPNT+10  GET DISP WITHIN ORDER OF ENTRY POINY       00105900
         SH    15,ENDPNT+10   SUBTRACT DISP WITHIN TO END OF DELETE     00106000
         STH   15,ENTPNT+10  STORE DISP IN NEW ORDER                    00106100
CHK2     L     1,=V(MOVE)     FGET ADDRESS OF FLAG FOR DS MOVE          00106200
         CLI   0(1),X'00'    WAS DS MOVED?                              00106300
         BE    OKK   NO, GO TO OKK                                      00106400
         LH    1,ENTPNT+6     GET DISP IN ORDERS OF ENTPNT              00106500
         LA    1,8(1)             POINT TO WHERE ORDER MOVED DOWN TO    00106600
         STH   1,ENTPNT+6     STORE NEW DISP IN ORDERS                  00106700
OKK      LA    6,7                     TYPE OF INSERT = REARRNG         00106800
         B     ADDSTRG                  GO PUT INTO DATA STRUCYURE      00106900
CHKDELND CLC   ENTPNT+6(2),ENDPNT+6    INSERT POINT VS END OF DELETE    00107000
         BNE   CHK2               BRANCHI  IF NOT                       00107100
         LH    15,ENTPNT+10                                             00107200
         SH    15,ENDPNT+10                                             00107300
         B     CHK2-4                                                   00107400
         SPACE 3                                                        00107500
ACE      LA    5,PTCHCHAR         WHERE TO ZONK OUT OLD PATCH           00107600
         LA    6,6                                                      00107700
         LA    7,ONE        GET BUFFER ADDRESS OF PATCH                 00107800
         BAL   9,WRITE                                                  00107900
         MVI   NP3+1,X'F0'        DON'T WRITE BLANKS AGAIN              00108000
         B     NP3-12             SAVE INFO ABOUT THIS HIT AND PATCH    00108100
TWO      DC    H'0'                                                     00108200
THREE    DC    H'0'                                                     00108300
ONE      DC    H'0'                                                     00108400
STRTPNT  DC    3F'0'                                                    00108500
ENDPNT   DC    3F'0'                                                    00108600
ENTPNT   DC    3F'0'                                                    00108700
LENGTH2  DC    H'0'                                                     00108800
         EJECT                                                          00108900
COPY     MVI   NP3+1,X'F0'    BRANCH                                    00109000
         MVI   ACC+1,X'F0'    BRANCH                                    00109100
          MVI  NOP10+1,X'F0'                                            00109200
         LA    2,60                                                     00109300
         B     REARNG+20                                                00109400
         SPACE 8                                                        00109500
DELETE   LA    2,72                                                     00109600
         LA    4,540         DISP TO PROMPT                             00109700
         BAL   10,TWOHITS    WAIT FOR TWO LP HITS                       00109800
         LA    5,BLANKS     WHAT TO WRITE ON TOP WITH                   00109900
         BAL   8,DELEBUF      ZAP YHE DELETED CHARS                     00110000
         LA    2,600                                                    00110100
         BAL   3,MVINST                                                 00110200
         BAL   10,DISABLE3                                              00110300
         LA    2,STRTPNT    WHERE TO BEGIN DELETE                       00110400
         LA    3,ENDPNT    WHERE TO END DELETE                          00110500
         BAL   10,DELFRDS               DELETE FROM DS                  00110600
         B     BEGCALL                                                  00110700
         SPACE 3                                                        00110800
DELEBUF  LH    2,THREE    ENDING BUFFER ADDRESS                         00110900
         SH    2,TWO                                                    00111000
         LA    2,1(2)                                                   00111100
         LA    6,260                                                    00111200
         LA    7,TWO                                                    00111300
BLANKIT  C     2,=F'260'                                                00111400
         BH    *+6                BRANCH IF STILL WANT TO WRITE >260    00111500
         LR    6,2                                                      00111600
         BAL   9,WRITE                                                  00111700
         LH    3,TWO                                                    00111800
         AR    3,6                                                      00111900
         STH   3,TWO                                                    00112000
         S     2,=F'260'                                                00112100
         BNHR  8                  RETURN IF HAVE BLANKED WHOLE AREA     00112200
NOLOOP   B     BLANKIT                                                  00112300
         EJECT                                                          00112400
*        DELETES THE SINGLE CHARACTER LP'ED                             00112500
*        REQUIRES NO END KEY                                            00112600
SINGDEL  LA    2,168              DISP TO ROUTINE NAME                  00112700
         BAL   3,MVRTNAM          PUT OUT ROUTINE NAME                  00112800
         LA    2,960              DISP TO PROMPT                        00112900
         BAL   3,MVINST           PUT OUT PROMPT                        00113000
BACKIN   LA    5,SINGDEL          WHERE TO RETURN AFTER SCROLL          00113100
         BAL   10,DISABLE5        LP, CANCEL, AND TRAVEL                00113200
         LA    2,POINT            WHERE TO BEGIN DELETE                 00113300
         LR    3,2                     WHERE TO END DELETE(SAME P,LACE) 00113400
         BAL   10,DELFRDS         DELETE CHAR FROM DS                   00113500
         LA    8,BACKIN                WHERE TO COME ON FUDGE RETUNR    00113600
         B     SETUPRET           FUDGE THINGS TO RETURN INTO ROUTINE   00113700
         EJECT                                                          00113800
         AIF   ('&SYSSIZE' EQ 'MINI').MINI6   LEAVE OUT BORROW ?        00113900
*        STRTPNT = FIRST OLD HIT                                        00114000
*        ENDPNT = SECOND OLD HIT                                        00114100
*        *ONE=TYPE OF FIRST OLD HIT                                     00114200
*        THREE = FIRST OLD BA (WHERE TO ERAD FROM)                      00114300
*        LENGTH2 = LENTH OF STRING READ FROM GUFFER                     00114400
BORROW   LA    2,180              DISP TO ROUTINE NAME                  00114500
         BAL   3,MVRTNAM                                                00114600
         LA    2,1080             DISP TO PROMPT (TXT ENDS OR CHNG OPT) 00114700
         BAL   3,MVINST                                                 00114800
         OI    FLAG,X'40'         SO TEXTSCAN WON'T BE CALLED           00114900
WAITTXT  BAL   10,DISABLE2        LP AND CANCEL ONLY                    00115000
*********************************************************************** 00115100
         LH    1,COMAREA+10       Y-COORDINATE                          00115200
         CH    1,=H'240'          HIT IN TEXT (I.E. NOT PROMPT)         00115300
         BH    TXTHIT             IF SO, THEN DON'T CHANGE EXPLAINER    00115400
         LH    1,COMAREA+8        X-COORDINATE                          00115500
         CH    1,=H'3164'         (44+12)*56+28                         00115600
         BL    BIGWAIT            IF NOT, JUST SIT AND WAIT             00115700
         LA    2,780              DISP TO PROMPT(TYPE IN NUM)           00115800
         BAL   8,FORNAME          GIVE HIM CURSUR IN TAGAREA            00115900
*********************************************************************** 00116000
         L     5,=A(EXPSTR)       WHERE TO STOER EXLP                   00116100
         MVC   0(2,5),=C' /'      INITIAL DELIMITERS                    00116200
         LA    5,2(5)             POINT PAST DELIMITERS                 00116300
         LA    6,250              MAX LENTH OF EXPLAINER                00116400
         LA    7,TAGADD           WHERE TO READ FROM                    00116500
         BAL   9,READCURS         READ IN EXPL                          00116600
         AR    5,6                POINTER TO END OF EXPL                00116700
         MVI   0(5),C'/'                                                00116800
         MVI   1(5),C'/'                                                00116900
         LA    6,4(6)             TOTAL LEN OF EXPL = READ IN + LEN     00117000
*                                 OF DELIMITERS)                        00117100
         STH   6,EXPLEN           SAVE THIS VALUABLE FIGURE             00117200
         BAL   9,RESTART          LET HIM SEE A DISPLAY AGAIN           00117300
         B     BORROW+8         REDISPLAY ORIG PROMPT                   00117400
EXPLEN   DC    H'1'               SO WON'T BLOW UP FIRST TIME           00117500
MVEXPL   MVC   0(0,5),0(9)        MOVES EXPL FROM STORAGE INTO GETMAIN  00117600
TXTHIT   LR    1,13               ALLOW SCROLL                          00117700
         L     15,=V(TEXTSCAN)    ROUTINE TO SEE WHAT WAS LP'ED         00117800
         BALR  14,15                                                    00117900
         B     *+4(15)          CHECK RETURN CODE                       00118000
         B     BIGWAIT+4          HIT NOT IN REAL TEXT                  00118100
         B     *+12             HIT WAS IN MAIN TEXT DISPLAY            00118200
         BAL   3,WRITPRMT       GAS PEDAL SCROLL, SO WRITE PROMPT AREA  00118300
         B     BIGWAIT+4          AND WAIT FOR NEXT HIT                 00118400
         TM    FLAG,X'04'         IS THIS SECONF HIT ?                  00118500
         BO    SECBORHT           IF SO, BRANCH                         00118600
         MVC   STRTPNT(12),POINT  SAVE INITIAL POINTER                  00118700
         LH    5,COMAREA+6        SAVE BUFFER ADDRESS                   00118800
         STH   5,TWO              SAVE ADDRESS OF FIRST HIT             00118900
         NI    FLAG,X'BF'         CLEAR NO TEXTSCAN FLAG                00119000
         L     1,TYPE             FRO ORDER LEN OF FIRST HIT POINT      00119100
         STC   1,ONE                                                    00119200
         OI    FLAG,X'04'         WANT SECOND HIT NEXT                  00119300
         B     WAITTXT            ALLOW HIM TO CHANGE OPT               00119400
**********************************************************************  00119500
SECBORHT NI    FLAG,X'FB'         NO LONGER WAITING FOR SEC LP HIT      00119600
         MVC   ENDPNT(12),POINT   SAVE SECOND POINT                     00119700
         LH    6,COMAREA+6        SECOND BUFFER ADFRESS                 00119800
         STH   6,THREE            SET UP ADDRESS OF SECOND HIT FOR      00119900
*                                 'CHKORD'                              00120000
         BAL   4,CHKORD           ARRANGE HITS IN RIGHT ORDER           00120100
         LH    6,THREE            SECOND (HIGHER) BA                    00120200
         SH    6,TWO              MINUS LOWER GIVES LENTH               00120300
         LA    6,1(6)             LENTH OF GUT IN BUFFER                00120400
         STH   6,LENGTH2          SAVE                                  00120500
         LA    6,3(6)             FOR INITIAL DELIMITERS ( +/)          00120600
         AH    6,EXPLEN           + LENTH OF EXPL                       00120700
         BAL   10,GETMAIN         GET SOME SPACE                        00120800
         LH    6,LENGTH2          GET LENTH TO READ FROM BUFFER         00120900
         LA    7,TWO              WHERE TO READ FROM                    00121000
         MVC   0(3,5),=C' +/'     MOVE IN INITIAL DELIMITERS            00121100
         LA    5,3(5)             POINT PAST DELIMITERS                 00121200
         BAL   9,READ             READ IN GUY IN BUFFER                 00121300
         AR    5,6                   POINTS LUST PAST GUY FROM BUFFER   00121400
         LH    2,EXPLEN              LENTH OF EXPL + /'S                00121500
         BCTR  2,0                                                      00121600
         L     9,=A(EXPSTR)                                             00121700
         EX    2,MVEXPL                                                 00121800
RESETUP  LA    2,60               DISP TO PROMPT MESSAGE                00121900
         BAL   3,MVINST                                                 00122000
         LA    5,RESETUP             IN CASE OF SCROLLING               00122100
         BAL   10,DISABLE5        LP, CANCEL, AND TRAVEL                00122200
**********************************************************************  00122300
*        TWO = WHERE PATCH (GTRU 7000) MADE IN BUFFER                   00122400
*        POINT = WHERE TO INSERT THE BORROW                             00122500
PATCHBUF LA    2,COMAREA+6           WHERE TO CONSTRUCT BRANCH          00122600
         BAL   10,ADDPTCH                                               00122700
         LA    2,PATCH+2             WHERE TO WRITE OUT                 00122800
         LH    3,GETCORE+6        GET ENTIRE LENTH TO PATCH IN          00122900
         L     4,COREADD             WHERE STRING IS IN CORE            00123000
         MVI   NOP20+1,X'00'                                            00123100
         MVI   NOP21+1,X'00'                                            00123200
         BAL   10,ADDTEXT                                               00123300
         LA    2,360                                                    00123400
         BAL   3,MVINST                                                 00123500
         LA    5,RESETUP             WHERE TO GO ON SCORLLING           00123600
         LH    1,COMAREA+6           SAVE WHERE PATCH IS MADE           00123700
         STH   1,TWO                                                    00123800
         BAL   10,DISABLE1        END OR CANCEL OR LP OR TRAVEL         00123900
**********************************************************************  00124000
         MVI   FREENOP+1,X'00'                                          00124100
         CLI   COMAREA+3,3                                              00124200
         BE    CLOBPTCH              IF LP, PATCH AT A DIFFERENT PLACE  00124300
*        DS CHANGES                                                     00124400
*        STRTPNT = WHERE OLD GUY STARTS                                 00124500
*        POINT = WHERE NEW GUY IS                                       00124600
         LA    3,LABEL                                                  00124700
         LA    6,1                                                      00124800
         CLC   POINT(4),STRTPNT      SAME PAGE FOROL D AMD NEW          00124900
         BE    TROUBLE                                                  00125000
NEWBFOLD MVI   NOP30+1,X'00'                                            00125100
         MVI   NOP31+1,X'00'                                            00125200
*        INSERT AT NEW PLACE                                            00125300
NEWINS   LA    2,POINT                                                  00125400
         L     4,COREADD                                                00125500
         LH    5,GETCORE+6        GET LENTH OF ENTIRE INSERT            00125600
         BAL   10,ADDTODS                                               00125700
NOP30    NOP   BEGCALL                                                  00125800
         LA    2,ENDPNT                                                 00125900
         L     4,=A(EXPSTR)       ADDRESS OF INSERT                     00126000
         LH    5,EXPLEN                                                 00126100
         BAL   10,ADDTODS                                               00126200
         LH    1,STRTPNT+10                                             00126300
         LTR   1,1                                                      00126400
         BE    BACKORD                                                  00126500
         BCTR  1,0                                                      00126600
         STH   1,STRTPNT+10                                             00126700
NOBACK   LA    2,STRTPNT                                                00126800
         LA    4,=C'-/'                                                 00126900
         LA    5,2                                                      00127000
         BAL   10,ADDTODS                                               00127100
NOP31    NOP   NEWINS                                                   00127200
         B     BEGCALL                                                  00127300
BACKORD  LH    1,STRTPNT+6                                              00127400
         LTR   1,1                                                      00127500
         BE    NOBACK                                                   00127600
         IC    2,ONE                                                    00127700
         N     2,=XL4'3F'                                               00127800
         SLL   2,2                                                      00127900
         S     1,ORDERLN(2)                                             00128000
         STH   1,STRTPNT+6                                              00128100
         B     NOBACK                                                   00128200
TROUBLE  CLC   POINT+6(6),STRTPNT+6                                     00128300
*                                                                       00128400
         BNL   NEWBFOLD           IF INSERT POINT BELOW(ON SCREEN)      00128500
*                                 THE OLD POINT                         00128600
         MVI   NOP30+1,X'F0'                                            00128700
         MVI   NOP31+1,X'F0'                                            00128800
         B     NOP30+4                                                  00128900
CLOBPTCH LA    5,PTCHCHAR            WHAT TO WRITE                      00129000
         LA    6,6                                                      00129100
         LA    7,TWO                                                    00129200
         BAL   9,WRITE                                                  00129300
         B     PATCHBUF                                                 00129400
         EJECT                                                          00129500
.MINI6   ANOP                                                           00129600
*                                                                       00129700
**********   GRAPHIC DECB                                               00129800
******                                                                  00129900
GDECB    DC    F'0'               ECB                                   00130000
IOTYPE   DC    A(0)               CODE FOR IOTYPE                       00130100
         DC    A(GDCB)            ADDR OF A GRAPHICS DCB                00130200
         DC    A(0)               AREA ADDR                             00130300
         DC    A(0)               CSW REMNANTS ON READ TO CURSUR        00130400
         DC    A(0)               LENTH                                 00130500
         DC    A(START)           BUFFER STARG ADDR                     00130600
         DC    A(0)               CURSUR ADDR                           00130700
*********                                                               00130800
********       GRAPHIC I/O ROUTINES                                     00130900
*********                                                               00131000
WRITE    MVI   IOTYPE,X'A0'       SET I/O CODE TO DO A WRITE            00131100
         MVI   TRNOP+1,X'F9'      DON'T WANR TO DO A TRANSLATE          00131200
         ST    5,GDECB+12         PUT AREA ADDRESS IN DECB              00131300
         ST    6,GDECB+20         PUT LENTH IN DECB                     00131400
STRBFAD  ST    7,GDECB+28         PUT BUFFER ADDR IN DECB               00131500
         MVI   GDECB,0            CLEAR TOP BYTE IN ECB                 00131600
         LA    1,GDECB            R1 => PARAM LIST                      00131700
         L     15,GDCB+48         PICK UP GIOCR ADDR FROM DCB           00131800
         BALR  14,15              LINK TO I/O ROUTINE                   00131900
         LA    0,1                WAIT ON 1 ECB                         00132000
         SVC   1                  WAIT FOR I/O TO FINISH                00132100
TRNOP    NOPR  9                  WANT A TRANSLATE OR NOT ?             00132200
         SPACE 2                                                        00132300
CSWCHK   B     LOOOP-4            WANT TO RESET LENTH FROM RETURN COUNT 00132400
         MVI   *-3,X'F0'          CHANGE BACK TO A BRANCH               00132500
         LH    1,GDECB+18         PICK UP RETURN COUNT                  00132600
         SR    6,1           LENTH TO READ MINUS LENTH LEFT             00132700
         BCTR  6,0                                                      00132800
         LTR   6,6           IS LENTH ZERO?                             00132900
         BH    LOOOP-4    IF LENTH > 0                                  00133000
         LA    6,1         OTHRWISE, PASS A LENTH OF 1                  00133100
         LR    15,5            ADDRESS                                  00133200
         LR    1,6             LENTH OF STRING                          00133300
LOOOP    CH    1,=H'256'       IS STRING LONGER THAN 256 CHARS          00133400
         BNH   OVR             IF NOT, GO TO OVR                        00133500
         TR    0(256,15),TRANSTAB   GET RID OF ZEROS AND 15'S           00133600
         LA    15,256(15)      UPDATE STRING ADDRESS                    00133700
         SH    1,=H'256'       DECREMENT STRING LENTH                   00133800
         B     LOOOP           SHORT ENOUGH YET?                        00133900
OVR      BCTR  1,0             FOR THE EX                               00134000
         EX    1,TRANS         TRANSLATE REST OF STRING                 00134100
         BR    9                                                        00134200
TRANS    TR    0(0,15),TRANSTAB                                         00134300
         EJECT                                                          00134400
READ     MVI   IOTYPE,X'80'            SET CODE IN DECB TO READ         00134500
         MVI   TRNOP+1,0          WANT TO MAKE REAL CHARS OUT OF STUFF  00134600
         B     WRITE+8            GO DO THE I/O                         00134700
READCURS MVI   IOTYPE,X'88'       SET CODE TO DO A READ CURS TYPE       00134800
         MVI   CSWCHK+1,0         WANT TO LOOK AT RETURN COUNT AFTER I/ 00134900
         LA    7,CURSADD     WHERE IN BUFFER TO START READING FROM      00135000
         B     READ+4             ALSO WANT A TRANSLATE                 00135100
INSERTC  MVI   IOTYPE,X'5A'       SET I/O CODE TO DO AN INSERTC         00135200
         LA    7,CURSADD          WHERE TO PUT THE CURSUR               00135300
         SR    15,15              GET A ZERO TO ZAP LENTH               00135400
         ST    15,GDECB+20        IN THE DECB SO IGG019OA WILL BE HAPPY 00135500
         MVI   TRNOP+1,X'F9'      DON'T WANT A TRANSLATE                00135600
         B     STRBFAD            SET UP THE DECB AND BEGIN I/O         00135700
RESTART  MVI   IOTYPE,X'6C'       SET CODE TO DO A START BUFFER         00135800
         B     INSERTC+8          SET FLAG AND DO YHE I/O               00135900
         EJECT                                                          00136000
TRANSTAB EQU   *                                                        00136100
         DC    77C' '             JUST PLAIN JUNK                       00136200
         ORG   TRANSTAB+C'¢'    CENT SIGN                               00136300
         DC    7AL1(*-TRANSTAB)                                         00136400
         DC    10C' '                                                   00136500
         ORG   TRANSTAB+C'!'    EXCLAMATION POINT                       00136600
         DC    8AL1(*-TRANSTAB)                                         00136700
         DC    10C' '                                                   00136800
         ORG   TRANSTAB+C','                                            00136900
         DC    5AL1(*-TRANSTAB)                                         00137000
         DC    11C' '                                                   00137100
         ORG   TRANSTAB+C':'    COLON                                   00137200
         DC    6AL1(*-TRANSTAB)                                         00137300
*        AM AT X'80'                                                    00137400
         DC    C' '                                                     00137500
         DC    9AL1(*-TRANSTAB)                                         00137600
         DC    7C' '                                                    00137700
         DC    9AL1(*-TRANSTAB)                                         00137800
         DC    8C' '                                                    00137900
         DC    8AL1(*-TRANSTAB)                                         00138000
         DC    23C' '                                                   00138100
         ORG   TRANSTAB+C'A'                                            00138200
         DC    9AL1(*-TRANSTAB)                                         00138300
         DC    7C' '                                                    00138400
         DC    9AL1(*-TRANSTAB)                                         00138500
         DC    8C' '                                                    00138600
         DC    8AL1(*-TRANSTAB)                                         00138700
         DC    8C' '                                                    00138800
         ORG   TRANSTAB+C'0'                                            00138900
         DC    10AL1(*-TRANSTAB)                                        00139000
         DC    6C' '                                                    00139100
START    DC    H'2990'                                                  00139200
         EJECT                                                          00139300
MAKETAG  LA    2,84                                                     00139400
         LA    4,660              DISP TO RIGHT PROMPT                  00139500
         BAL   10,PROMPTLP        SET UP PROMPT AREA AND WAIT FOR LP HI 00139600
         LA    2,720                                                    00139700
         BAL   8,FORNAME          PUT OUT CURSUR IN TAGAREA             00139800
         MVI   LNKORBR,5   5 = TYPE TAG                                 00139900
         LA    6,256           HOW MANY TO READ                         00140000
         BAL   10,GETMAIN    GET CORE TO READ IN EXPLAINER              00140100
         B     GOREAD   IN INSERT                                       00140200
         SPACE 4                                                        00140300
*        R2 => DISP TO ROUTINE NAME                                     00140400
*        R4 => DISP TO PROMPT                                           00140500
*        R10 => WHERE TO RETURN AFTER INTERRUPT                         00140600
PROMPTLP BAL   3,MVRTNAM          SET UP ROUTINE NAME                   00140700
         LR    2,4                PUT DISP TO PRONPT IN RIGHT REG       00140800
         BAL   3,MVINST           MOVE PROMPT INTO BUFFER AND WRITE     00140900
         B     DISABLE2           WAIT FOR A ,P HIT                     00141000
         SPACE 3                                                        00141100
TWOHITS  ST    10,INSTRADD   SAVE WHERE TO GO AFTER SECOND LP HIT       00141200
         BAL   10,PROMPTLP        SET UP PROMPT AREA AND WAIT           00141300
         SPACE 1                                                        00141400
         SPACE 1                                                        00141500
         MVC   STRTPNT(12),POINT  SAVE DS POINTER FOR FIRST HIT         00141600
         MVC   TWO(2),COMAREA+6   SAVE BUFFER ADDRESS OF FIRST HIT      00141700
         BAL   10,DISABLE2        WAIT FOR ANOTHER LP HIT               00141800
         MVC   ENDPNT(12),POINT   SAVE DS POINTER OF SECONF LP HIT      00141900
         MVC   THREE(2),COMAREA+6 SAVE BUFFER ADDR OF SEC LP HIT        00142000
         BAL   4,CHKORD      ARRANGE HITS IN PROPER ORDER               00142100
         L     10,INSTRADD   PICK UP ADDR OF WHERE TO GRETURN TO        00142200
         BR    10            GOV TO RIGHT PLACE                         00142300
         EJECT                                                          00142400
SUBSTITU LA    2,132              DISP TO ROUTINE NAME                  00142500
         LA    4,1200             DISP TO PROMPY                        00142600
         BAL   10,TWOHITS    WAIT FOR TWO LP HITS                       00142700
         LA    5,ZEROS+1    WHAT TO WRITE OUT                           00142800
         BAL   8,DELEBUF      ZAP THE CHARS BEING SUBBED FOR            00142900
         LA    2,THREE      WHERE TO CONSTUCT PATCH                     00143000
         BAL   10,ADDPTCH    CANSTRUCT PATCH TO LOC 7000                00143100
         LA    2,PATCH+2       WHERE TO WRITE OUT THE ZEROS             00143200
         LA    3,X'F0'      INSERT CHARS AROUND THE ZEROS               00143300
         BAL   10,TEXTDOWN       HAVE TEXT SPREAD AR INSERT POINT       00143400
         BAL   9,INSERTC   INSERT CURSUR AT SPOT COMPUTED BY ADDTEXT    00143500
         LA    2,120                                                    00143600
         BAL   3,MVINST                                                 00143700
         BAL   10,DISABLE3    END OR CANCEL KEYS ONLY                   00143800
         SPACE 2                                                        00143900
         LA    6,260                   LENTH TO GETMAIN                 00144000
         BAL   10,GETMAIN    GET CORE TO READ IN INSERT                 00144100
         BAL   9,READCURS    READ IN THE INSERT                         00144200
         STH   6,LENGTH2          SAVE LENTH OF STRING READ IN          00144300
         LA    2,STRTPNT   WHERE TO BEGIN DELETE                        00144400
         LA    3,ENDPNT   WHERE TO END DELETE                           00144500
         BAL   10,DELFRDS     REMOVE WHAT'S BEING SUBBED FOR            00144600
         MVC   ENTPNT(12),STRTPNT    INSERT POINT = WHERE DELETE BEGINS 00144700
         L     1,STRTPNT+8    DISP WITHIN ORDER                         00144800
         LTR   1,1    IF ¬ = 0, THEN HAVE TO BACK UP DATA STRUCTURE     00144900
         BE    INDS   IF = ZERO, THEN CAN KEEP INSERT IN SAME PLACE     00145000
         BCTR  1,0   OTHERWISE, SUBTRACT ONE AND GET NEW DISP           00145100
         ST    1,ENTPNT+8    WITHIN ORDER                               00145200
INDS     L     4,COREADD                R4 => STRING IN CORE            00145300
         LH    5,LENGTH2          PICK UP. LENTH OF INSERRT             00145400
         LA    6,1     TYPE OF INSERT = 1 " = CHAR                      00145500
ADDSTRG  LA    2,ENTPNT                 WHERE TO PUT STRING IN DATA STR 00145600
         SR    3,3                     SO R3 HAS AN ADDRESS IN IT       00145700
         BAL   10,ADDTODS    PUT                                        00145800
         B     BEGCALL                                                  00145900
         EJECT                                                          00146000
LNKORBR  DC    X'00'       AN IN MAKELINK OR MAKEBRANCH                 00146100
MAKELINK MVI   LNKORBR,3    TYPE FOR LINK = 3                           00146200
         LA    2,96                                                     00146300
         LA    4,60               DISP TO PROMPT                        00146400
         ST    2,ABSAVE           SAVE DISP TO ROUTINE NAME             00146500
         BAL   10,PROMPTLP        SET UP PROMPT AREA AND WAIT FOR LP HI 00146600
         MVC   ENDPNT(12),POINT   SAVE WHERE LINK/BRANCH TO BE INSERTED 00146700
CON2     LA    3,0     INSERT NO CHARS AROUND TEXT                      00146800
         MVC   PTCHADD(2),MESSADD                                       00146900
         LA    2,TAGADD        WHERE TO WRITE                           00147000
         BAL   10,ADDZEROS     WRITE OUT ZEROS                          00147100
         BAL   9,INSERTC       PUT OUT CURSUR                           00147200
*        MOVE IN ROUTINE NAME IN CASE HE TRAVELLED                      00147300
         L     2,ABSAVE           DISP TO ROUTINE NAME                  00147400
         BAL   3,MVRTNAM          MOVE IN ROUTINE NAME                  00147500
         LA    2,840                                                    00147600
         BAL   3,MVINST                                                 00147700
         LA    5,CON2     FOR BACKRTAD                                  00147800
         OI    TRAVMASK,X'04'   ENABLE NEWAREA KEY                      00147900
         BAL   10,DISABLE1                                              00148000
WHERELK  CLI   COMAREA+3,1                                              00148100
         BE    HISLAB          ENDKEY                                   00148200
         CLC   ENDPNT(4),POINT    LINK FROM A& TO POINTS ON SAME PAGE ? 00148300
         BNE   MAKER              IF NOT, INSERTION CAUSES NO PROBLEMS  00148400
         CLC   ENDPNT+6(6),POINT+6  IF LINK POINT ABOVE LABEL,NO PROBLE 00148500
         BL    MAKER              PROBLEMS WITH INSERTION OF LAGEL      00148600
         MVC   STRTPNT(12),POINT  SAVE WHERE LABEL TO BE INSERTED       00148700
         L     15,=V(COUNTER)     SET UP LABEL FOR WNEN LINK CREATED    00148800
         L     15,0(15)           WANT LINK TO GO TO RIGHT PLACE        00148900
         ST    15,LABEL                                                 00149000
         SR    15,15              MAKE A NICE SYSTEM LABEL              00149100
         ST    15,LABEL+4                                               00149200
         MVI   LABNOP+1,X'00'     SET SWITCH SO LABEL WILL BE CREATED   00149300
         B     EXPL               LATER WHEN IT WILL BOTHER NO ONE      00149400
MAKER    BAL 9,SYSLAB          CREATE LABEL TO LINK TO                  00149500
         BAL   9,ENTLAB        ENTER LABEL IN SYMBOL TABLE              00149600
         B     EXPL                                                     00149700
         EJECT                                                          00149800
HISLAB   LA    5,LABEL         WHERE TO READ LABEL INTO                 00149900
         LA    6,7             READ 7 CHARS                             00150000
         LA    7,CURSADD       BEGIN READ AR CURSADD                    00150100
         BAL   9,READ          READ IN LABEL                            00150200
         MVI   LABEL+7,0       SO TERRY WILL HAVE NO TROUBLE            00150300
         B     EXPL            TO READ IN EXPLAINER                     00150400
NEWAREA  NI    FLAG,X'FE'         DIDN'T REALLY LEAVE A ROUTINE         00150500
         MCALL CREATEID                                                 00150600
         L     1,=V(SCANNER)   GET ITS OPOINT                           00150700
         MVC   POINT(12),0(1)   MOVE THE POINT INTO MY PROGRAM          00150800
         BAL   9,SYSLAB        CREATE LABEL (>SYSTEM) AS FIRST ENTRY    00150900
         BAL   9,ENTLAB        ENTER NEW LABEL IN LABEL TABLE           00151000
EXPL     NI    TRAVMASK,X'FB'     DISABLE NEWAREA KEY                   00151100
         MVC   ENTPNT(6),LABEL  SAVE LINKED TO LABEL                    00151200
         MVC   PTCHADD(2),MESSADD                                       00151300
         LA    2,TAGADD        WHERE TO WRITE OUT                       00151400
         SR    3,3                ZERO PUT NO CHARS AROUND ZEROS        00151500
         BAL   10,TEXTASIS                                              00151600
         BAL   9,INSERTC       LET HIM  WRITE SOMETHING                 00151700
         LA    2,900                                                    00151800
         BAL   3,MVINST                                                 00151900
*   CAN'T USE FORNAME BECAUSE R5 GETS ZONKED                            00152000
         LA    5,EXPL     RE    FOR BACKRTAD                            00152100
         MVI    GACB+15,X'09'                                           00152200
         BAL   10,DISABLE1+4                                            00152300
         MVC   LABEL(6),ENTPNT  RESTORE LINKED TO LABEL                 00152400
         MVC   POINT(12),ENDPNT   RESTORE LINKED FROM POINT             00152500
         LA    6,256           HOW MANY TO READ                         00152600
         BAL   10,GETMAIN    GET CORE TO READ IN EXPLAINER              00152700
         MVI   FREENOP+1,X'00'                                          00152800
         B     GOREAD     IN INSERT                                     00152900
         SPACE 5                                                        00153000
ENTLAB   LA    1,12             PREPARE R1 SO GETTAB ADDS 12 BYTES TO   00153100
         MCALL GETTAB                                                   00153200
         LR    2,1              LOAD PTR TO TOP OF LABTABLE             00153300
         A     1,0(1)           POINT TO BOTTOM OF LABTABLE             00153400
         LR    4,1                                                      00153500
         L     3,0(2)           LOAD LENGTH OF LABTABLE                 00153600
         LA    3,12(3)          INCREMENT BY 3 WORDS                    00153700
         ST    3,0(2)           STORE NEW LENGTH BACK INTO FIRST WORD   00153800
         LA    2,4(2)           POINT TO FISST LABEL IN TABLE           00153900
CHEKTOP  CLC   LABEL(6),0(2)                                            00154000
         BC    4,BISECTED+4     BRANCH IF NEW LABEL BELONGS AT TOP      00154100
*        WHENEVER CONTROL PASSES TO BISECTAB, R1 POINTS TO LOWERLABEL,  00154200
*        AND R2 TO HIGHER LABEL OF INTERVAL TO BE BISECTED.             00154300
BISECTAB ST    1,SAVEPTR        SAVE LOW PTR IN CASE LABEL BELONGS IN L 00154400
         SR    1,2              COMPUTE LENGTH IN BYTES OF INTERVAL     00154500
         SR    0,0                                                      00154600
         D     0,TWENTY4 BISECT IN TERMS OF 12 BYTES, AS EACH ITEM IS   00154700
         LTR   1,1              IS TOLERANCE MET?                       00154800
         BC    8,BISECTED       BRANCH IF BISECTION COMPLETED           00154900
         MH    1,=H'12'      CONVERT ITEMS QUOTIENT INTO BYTES          00155000
         AR    2,1              POINT TO MIDDLE LABEL OF INTERVAL       00155100
         CLC   LABEL(6),0(2)    COMPARE LABELS                          00155200
         BC    4,UPPER            BRANCH IF LABEL GOES IN UPPER HALF    00155300
         L     1,SAVEPTR        IF GOES IN LOWER, RESET R1 PTR          00155400
         B     BISECTAB                                                 00155500
UPPER    SR    2,1              POINT TO HIGHER LABEL OF NEW INTERVAL   00155600
         AR    1,2              POINT TO LOWER LABEL OF NEW INTERVAL    00155700
         B     BISECTAB                                                 00155800
BISECTED LA    2,12(2)                                                  00155900
         CLR   2,4                                                      00156000
         BC    10,PUTINLAB      BRANCH IF NO MOVING OF LABELS IS NEEDED 00156100
         L     5,=V(DISPLAY)                                            00156200
         LA    5,10(5)          POINT TO SCRATCH AREA                   00156300
         LA    6,255            R6 CONTAINS A BYTE LENGTH FOR EXECUTES  00156400
         LA    1,MOVELOOP                                               00156500
MOVELOOP SH    4,=H'256'                                                00156600
         CLR   2,4                                                      00156700
         BC    4,DODROP         BRANCH IF HAVE AT LEAST 256 BYTES TO    00156800
         LA    1,PUTINLAB                                               00156900
         AR    6,4                                                      00157000
         SR    6,2              R6 CONTAINS NUM OF BYTES LEFT TO BE     00157100
         LR    4,2              POINT TO AREA TO BE MOVED               00157200
DODROP   EX    6,DROPTAB        MOVE FROM LABEL TABLE TO SRATCH AREA    00157300
         EX    6,DROPTAB+6      MOVE FROM AREA BACK TO TABLE, 12 BYTES  00157400
         BR    1                                                        00157500
DROPTAB  MVC   0(1,5),0(4)                                              00157600
         MVC   12(1,4),0(5)                                             00157700
PUTINLAB MVC   0(6,4),LABEL     PUT NEW LABEL INTO TABLE                00157800
         MVC   8(4,4),POINT       PUT PAGE OF LABEL INTO TABLE          00157900
         BR    9                EXIT FROM ENTLAB                        00158000
SAVEPTR  DS    F                                                        00158100
TWENTY4  DC    F'24'                                                    00158200
         EJECT                                                          00158300
SYSLAB   L     14,=V(COUNTER)          THINGY FOR ALL SYS LABELS        00158400
         L     15,0(14)                GET ACTUAL COUNTER               00158500
         ST 15,LABEL           SET UP SYSTEM LABEL                      00158600
         LA    15,1(15)        INCREMENT SYSTEM LABEL                   00158700
         ST    15,0(14)                RESTORE COUNTER                  00158800
         LA    14,X'40'             3 BYTES OF 0 AND CODE FOR INT LABEL 00158900
         ST    14,LABEL+4                                               00159000
         LA    2,POINT         WHERE TO INSERT LABEL                    00159100
         LA    3,LABEL         ADDRESS OF LABEL TO INSERT               00159200
         LA    6,6             LABEL YTPE = 6                           00159300
         BAL   10,ADDTODS      PUT LABEL IN DS                          00159400
         BR    9               RETURN TO CALLING SPOT                   00159500
         SPACE 10                                                       00159600
MAKEBRAN MVI   LNKORBR,2      SET TYPE OF INSERT                        00159700
         LA    2,108                                                    00159800
         B     MAKELINK+8         CALL MVTRNAM AND SAME OROMPT          00159900
         SPACE 5                                                        00160000
POP1     LA    15,POP                                                   00160100
         BALR  14,15                                                    00160200
         B     CALLER     JUST CALL BEGIN, DON'T RESET PROMPT           00160300
         EJECT                                                          00160400
LINKORBR LA    2,120              DISP TO ROUTINE NAME                  00160500
         LA    4,1020             DISP TO PROMPT                        00160600
AAZ      BAL   10,PROMPTLP        WAIT FOR LP HIY                       00160700
         CLI   TYPE+3,3           HIT TYPE > 3                          00160800
         BH    ERR10              ERROR                                 00160900
         CLI   TYPE+3,1           IF NOT CHAR STRING, THEN WAS LINK     00161000
         BE    ERR10              OR BRANCH                             00161100
LINKGO   LA    15,LINK1        ACTUAL LINK ROUTINE                      00161200
         BALR  14,15                                                    00161300
         B     *+4(15)                                                  00161400
         B     CLRSWIT            IF SUCCES, MAKE SURE TEXTSCAN CALLED  00161500
ERR9     LA    2,1440                                                   00161600
         BAL   3,MVINST                                                 00161700
         B     BIGWAIT         DON'T CHANGE TYPES OF INTERRUPTS ALLOWED 00161800
ERR10    LA    2,1500                                                   00161900
         B     ERR9+4                                                   00162000
CLRSWIT  NI    FLAG,X'BF'         CLEAR BIT SO TEXTSCAN WILL BE CALLED  00162100
         B     CALLL                                                    00162200
         EJECT                                                          00162300
*        R2 => POINT TO CHECK AGAINST                                   00162400
*        R1 => RETURN                                                   00162500
*        (R0) => AMOUNT DS MOVED DOWN                                   00162600
STCKCHK  STM   2,6,12(13)         SAVE REGISTERS                        00162700
         L     3,=V(MOVE)         FLAG TELLING IF DS HAS BEEN MOVED DOW 00162800
         CLI   0(3),X'00'         IF NOT, DON'T GO THROUGH STACH        00162900
         BE    LOOPER+4           RELOAD REGS AND RETURN                00163000
         LA    0,8              LENTH DS MOVED DOWN ON AN DELETE        00163100
SETUPCHK L     3,=A(LINKSTCK)     ADDR OF TOP OF STACK                  00163200
         L     5,STACKIND         WHERE NEXT ENTRY IN STACK GOES        00163300
         CR    3,5                IF STACK ENPTY, GO HOME               00163400
         BE    LOOPER+4           RELOAD REGS AND RETURN                00163500
         LA    4,12               INCREMENT FOR BXLE                    00163600
         S     5,=F'12'           NATURE OF BXLE                        00163700
STKLOOP  CLC   0(4,2),0(3)        INPUT NAME VS STACK NAME              00163800
         BNE   LOOPER             IF NOT SAME, NO PROBLEMS              00163900
         CLC   6(6,2),6(3)        INPUT GUY BELOW STACK ENTRY ?         00164000
         BNL   LOOPER             NBELOW ON SCREEN) MO PROBLEMS         00164100
         CLC   6(2,2),6(3)        ARE IN SAME ORDER ?                   00164200
         BNE   NOTSAME            IF NOT, BRANCH                        00164300
         LH    6,10(3)          DISP WITHIN ORDER FROM STACK            00164400
NOP50    NOP   INSS               SET BY ADDTODS                        00164500
         SH    6,22(2)            MINUS DISP TO END OF DELEYE           00164600
         STH   6,10(3)            RESTORE IN STACK                      00164700
NOTSAME  LH    6,6(3)           DISP IN ORDERS FROM STACK               00164800
         AR    6,0                LENTH DS MOVED DOWN                   00164900
         STH   6,6(3)             RESTORE IN STACK                      00165000
LOOPER   BXLE  3,4,STKLOOP        GO THROUGH WHOLE STACK                00165100
         LM    2,6,12(13)         RELOAD REGS                           00165200
         BR    1                  RETURN TO CALLER                      00165300
         SPACE 3                                                        00165400
INSS     SH    6,10(2)            MINUS TO WHERE ORDER SPLIT            00165500
         B     NOP50+8            DO THE STORE AND LOOP                 00165600
         EJECT                                                          00165700
GETLAB   LA    2,144                                                    00165800
         LA    4,1140             DISP TO PROMPT                        00165900
         MVI   GACB+15,X'0A'       LP AND CANCEL FOR GETLABEL           00166000
         LA    10,RETRLAB         WHERE TO RETURN AFTER INTERRUPT       00166100
         BAL   3,MVRTNAM                                                00166200
         MCALL GETLABEL           SET UP LABEL DISPLAY                  00166300
         LR    6,1                LENTH OF DISPLAY TO WRITE             00166400
         L     5,=V(DISPLAY)      WHERE TO WRITE FROM                   00166500
         LA    7,START            WHERE TO WRITE INTO BUFFER            00166600
         BAL   9,WRITE            WRITE OUT LABELS                      00166700
         LR    2,4                DISP TO RIGHT PROMPT                  00166800
         BAL   3,MVINST                                                 00166900
         OI    FLAG,X'40'         SO TEXTSCAN WON'T BE CALLED           00167000
         B     DISABLE2+4         NO TRAVEL                             00167100
RETRLAB  MCALL WHICHLAB                                                 00167200
         LTR   15,15              WAS A LABEL HIY ?                     00167300
         BE    LINKGO             YES, FIND WHAT PAGE IT IS ON          00167400
         B     BIGWAIT            WAIT FOR THE IDIOT TO DO SOMETHING RI 00167500
         SPACE 3                                                        00167600
SETUPRET MVI   GACB+8,X'00'       LOOK LIKE MASK FOR TRAVELLING         00167700
         OI    FLAG,X'01'         SO WILL THINK AM RETURNING INTO ROUT  00167800
         ST    8,BACKRTAD         STORE RETURN ADDRESS (IMMED)          00167900
         B     CALLER             CALL BEGIN FOR A NEW DISPLAY          00168000
         SPACE 5                                                        00168100
MAKELAB  SR    2,2                DISP TO PROMPT(LP INSERTION POINT)    00168200
         LA    4,1260             DISP TO PROMPT                        00168300
         BAL   10,PROMPTLP        SET UP PROMPT AND WAIT FOR LP HIT     00168400
         LA    2,1320                                                   00168500
         BAL   8,FORNAME          PUT OUT CURSUR IN TAGAREA             00168600
LABINTAB LA    5,LABEL         WHERE TO READ IN LABEL                   00168700
         LA    6,7             READ IN 7 CHARS                          00168800
         LA    7,CURSADD       WHERE TO READ FRON                       00168900
         BAL   9,READ          READ IN HIS LABEL                        00169000
         MVI   LABEL+7,0       SET FOR EXTERNAL LABEL                   00169100
         BAL   9,ENTLAB        PUT LABEL IN LABEL TABLE                 00169200
         LA    6,6             LABEL TYPE = 6                           00169300
         B     CALLADD            USE INSERT'S ROUTINE                  00169400
         EJECT                                                          00169500
DELELAB  LA    2,192              DISP TO ROUTINE NAME                  00169600
         LA    4,1620             DISP TO PROMPT                        00169700
         OI    FLAG,X'08'         TEMP DISABLE OF CANCEL KEY            00169800
         MVI   GACB+15,X'0B'       LP, END, AND CANCEL ALLOWED          00169900
         BAL   10,GETLAB+16        GO WRITE OUT MAIN DISPLAY(ALL LABS)  00170000
         CLI   COMAREA+3,1         END ? => CLEAR OUT OF MODE           00170100
         BE    CLRNCANC           CLEAR NO CANCEL KEY FLAG              00170200
         CLI   COMAREA+3,3        LP HIT ?                              00170300
         BNE   REVERT             IF NOT, THEN BRANCH                   00170400
         LA    1,POINT            WHERE TO SAVE DELETED LABEL AND ITS P 00170500
         MCALL DELELAB            DELETE LABEL THAT WAS LP'ED FROM TABL 00170600
         MVI   REVERT+1,0          NOW THAT HE HAS DELETED LABEL, LET   00170700
         B     DELELAB            CYCLE THROUGH AGAIN                   00170800
CLRNCANC NI    FLAG,X'B6'         CLEAR NO TEXTSCAN,NO CANC, & INITERR  00170900
         MVI   REVERT+1,X'F0'      SINCE HE WANTS TO LEAVE MODE, NO     00171000
         B     BEGCALL            END MODE                              00171100
REVERT   B     DELELAB             *** SWITCH** ONLY ALLOE REVERT AFTER 00171200
         MVI   REVERT+1,X'F0'      NO MORE REVERT UNTIL ANOTHER DELETE  00171300
         BAL   9,ENTLAB            RE-INSETR LAST DELETED LABEL         00171400
         B     DELELAB            ALLOW ANOTHER LABEL DELETE            00171500
         SPACE 5                                                        00171600
        DROP  11,12,13                                                  00171700
         USING *,15                                                     00171800
POP      CLC   STACKIND(4),=A(LINKSTCK)   IS STACK EMPTY?               00171900
        BE    ERMA                                                      00172000
         L     1,STACKIND      GET ADDRESS OF NEXT ENTRY IN STACK       00172100
         S     1,=F'12'           MOVE BACK TO PREV ENTRY               00172200
         L     2,=V(OPOINT)       ADD OF BEGIN'S SCAN POINT             00172300
         MVC   0(12,2),0(1)    MOVE PREVIOUS POINT INTO OPOINT          00172400
         ST 1,STACKIND         STORE NEW INDEX ON STACK                 00172500
ERMA     BR    14                 RETURN                                00172600
         DROP  15                                                       00172700
         EJECT                                                          00172800
         USING *,15                                                     00172900
LINK1    STM   14,12,12(13)                                             00173000
         LR    14,13                                                    00173100
         LA    13,ABSAVE                                                00173200
         ST    14,4(13)                                                 00173300
         ST    13,8(14)                                                 00173400
         LR    12,15                                                    00173500
         USING LINK1,12                                                 00173600
         DROP  15                                                       00173700
         SR    1,1             INCREMENT TO LABEL TABLE                 00173800
         MCALL GETTAB                                                   00173900
         LR    10,1                                                     00174000
         A     1,0(1)          R1 POINTS JUST PAST LAST ENTRY IN TABLE  00174100
LOSP     CLC   4(6,10),LABEL   SEARCH TABLE FOR LABEL                   00174200
         BE    GOLINK          IF HAVE FOUND, GO TO GOLINK              00174300
         LA    10,12(10)                                                00174400
         CR    10,1            CUR POINTER VS END OF TABLE              00174500
         BL    LOSP            NO, GO TO LOSP                           00174600
         B     ERR9A                                                    00174700
GOLINK   MVC   BLOCK+4(4),12(10)  PUT PAGE NAME IN BLOCK GOING TO GETIT 00174800
         SR    2,2                     ZERO ¢ R2                        00174900
         ST    2,BLOCK+8               WE WANT NO INCREMENT             00175000
         LA    1,BLOCK       ADDRESS OF PARAMETER LIST                  00175100
         L     15,=V(GETITEM)                                           00175200
         BALR  14,15                                                    00175300
         L     4,BLOCK+12    ADDRESS OF ORDERS ID                       00175400
         A     4,8(4)        ADD DISP TO ORDERS                         00175500
         LR    9,10            SAVE POINTER TO TABLE ENTRY              00175600
         LR    10,4          SAVE POINTER TO TOP OF ORDERS              00175700
RESLOOP  IC    5,0(4)                  GET TYPE OH OF ORDER             00175800
         N     5,=XL4'3F'         ZONK BITS                             00175900
         C     5,=F'6'            IS IT CODE FOR LABEL?                 00176000
         BE    TESTIF          IF SO GO TO TESTIF                       00176100
NOOOP    TM    0(4),X'80'              IS IT LAST ORDER?                00176200
         BO    NXTPAGE         IF YES, SEE IF THIS TEXT CONTINUES       00176300
         SLL   5,2             MULTIPLY BY 4 FOR INDEXING               00176400
         A     4,ORDERLN(5)    IF NOT, ADD ORDER LENTH                  00176500
         B     RESLOOP         GO   TO NEXT ORDER                       00176600
TESTIF   CLC   1(6,4),LABEL            IS THIS RIGHT LABEL?             00176700
         BNE   NOOOP           IF NOT, GO TO NOOOP                      00176800
         SR    4,10                                                     00176900
         L     1,=V(OPOINT)       ADD OF BEGIN'S SCAN POINT             00177000
         L     2,STACKIND      GET ADDRESS OF NEXT ENTRY IN STACK       00177100
         C     2,=A(LINKSTCK+960-12)   IF STACK FULL, DON'T MAKE ENTRY  00177200
         BNL   NOSTOR                                                   00177300
         MVC   0(12,2),0(1)    SAVE CURRENT OPOINT                      00177400
         LA    2,12(2)         INCREMENT ADDRESS ON STACK               00177500
         ST    2,STACKIND      STORE UPDATED ADDRESS                    00177600
NOSTOR   STH   4,6(1)            STORE DISP IN ORDERS IN OPOINT         00177700
         MVC   0(4,1),BLOCK+4          PUT PAGE NAME IN OPOINT          00177800
         XC    8(4,1),8(1)     ZERO DISP WITHIN ORDER                   00177900
         SR    15,15              RETURN CODE = SUCCESS                 00178000
RELOAD   L     13,4(13)           HSA ADDR                              00178100
         L     14,12(13)          RETURN ADDR                           00178200
         LM    0,12,20(13)        REST OF THE REGS                      00178300
         BR    14                                                       00178400
NXTPAGE  L     11,=V(VFADD)    ADD OF ADD OF VF                         00178500
         L     11,0(11)        R11 POINTS AT VF                         00178600
         LA    11,4(11)        R11 POINTS AT FIRST PAGE ENTRY IN VF     00178700
         CLC   1(3,11),BLOCK+5   VF ENTRY VS PAGE NAME FROM LABEL TABLE 00178800
         BNE   *-10               IF NOT RIGHT PAGE, KEEP LOOKING       00178900
         TM    0(11),X'80'     IS THIS THE END OF CONTINUOUS TEXT ?     00179000
         BO    ERR9A           IF IT IS, A MISTAKE HAS BEEN MADE        00179100
         L     8,4(11)         OTHERWISE, GET NEXT PAGE IN THIS PIECE   00179200
         LA    8,0(8)          CLEAR THE HIGH ORDER BYTE                00179300
         LR    10,9            R10 POINTS TO LABEL ENTRY IN TABLE       00179400
         ST    8,12(10)        CHANGE PAGE NAME IN LABEL TABLE          00179500
         B     GOLINK          TRY THIS PAGE FOR THE LABEL              00179600
ERR9A    LA    15,4               RETURN CODE = UNDEFINED LABEL         00179700
         B     RELOAD             RESTORE REGS AND RETURN               00179800
         DROP  12                                                       00179900
BLOCK    DC    5F'0'                                                    00180000
*                                                                       00180100
*        TEXTSCAN HAS A DSECT FOR BELOW                                 00180200
*                                                                       00180300
MAPENTLN DC    F'0,8,16,16,8,8,8,0,8,8,8'                               00180400
TYPE     DC    F'0'                                                     00180500
POINT    DC    3F'0'                                                    00180600
LABEL    DC    2F'0'                                                    00180700
ORDERLN  DC    F'4,8,12,12,4,8,8,4,8,8,4'                               00180800
STACKIND DC    A(LINKSTCK)                                              00180900
         EJECT                                                          00181000
         CNOP  4,8                                                      00181100
ABCOND   B     100(15)                                                  00181200
         DC    CL16'REGS AT ABEND '                                     00181300
PSW      DC    2F'0'                                                    00181400
         DC    16F'0'                                                   00181500
         DC    CL8'END REGS '                                           00181600
         MVC   20(8,15),4(1)                                            00181700
         STM   3,13,40(15)                                              00181800
         MVC   84(8,15),12(1)                                           00181900
         MVC   28(12,15),20(1)                                          00182000
         LR    10,15                                                    00182100
         USING ABCOND,10                                                00182200
         UNPK  PSWUNPK(15),4(8,1)                                       00182300
         MVC   PSWUNPK+15(1),11(1)                                      00182400
         OC    PSWUNPK+14(2),ZONES                                      00182500
         TR    PSWUNPK(16),CHARTAB-X'F0'                                00182600
         MVC   PSWIN(8),PSWUNPK                                         00182700
         MVC   PSWIN+9(8),PSWUNPK+8                                     00182800
         MVC   9(3,1),ABFIXAD                                           00182900
         BR    14                                                       00183000
ABFIXUP  MVI   ABDECB,0                                                 00183100
         LA    13,ABSAVE                                                00183200
         GWRITE ABDECB,STR,GDCB,200,ABMSRT,START,START                  00183300
         WAIT  1,ECB=(1)                                                00183400
         TM    FLAG,X'20'         AM I IN FORMATTING?                   00183500
         BZ    *+10               IF NOT, DON'T CALL DAVE'S BOMBER      00183600
         MCALL TXT360BM                                                 00183700
         LM    11,13,SAVRAD                                             00183800
         USING SAVEREGS,13                                              00183900
         MVC   GACB+8(4),=X'FBFFFFFF'     ENABLE ALL BUT NEWAREA        00184000
         MVI   GACB+15,2        ALLOW LP GAS PEDAL WHEN COME BACK       00184100
         TM    FLAG,X'80'         AM IN ATTEN ROUTINE ?                 00184200
         BO    BIGWAIT            IF SO, RETURN OUT OF IT               00184300
         B     WAIT                OTHERWISE, SIT AND WAIT              00184400
         DROP  10                                                       00184500
FLAG     DC    X'00'                                                    00184600
*        BIT 0 ON => AM IN ATTENTION ROUTINE, RETURN OUT OF IT          00184700
*              ON A BOMBOUT                                             00184800
*        BIT 1 ON => DON'T GO TO TEXTSCAN ON A LP HIT                   00184900
*        BIT 2 ON => AM IN FORMAT PHASE, GO TO 'TXT360BM' ON A          00185000
*              BOMBOUT                                                  00185100
*        BIT 3 ON => AM IN PUNCH ROUTINE WAITING FOR SECOND LP HIT      00185200
*              IN THE TEXT PROPER                                       00185300
*        BIT 4 ON => PANIC KEY RETURNS INTO ROUTINE, IT DOES NOT END    00185400
*              A MODE AND CLEAR ALL SWITCHES                            00185500
*        BIT 5 ON => WAITING FIR SECOND TEXT HIT IN BORROW              00185600
*        BIT 6 ON => IN MIDDLE OF REARRANGE AND HAVE TRAVELLED AFTER    00185700
*              FIRST LP HITS SO DON'T WRITE BLANKS INTO BUFFER          00185800
*        BIT 7 ON => REALLY DID TRAVEL IN MIDDLE OF OTHER ROUTINE &     00185900
*              MUST RETURN INTO IT.  NOT SET IF TRAVEL OCCURED IN       00186000
*              NO OTHER FUNCTION                                        00186100
*                                                                       00186200
GDCB     DCB   DSORG=GS,MACRF=(RC,WC),DDNAME=SCOPE,GTYPE=BASIC          00186300
PSWUNPK  DC    2D'0'                                                    00186400
ABSAVE   DC    18F'0'                                                   00186500
ZONES    DC    XL2'F0F0'                                                00186600
         EJECT                                                          00186700
         USING SAVEREGS,13,12,11                                        00186800
         DS    0H                                                       00186900
         SPACE 2                                                        00187000
COPYDISK MVI   CODE+3,1           WANT TO KEEP WORKAREA DCB OPEN        00187100
         BAL   8,CLEANUP          GET ALL PAGES OUT OF CORE             00187200
         SR    3,3             GET A ZERO                               00187300
         ST    3,BLOCK         SO WILL RETRIEVE VF IMMEDIATELY          00187400
         ST    3,BLOCK+12         ZERO INCR FOR MAINTAIN                00187500
         L     2,=V(LABTABAD)  ZERO ADD OF LABEL TABLE SINCE IT IS      00187600
         ST    3,0(2)                  NO LONGER IN CODERE              00187700
         NI    FLAG,X'BF'         CLEAR NO TEXTSCAN BIT                 00187800
         B     RETRVF             BRING VF BACK IN                      00187900
         SPACE 3                                                        00188000
FINISH   MVI   CODE+3,0           CLOSE ALL THE DCB'S                   00188100
         BAL   8,CLEANUP          GET ALL PAGES OUT OF CORE             00188200
         POST  WAITWORD,255    POST MAINLINE WAIT TO GO HOME            00188300
         B     BIGWAIT         RETURN OUT OF ATTENTION ROUTINE          00188400
         SPACE 4                                                        00188500
CLEANUP  BAL   10,WRITRENT        WRITE OUT RENT MESSAGE                00188600
         BAL   10,CLRCORE         PAGE EVERYTHING OUT                   00188700
CODE     LA    1,1                CHANGED TO CLOSE OR KEEP DCB OPEN     00188800
         MCALL END                                                      00188900
         BR    8                  RETURN                                00189000
         SPACE 2                                                        00189100
ABEND    LA    1,1             COMPLETION CODE                          00189200
         SVC   13              ABEND                                    00189300
         EJECT                                                          00189400
WRITRENT LA    5,RENTMESS      WHAT TO WRITE OUT                        00189500
         LA    6,RENTLEN                                                00189600
         LA    7,START                                                  00189700
         BAL   9,WRITE                                                  00189800
         BAL   9,RESTART                                                00189900
         BR    10                                                       00190000
         SPACE 3                                                        00190100
         SPACE 3                                                        00190200
*        RETURN BY R10                                                  00190300
*                                                                       00190400
CLRCORE  L     6,=V(IDTABLE)      TABLE OF INCORE PAGES                 00190500
         MVI   BLOCK+4,X'60'                                            00190600
         LA    1,BLOCK                                                  00190700
         CLI   0(6),X'FF'         TABLE COMPLETELU EMPTY ?              00190800
         BE    COMPDONE                                                 00190900
STORLOOP L     7,0(6)             PAGE NAME FROM IDTABLE                00191000
         L     9,4(6)             ORDERS PAGE ADDRESS                   00191100
         BAL   5,STORER           STORE ORDERS PAGE                     00191200
         L     9,8(6)             ADD OF DATA PAGE                      00191300
         LA    7,1(7)             NAME OF DATA PAGE                     00191400
         BAL   5,STORER           STORE DATA PAGE                       00191500
         MVI   0(6),X'FF'         SET EMPTY TABLE FLAG                  00191600
         TM    4(6),X'80'         END OF TABLE ?                        00191700
         BO    COMPDONE                IF IT OS, BRANCH                 00191800
         LA    6,12(6)            POINT AT NEXT TABLE ENRTY             00191900
         B     STORLOOP                                                 00192000
         SPACE 2                                                        00192100
STORER   C     7,0(9)             WAS RIGHT ADDRESS IN IDTABLE          00192200
         BNE   GOODY                IF HAVE WRONG PAGE, BOMB OUT        00192300
         ST    7,BLOCK            PAGE NAME INTO PARAM LIST FOR MARTY   00192400
         L     9,4(9)             LENTH OF PAGE(TAKEN FROM PAGEV HEADER 00192500
         STH   9,BLOCK+6          PUT LENTH TO STORE IN PARAM LIST      00192600
         MCALL MAINTAIN             CALL ROUTINR TO PASS PAGE OUT OF CO 00192700
         BR    5                  RETURN                                00192800
         EJECT                                                          00192900
COMPDONE SR    5,5                NAME OF VERSION FILE                  00193000
         ST    5,BLOCK            PUT INTO PARAM LIST                   00193100
         L     6,=V(VFADD)        ADD OF ADDD OF VF                     00193200
         L     6,0(6)             R6 POINTS TO TOP OF VF                00193300
         L     7,0(6)             LENTH OF VF                           00193400
*        R6  => TOP OF VF                                               00193500
*        (R7)  = LENTH OF VF                                            00193600
         LA    5,4(7)             VF LENTH + 4 FOR COUNTER STORE        00193700
         STH   5,BLOCK+6          PUT LENTH TO STORE IN PARAM LIST      00193800
         L     5,=V(COUNTER)      ADD OF SYSTEM LABEL GENERATOR         00193900
         L     5,0(5)             GET ACTUAL COUNTER                    00194000
         ST    5,0(6,7)           PUT COUNTER AT END OF VF              00194100
         MCALL MAINTAIN                                                 00194200
         L     6,=V(LABTABAD)     ADD OF ADD OF LABEL TABLE             00194300
         L     6,0(6)             ADD OF LABEL TABLE                    00194400
         LTR   6,6                IF ADD = 0, THEN LABEL TABLE ON       00194500
         BER   10                 DISK ALREADY, I.E. DON'T STORE        00194600
        L     6,0(6)             GET LEN OF TABLE FROM TOP OF TABLE     00194700
        STH   6,BLOCK+6          PUT LEN TO STORE IN PARAM LIST         00194800
        OI    BLOCK+3,1          LABEL TABLE NAME = 00000001            00194900
        MCALL MAINTAIN           STORE LABEL TABLE                      00195000
        BR    10                 RETURN TO CALLER                       00195100
        SPACE 6                                                         00195200
GOODY    L     1,=X'80000008'         DUMP & COMP CODE                  00195300
        SVC   13                 ABEND                                  00195400
        EJECT                                                           00195500
        PRINT NOGEN                                                     00195600
        GINIT BLC=2990,BLP=2990  SO GTRU TO RIGHT PLACE                 00195700
ABMSRT  GSRT                     START REGENERATION TIMER               00195800
         GEPM                                                           00195900
        GDV   0,2048,B           WHERE TO WRITE OUT MESSAGE             00196000
        GECP  B                  ENTER CHAR MODE                        00196100
        GTXT  'I''M SORRY BUT THIS PROGRAM WORKS'                       00196200
        GCNL  2                  SKIP TWO LINES                         00196300
        GTXT  'PEOPLE JUST DO NOT KNOW HOW TO USE IT'                   00196400
        GCNL  2                  SKIP TWO LINES                         00196500
        GTXT  'IF YOU WOULD LIKE TO START WORKING AGAIN, HIT THE'       00196600
        GTXT  ' RETURN KEY'                                             00196700
        GCNL  2                                                         00196800
        GTXT  'PSW:  '           INDICATE WHERE BOMBOUT OCCURED         00196900
PSWIN   GTXT  '                .'     THIS WHERE PSW MOVED IN           00197000
ABMEND  GTRU  ABMSRT             LOOP BACK TO START OF MESSAGE          00197100
        SPACE                                                           00197200
SAVRAD  DC    A(SAVEREGS+8192,SAVEREGS+4096,SAVEREGS)                   00197300
CHARTAB DC    CL16'0123456789ABCDEF'    I USED IN CONVERSION TO CHAR    00197400
ABFIXAD DC    AL3(ABFIXUP)       ADDR MOVED INTO PSW TO RESTART         00197500
        LTORG                                                           00197600
**********************************************************************  00197700
INITMESS GSRT                                                           00197800
        GEPM                                                            00197900
        GDV   200,3000,B                                                00198000
        GECP  B                                                         00198100
        GTXT  'TYPE IN THE NAME OF '                                    00198200
        GECP  L                                                         00198300
        GTXT  'YOUR'                                                    00198400
        GECP  B                                                         00198500
         GTXT  ' BACKUP DATA SET: '                                     00198600
        GEVM                                                            00198700
        GDV   300,2500,B                                                00198800
        GECF  L                                                         00198900
DSNAME  GTXT  'SYS1.P1518.AVD.'                                         00199000
CURSMESS DC   CL29' '                                                   00199100
        GEVM                                                            00199200
        GDV   1300,2920,B        POSITION BEAM FOR UNDERLINE            00199300
        GDV   1600,2920,U        DRAW LINE UNDER 'YOUR'                 00199400
        DS    2H                 FOR THE BGTRU                          00199500
ENDMESS EQU *                                                           00199600
**********************************************************************  00199700
RENTMESS GSRT                                                           00199800
         GEVM                                                           00199900
         GDV   870,3400,B         POSITION FOR SPACE MESSAGE            00200000
         GECP  L                                                        00200100
         GTXT  'THIS SPACE AND TIME FOR RENT'                           00200200
         GEVM                                                           00200300
         GDV   900,1000,B                                               00200400
         GECP  B                                                        00200500
         GTXT  'FOR RATES, SEE DAVE RICE OR STEVE CARMODY'              00200600
        GEVM                                                            00200700
         GDV   1000,2600,B                                              00200800
         GDV   3000,2600,U                                              00200900
        GDV   3000,1400,U                                               00201000
         GDV   1000,1400,U                                              00201100
         GDV   1000,2600,U                                              00201200
RENTADD GTRU  2990                                                      00201300
RENTLEN EQU   *-RENTMESS                                                00201400
*********************************************************************** 00201500
DUMPMESS GSRT                                                           00201600
        GEVM                                                            00201700
        GDV   0,4000,B                                                  00201800
        GECP  L                                                         00201900
         GTXT  'COPY  '                                                 00202000
         GCNL  2                                                        00202100
         GTXT  'FINISH'                                                 00202200
         GCNL  2                                                        00202300
        GTXT  'ABEND '                                                  00202400
DUMPADD  GTRU  2990                                                     00202500
DUMPLEN  EQU   *-DUMPMESS                                               00202600
*********************************************************************** 00202700
         EJECT                                                          00202800
M1       DC    CL12'MAKELABEL:'                                         00202900
         DC    CL12'INSERT:'                                            00203000
         DC    CL12'INSTANCE:'                                          00203100
         DC    CL12'INSERT INST:'                                       00203200
         DC    CL12'REARRANGE:'                                         00203300
         DC    CL12'COPY:'                                              00203400
         DC    CL12'DELETE:'                                            00203500
        DC    CL12'MAKETAG:'                                            00203600
         DC    CL12'MAKELINK:'                                          00203700
         DC    CL12'MAKEBRANCH:'                                        00203800
         DC    CL12'BRANCH/LINK:'                                       00203900
         DC    CL12'SUBSTITUTE:'                                        00204000
         DC    CL12'GETLABEL:'                                          00204100
         DC    CL12'MERGE:'                                             00204200
         DC    CL12'SING.CH.DEL.'                                       00204300
         DC    CL12'BORROW:'                                            00204400
         DC    CL12'DELETE LABEL:'                                      00204500
         DC    CL12'GET PICTURE:'                                       00204600
* NEXT IS *+216                                                         00204700
N1 DC CL60'TYPE IN THE NUMBER OF THE BRANCH YOU WISH TAKEN'             00204800
 DC CL60'LIGHT PEN THE POINT AT WHICH YOU WISH TO INSERT'               00204900
 DC CL60'TYPE IN YOUR INSERT: END KEY = ACCEPT. CANCEL KEY = REJECT'    00205000
 DC CL60'LIGHT PEN THE ENDPOINTS OF THE INSTANCE'                       00205100
 DC CL60'TYPE IN THE NAME OF THE INSTANCE AND HIT THE ENDKEY'           00205200
 DC CL60'LP TEXT OR TRAVEL       CARRY LABELS       CHANGE BRANCH OPT'  00205300
 DC CL60'LIGHT PEN ANOTHER INSERTION POINT OR HIT END OR CANCEL KEY'    00205400
 DC CL60'LIGHT PEN THE ENDPOINTS OF THE STRING TO BE MOVED'             00205500
 DC CL30'SUPPRESS OR DISPLAY LABELS'                                    00205600
 DC CL30'SUPPRESS OR DISPLAY FORMATS'                                   00205700
 DC CL60'LIGHT PEN THE ENDPOINTS OF THE STRING TO BE DELETED'           00205800
 DC CL60'END KEY = ACCEPT; CANCEL KEY = REJECT'                         00205900
 DC CL60'LIGHT PEN THE POINT WHERE YOU WISH TO MAKE A TAG'              00206000
 DC CL60'TYPE IN THE TAG AND HIT THE ENDKEY'                            00206100
 DC CL60'TYPE IN YOUR NEW EXPLAINER'                                    00206200
 DC CL60'TYPE LABEL,HIT NEWAREA KEY,LITE-PEN TEXT,OR TRAVEL'            00206300
 DC CL60'TYPE IN EXPLAINER OR TRAVEL'                                   00206400
 DC CL60'   LIGHT PEN THE CHARACTER YOU WISH TO DELETE'                 00206500
 DC CL60'LIGHTPEN LINK ASTERISK OR BRANCH EXPLAINER YOU WISH TO FOLLOW' 00206600
 DC CL44'LP ENDPOINTS OF STRING TO BE BORROWED'                         00206700
 DC CL16'CHANGE EXPLAINER'                                              00206800
 DC CL60'LIGHT PEN THE LABEL YOU WISH TO RETRIEVE'                      00206900
 DC CL60'LIGHT PEN THE ENDPOINTS OF THE STRING TO BE SUBSTITUTED FOR'   00207000
 DC CL60'LIGHT PEN THE POINT AT WHICH YOU WISH TO MAKE A LABEL'         00207100
 DC CL60'TYPE IN THE LABEL AND HIT THE ENDKEY'                          00207200
 DC CL60'SORRY, I DON''T HAVE AN INSTANCE WITH THAT NAME'               00207300
 DC CL60'THIS JUMP IS TO AN UNDEFINED LABEL. BETTER LUCK NEXT TIME'     00207400
 DC CL60'TRY AGAIN, HIT BRANCH EXPLAINER OR LINK ASTERISK'              00207500
 DC CL60'HIT FUNCTION KEY OF DESIRED ACTION'                            00207600
 DC CL60':  LIGHT PEN THE LABEL YOU WISH TO DELETE'                     00207700
 DC CL60'LP POINT TO INSERT PICTURE OR TYPE SKETCHPAD LOAD NAME'        00207800
 DC CL60'THAT PAGE OR DATA SET DOES NOT EXIST. PLEASE RE-TYPE'          00207900
* NEXT IS *+1800                                                        00208000
LINKSTCK DS    240F               PUSH DOWN STACK FOR TRAVELLING        00208100
        AIF   ('&SYSSIZE' EQ 'MINI').MINI7                              00208200
EXPSTR   DS    256X               WHERE KEEP EXPLAINER FOR BORROW       00208300
STOR    DS    1500X              STROAGE AREA FOR INSTANCES             00208400
.MINI7   ANOP                                                           00208500
*********************************************************************** 00208600
PTCHADD  EQU   GTRU2+2            WHERE RETURN ADDR FROM BUFFER PATCH   00208700
INSTNAM EQU   LABEL              WHERE INSTANCE NAME TYPED IN           00208800
**********************************************************************  00208900
        END                                                             00209000
