:READ  CAPIT    ASSEMBLE C1 WORK    3/26/19  21:59
         MACRO                                                          00000100
&LAB     MCALL &ENTRY,&CHECK=NO                                         00000200
&LAB     L     15,=V(&ENTRY)      LOAD BRANCH ADDRESS                   00000300
         AIF   ('&CHECK' EQ 'NO').NOCHECK                               00000400
         LTR   15,15             IF PROGRAM NOT PRESENT,                00000500
         BE    *+6               DON'T BRAMCH                           00000600
.NOCHECK BALR  14,15             BRANCH TO ROUTINE                      00000700
          MEND                                                          00000800
         TITLE 'ROUTINE TO CAPITALIZE A HYPERTEXT ONLINE'               00000900
         PRINT NOGEN                                                    00001000
CAPIT    ENTER                                                          00001100
         OPEN  GDCB                                                     00001200
         ASGNBFR GDCB,BUFLEN                                            00001300
         SPAR  GACB                                                     00001400
         GREADR CLEAR,MIP,GDCB,CAPSAV01                                 00001500
         WAIT  1,ECB=CLEAR                                              00001600
         LH    2,GDCB+16          RELOCATE EVERYTHING IN SIGHT          00001700
         STH   2,ZERO                                                   00001800
         LH    3,WHNAME                                                 00001900
         AR    3,2                                                      00002000
         STH   3,WHNAME                                                 00002100
         LA    3,15(3)                                                  00002200
         STH   3,CURSADD                                                00002300
         GWRITE REQUEST,BUF,GDCB,300,REQMESS,ZERO                       00002400
         WAIT  1,ECB=REQUEST                                            00002500
         GCNTRL INSERTC,INS,GDCB,CURSADD                                00002600
         WAIT  1,ECB=INSERTC                                            00002700
         GCNTRL START,STR,GDCB,ZERO                                     00002800
         WAIT  1,ECB=START                                              00002900
         WAITR 1,ECB=MAINLINE                                           00003000
         CLOSE (GDCB)                                                   00003100
         L     13,4(13)                                                 00003200
         RETURN (14,12)                                                 00003300
         EJECT                                                          00003400
         USING *,15                                                     00003500
ATTNROUT STM   14,12,12(13)                                             00003600
         B     SAVEA+72                                                 00003700
SAVEA    DC    18F'0'                                                   00003800
         LR    14,13                                                    00003900
         LA    13,SAVEA                                                 00004000
         ST    13,8(14)                                                 00004100
         ST    14,4(13)                                                 00004200
         DROP  15                                                       00004300
         USING SAVEA,13                                                 00004400
         SR    15,15                                                    00004500
         IC    15,COMAREA+3       GET ATTENTION TYPE                    00004600
         SLL   15,2                                                     00004700
         L     15,ADDR-4(15)                                            00004800
         BR    15                                                       00004900
ADDR     DC    A(END,CANCEL,0,0,CANCEL)                                 00005000
         EJECT                                                          00005100
END      MVI   INNAME,0                                                 00005200
         GREAD INNAME,BUF,GDCB,44,DSNAME,WHNAME                         00005300
         WAIT  1,ECB=INNAME                                             00005400
         LA    1,DSNAME                                                 00005500
         MCALL INIT                                                     00005600
         LA    1,PARMLST                                                00005700
         MCALL MAINTAIN                                                 00005800
         LTR   15,15               PROTECTION                           00005900
         BNE   CANCEL                                                   00006000
         L     15,=V(VFADD)                                             00006100
         L     14,PARMLST+8                                             00006200
         ST    14,0(15)                                                 00006300
         A     14,0(14)            ADDR OF VF + VF LEN = ADDR OF CNTR   00006400
         L     14,0(14)            PICK UP COUNTER                      00006500
         L     15,=V(COUNTER)                                           00006600
         ST    14,0(15)            RESET COUNTER TO NEXT VALUEU         00006700
PUNCH    L     2,=V(VFADD)        GET ADDR OF ADDR OF VF                00006800
         L     2,0(2)              GET ADDR OF VF                       00006900
         LA    2,4(2)              INDEX OVER POINTER TO BOTTOM         00007000
         BAL   1,GETITEM               GET PAGE (RETRIEVE)              00007100
         A     4,8(4)                  ADD DISP TO, ORDERS              00007200
         B     INCRDATA                                                 00007300
IDLOOP   BAL   1,GETITEM                                                00007400
         A     4,8(4)                  R4 INDEXES THROUGH ORDERS        00007500
INCRDATA A     5,8(5)           GET ADDR OF DATA STRINGS                00007600
         ST    5,DATAADD               STORE POINTER TO START OF DATA   00007700
         MVI   LASTFLAG,0                                               00007800
ORDERSLP CLI   LASTFLAG,1              IS FLAG FOR LAST ORDER ON        00007900
         BE    NEXTID                  YES, GO GET NEW ID               00008000
         IC    7,0(4)                  GET TYPE OF ORDER                00008100
         TM    0(4),X'80'              IS THIS LAST ORDER               00008200
         BZ    *+8                     NO, GO AROUND                    00008300
         MVI   LASTFLAG,1              YES, SET FLAG FOR THIS           00008400
         N     7,=XL4'3F'              CLEAR OUT ANY BITS               00008500
         SLL   7,2                     MULTIPLY BY 4                    00008600
         L     7,ADDRTAB(7)            GET ADDR OF CORRECT ROUTINE      00008700
         BR    7                       AND GO TO IT                     00008800
ADDRTAB  DC    A(NOOP,CHAR,NOOPLINK,NOOPLINK)                           00008900
         DC    A(NOOP,LAB,LAB,NOOP,LAB)                                 00009000
         DC    A(LAB,CHKCAP)                                            00009100
ITEM     DC    5F'0'                                                    00009200
DATAADD  DC    F'0'                                                     00009300
LASTFLAG DC    X'00'                   FLAG FOR LAST ORDER WITHIN ID    00009400
ENDFLAG  DC    X'00'                   FLAG FOR LAST ID WITHIN FRAGMENT 00009500
PARMLST  DC    F'0'                                                     00009600
         DC    X'40',AL3(0)                                             00009700
         DC    2F'0'                                                    00009800
         SPACE 3                                                        00009900
NEXTID   MVI   LASTFLAG,0           TURN OFF FLAG                       00010000
         CLI   ENDFLAG,1               IS THIS LAST ID                  00010100
         BE    RETURN                  YES, GO BACK                     00010200
         LA    2,4(2)                  NO, GET NEXT ID NAME             00010300
         B     IDLOOP                                                   00010400
         EJECT                                                          00010500
**********************************************************************  00010600
*                                                                       00010700
*        SUBROUTINE TO BRING IN PAIRS OF PAGES (PASS AREA=ITEM)         00010800
*              R2 POINTS TO DESIRED PAGE (1ST OF PAIR)                  00010900
*        RETURNS: IN R4 THE ADDRESS OF THE ORDERS PAGE                  00011000
*                 IN R5 THE ADDRESS OF THE DATA PAGE                    00011100
*                                                                       00011200
         DS    1F                  FOR RETURN ADDRESS                   00011300
GETITEM  ST    1,GETITEM-4         SAVE RETURN ADDRESS                  00011400
         L     3,=V(VFADD)       GET ADDR OF ADDR OF VERSION FILE       00011500
         L     3,0(3)           GET ADDR OF VERSION FILE                00011600
         A     3,0(3)        ADD  1ST WORD TO BASE TO GET END OF V F    00011700
         SH    3,=H'4'       GO BACK ONE WORD TO GET LAST PAGE          00011800
         L     15,0(3)                                                  00011900
         LA    15,0(15)                                                 00012000
         ST    15,LASTPAGE                                              00012100
         L     3,0(2)              LOAD PAGE NAME                       00012200
         LA    3,0(3)                                                   00012300
         CLC   1(3,2),LASTPAGE+1      CHECK IF THIS IS LAST PAGE IN VF  00012400
         BNE   *+8           IF IT ISN'T THEN CONTINUE                  00012500
         MVI   ENDFLAG,1               SET FLAG FOR LAST ID NAME        00012600
         ST    3,ITEM+4                PASS ID NAME FOR GETITEM         00012700
         SR    4,4                     ZERO MEANS RETRIEVE              00012800
         ST    4,ITEM                  PASS THIS ALSO TO GETITEM        00012900
GETCAP   LA    1,ITEM                  R1 POINTS TO MY PASS AREA        00013000
         L     15,=V(GETITEM)          GETITEM BRINGS ID INTO CORE      00013100
         BALR  14,15                                                    00013200
         LM    4,5,ITEM+12             GET ADDR OF ORDERS & DATA        00013300
         L     1,=V(OTYPE)                                              00013400
         MVC   4(4,1),0(4)                                              00013500
         LR    1,4                                                      00013600
         AH    1,10(1)                                                  00013700
         ST    1,CAPADDR                                                00013800
         L     1,GETITEM-4         RESTORE RETURN ADDRESS               00013900
         BR    1                   RETURN                               00014000
LASTPAGE DC    F'0'                                                     00014100
**********************************************************************  00014200
         EJECT                                                          00014300
NOOPLINK LA    4,12(4)       INCREMENT ORDERS INDEX                     00014400
         B     ORDERSLP                PROCESS NEXT ORDER               00014500
NOOP     LA    4,4(4)                  INCREMENT ORDERS INDEX           00014600
         B     ORDERSLP                                                 00014700
CHAR     LH    7,2(4)              GET LENGTH OF STRING                 00014800
         L     3,DATAADD               GET START OF DATA                00014900
         AH    3,4(4)                  ADD DISP OF ORDER                00015000
         BAL   1,SCAPIT             GOTO SUBROUTINE TO SINGLE CAP TEXT  00015100
LAB      LA    4,8(4)                  INCREMENT ORDERS INDEX           00015200
         B     ORDERSLP                                                 00015300
CHKCAP   CLI   1(4),1        IS IT A SINGLE CAP?                        00015400
         BE    TURNOFF                                                  00015500
         CLI   1(4),2        IS IT A MULTIPLE CAP?                      00015600
         BE    TURNOFF                                                  00015700
         CLI   1(4),27       2S IT A PARACAP?                           00015800
         BNE   NOOP                                                     00015900
TURNOFF  MVI   CAPFLAG,0     SET FLAG LOOKING FOR A . ! ?               00016000
         B     NOOP          BRANCH BACK                                00016100
        SPACE 3                                                         00016200
         SPACE 3                                                        00016300
SAVEFLGS DS    H                                                        00016400
SAVE24   DS    2F                                                       00016500
LINKFLAG DC    X'0'                    FLAG DESIGNATING IF IN LINK      00016600
         EJECT                                                          00016700
*********************************************************************** 00016800
*  THIS ROUTINE CAPITALIZES AFTER A . ! OR ?                            00016900
*  PASSED PARAMETERS:  R3 = ADDRESS OF THE DATA STRING TO BE SCANNED    00017000
*                      R4 = ADDRESS OF CURRENT ORDER                    00017100
*                      R7 = LENGTH OF DATA STRING                       00017200
*  FLAGS SET IN CAPFLAG:  00 = SCANNING FOR A . ! ?                     00017300
*                         01 = SCANNING FOR A NON-BLANK OTHER THAN ()'" 00017400
*                         02 = SCANNING FOR BLANK AND THEN NON-BLANK    00017500
SCAPIT   LTR   7,7           TEST INCOMING LENGTH                       00017600
         BCR   12,1          BRANCH BACK IF <= 0                        00017700
         STM   1,2,CAPSAV    STORE RETURN AND WORK REGISTERS            00017800
         LR    1,3           LOAD TRT REG. WITH DATA STARTING ADDR.     00017900
         ST    1,CINT        SAVE BEGINNING ADDRESS OF SCAN             00018000
CB7      CH    7,=H'256'     TEST FOR LENGTH > 256                      00018100
         BNH   CCHK7         NO, GO SET FLAG                            00018200
         SH    7,=H'256'     CALC. REMAINDER OF LENGTH                  00018300
         STH   7,CSAVE7      SAVE IT                                    00018400
         LH    7,=H'256'     TRT WITH LENGHT OF 256                     00018500
CGO      CLI   CAPFLAG,1     FLAG 1 ON?                                 00018600
         BE    CF1           YES, GO SCAN FOR A NON-BLANK               00018700
         CLI   CAPFLAG,2     NO, FLAG 2 ON?                             00018800
         BE    CGOON         YES, GO SCAN FOR BLANK AND THEN NON-BLANK  00018900
CBACK    LTR   7,7           TEST LENGTH OF STRING                      00019000
         BE    TEST7         IF ZERO NOW, GO FIND IF THROUGH            00019100
CAPLOOP  BCTR  7,0           IF NOT 0, DECREMENT FOR TRT                00019200
         MVI   CAPTRT1+1,0   ZERO LENGTH BYTE OF TRT                    00019300
         EX    7,CAPTRT1     EXECUTE TRT TO SCAN FOR . ! ?              00019400
         BC    8,CFLAG0      IF NO . ! ?, SET FLAG 0 = STILL LOOKING    00019500
         BC    2,CFLAG2      FOUND . ! ? AS LAST CHARACTER. SET FLAG    00019600
         S     1,CINT        FIND DISPLACEMENT FROM TOP OF STRING       00019700
         SR    7,1           CALC4LATE NEW LENGTH                       00019800
         A     1,CINT        RESTORE ADDRESS OF LAST BYTE SCANNED       00019900
         LA    1,1(1)        CALC. ADDR OF NEW STRING TO BE SCANNED     00020000
         ST    1,CINT        SA5E IT                                    00020100
CGOON    SR    2,2                                                      00020200
         IC    2,0(1)        GET CHARACTER TO RIGHT OF PERIOD           00020300
         A     2,=A(CAPTAB2) ADD DISP TO SECOND TRT                     00020400
         CLI   0(2),0        IS IT A BLANK " ' ( )                      00020500
         BNE   CBACK         NO# THEN FADE AND SCAN FOR . ! ? AGAIN     00020600
CF1      LTR   7,7           8ES# TEST NEW LENGTH                       00020700
         BE    TEST7         IF 0# SEE IF THROUGH WITH ENTIRE STRING    00020800
         BCTR  7,0           IF NOT, DECREMENT FOR TRT LENTGHT          00020900
         MVI   CAPTRT2+1,0   ZERO LENGTH BYTE OF TRT                    00021000
         SR    2,2           ZERO R2 FOR RETURN BYTE                    00021100
         EX    7,CAPTRT2     EXEC4TE TRT TO SCAN FOR NON-BLANK          00021200
         BC    8,CFLAG1      FO4ND NOTHING# SET FLAG STILL LOOKING      00021300
         S     1,CINT        S4CESS. CALC4LATE DISPLACEMENT             00021400
         SR    7,1           CALCULATE NEW LENGTH                       00021500
         A     1,CINT        RESTORE ADDRESS OF LAST BYTE FOUND         00021600
         ST    1,CINT        RESTORE TEMPORARY POINTER FOR NEW SCAN     00021700
         B     *(2)          R2=04 IF NON-ALPHA. =08 IF ALPHABETIC      00021800
         B     CAPLOOP+2     SCAN AGAIN IF NON-ALPHABETIC               00021900
         SR    1,3           CALC. DISPLACEMENT FROM TOP OF DATA STR.   00022000
         STH   1,CDISP       SAVE IT                                    00022100
         L     5,=V(OTYPE)   GET ADDRESS FORMAT BLOCK                   00022200
         MVI   3(5),X'A'     MOVE IN CODE FOR SINGLE CAP                00022300
         MVI   27(5),1       MOVE IN CODE FOR CHARACTER STRING          00022400
         S     4,CAPADDR     FIND DISPLACEMENT INTO ORDERS              00022500
         STH   4,10(5)       STORE DISP INTO FORMAT BLOCK               00022600
         STH   4,CSAVE4      SAVE DISP BECAUSE MODIFY MOVES PAGES       00022700
         MVC   14(2,5),CDISP MOVE IN DISPLACEMENT DOWN DATA PAGE        00022800
         L     15,=V(MODIFY) LOAD ADDR OF MODIFY                        00022900
         BALR  14,15         GO MODIFY ORDERS FOR SINGLE CAP            00023000
         LA    1,*+12        LOAD IN RETURN ADDRESS                     00023100
         ST    1,GETITEM-4   STORE RETURN TO FAKE OUT DAVE              00023200
         B     GETCAP        GO FIND ADDRESSES OF NEW PAGES             00023300
         AH    4,10(4)       FIND ADDRESS TO TO TOP OF ORDERS           00023400
         AH    4,CSAVE4      ADD DISP TO LAST ORDER JUST FINISHED       00023500
         CLI   0(4),X'0A'    IS IT SINGLE CAP?                          00023600
         BE    *+8                                                      00023700
         LA    4,8(4)        NO, INCREMENT OVER CHARACTER STRING        00023800
         LA    4,4(4)        INCREMENT OVER SINGLE CAP ORDER            00023900
         LH    7,2(4)        FIND LENGTH OF NEW STRING                  00024000
         AH    5,10(5)       FIND ADDRESS OF BEGINNING OF DATA          00024100
         ST    5,DATAADD     SAVE IT                                    00024200
         AH    5,4(4)        FIND ADDR. OF CURRENT DATA STRING          00024300
         LR    3,5           FAKE OUT SCAPIT ROUTINE                    00024400
         MVI   CAPFLAG,0     SET FLAG LOOKING FOR . ! ?                 00024500
         B     CB7-6         START ALL OVER AGAIN                       00024600
CFLAG2   MVI   CAPFLAG,2     SET FLAG LOOKING FOR BLANK AFTER . ! ?     00024700
         B     GOTEST        GO SEE IF READY TO QUIT                    00024800
CFLAG1   MVI   CAPFLAG,1     SET FLAG LOOKING FOR NON-BLANK             00024900
         B     GOTEST        GO SEE IF READY TO QUIT                    00025000
CFLAG0   MVI   CAPFLAG,0     SET FLAG LOOKING FOR . ! ?                 00025100
         AR    1,7           INCREMENT SCANNING ADDR. BY LENGTH OF STR. 00025200
GOTEST   LA    1,1(1)        INCREMENT FOR BEGINNING OF NEW DATA STR.   00025300
         ST    1,CINT        SAVE IT                                    00025400
TEST7    CLC   CSAVE7(2),=H'0'  ALL THROUGH SCANNING?                   00025500
         BE    RETCAP        YES? THEN RELOAD AND RETURN                00025600
         LH    7,CSAVE7      NO, LOADREMAINDER OF LENGTH                00025700
         B     CB7           AND START ALL OVER AGAIN                   00025800
RETCAP   LM    1,2,CAPSAV                                               00025900
         BR    1                                                        00026000
CCHK7    MVC   CSAVE7(2),=H'0'  SET LENGTH FLAG TO ZERO                 00026100
         B     CGO           GO BACK                                    00026200
CAPTRT1  TRT   0(0,1),CAPTAB1  TRT TO SCAN FOR . ! ?                    00026300
CAPTRT2  TRT   0(0,1),CAPTAB2  TRT TO SCAN FOR ALPHABETICS              00026400
CAPTAB1  EQU   *-64          TWO TRT TABLES FOLLOW                      00026500
         DC    370X'00'                                                 00026600
         ORG   CAPTAB1+C'.'                                             00026700
         DC    C'.'                                                     00026800
         ORG   CAPTAB1+C'?'                                             00026900
         DC    C'?'                                                     00027000
         ORG   CAPTAB1+C'!'                                             00027100
         DC    C'!'                                                     00027200
CAPTAB2  EQU   CAPTAB1+X'FA'-64                                         00027300
         ORG   CAPTAB1+X'FA'-64+C'¢'                                    00027400
         DC    3X'04'                                                   00027500
         DC    X'00'                                                    00027600
         DC    3X'04'                                                   00027700
         ORG   CAPTAB2+C'!'                                             00027800
         DC    3X'04',X'00',4X'04'                                      00027900
         ORG   CAPTAB2+C','                                             00028000
         DC    5X'04'                                                   00028100
         ORG   CAPTAB2+C':'                                             00028200
         DC    3X'04',X'00',X'04',X'00'                                 00028300
CDISP    DS    H                                                        00028400
CSAVE4   DS    H                                                        00028500
CSAVE7   DC    H'0'                                                     00028600
         DC    V(NORMAL)                                                00028700
         DC    V(CREATEID)                                              00028800
         DC    V(GETTAB)                                                00028900
         DC    V(BEGIN)                                                 00029000
CSAVE1   DS    F                                                        00029100
CAPADDR  DS    F                                                        00029200
CINT     DS    F                                                        00029300
CAPSAV   DS    2F                                                       00029400
CAPFLAG  DC    X'0'                                                     00029500
         ORG   CAPTAB2+C'A'                                             00029600
         DC    9X'08'                                                   00029700
         ORG   CAPTAB2+C'J'                                             00029800
         DC    9X'08'                                                   00029900
         ORG   CAPTAB2+C'S'                                             00030000
         DC    8X'08'                                                   00030100
         ORG   CAPTAB2+C'0'                                             00030200
         DC    10X'04'                                                  00030300
         EJECT                                                          00030400
RETURN   L     6,=V(IDTABLE)      TABLE OF INCORE PAGES                 00030500
         MVI   BLOCK+4,X'60'                                            00030600
         LA    1,BLOCK                                                  00030700
         CLI   0(6),X'FF'         TABLE COMPLETELU EMPTY ?              00030800
         BE    COMPDONE                                                 00030900
STORLOOP L     7,0(6)             PAGE NAME FROM IDTABLE                00031000
         L     9,4(6)             ORDERS PAGE ADDRESS                   00031100
         BAL   5,STORER           STORE ORDERS PAGE                     00031200
         L     9,8(6)             ADD OF DATA PAGE                      00031300
         LA    7,1(7)             NAME OF DATA PAGE                     00031400
         BAL   5,STORER           STORE DATA PAGE                       00031500
         MVI   0(6),X'FF'         SET EMPTY TABLE FLAG                  00031600
         TM    4(6),X'80'         END OF TABLE ?                        00031700
         BO    COMPDONE                IF IT OS, BRANCH                 00031800
         LA    6,12(6)            POINT AT NEXT TABLE ENRTY             00031900
         B     STORLOOP                                                 00032000
         SPACE 2                                                        00032100
STORER   C     7,0(9)             WAS RIGHT ADDRESS IN IDTABLE          00032200
         BNE   ABEND                IF HAVE WRONG PAGE, BOMB OUT        00032300
         ST    7,BLOCK            PAGE NAME INTO PARAM LIST FOR MARTY   00032400
         L     9,4(9)             LENTH OF PAGE(TAKEN FROM PAGEV HEADER 00032500
         STH   9,BLOCK+6          PUT LENTH TO STORE IN PARAM LIST      00032600
         MCALL MAINTAIN             CALL ROUTINR TO PASS PAGE OUT OF CO 00032700
         BR    5                  RETURN                                00032800
         EJECT                                                          00032900
COMPDONE SR    5,5                NAME OF VERSION FILE                  00033000
         ST    5,BLOCK            PUT INTO PARAM LIST                   00033100
         L     6,=V(VFADD)        ADD OF ADDD OF VF                     00033200
         L     6,0(6)             R6 POINTS TO TOP OF VF                00033300
         L     7,0(6)             LENTH OF VF                           00033400
*        R6  => TOP OF VF                                               00033500
*        (R7)  = LENTH OF VF                                            00033600
         LA    5,4(7)             VF LENTH + 4 FOR COUNTER STORE        00033700
         STH   5,BLOCK+6          PUT LENTH TO STORE IN PARAM LIST      00033800
         L     5,=V(COUNTER)      ADD OF SYSTEM LABEL GENERATOR         00033900
         L     5,0(5)             GET ACTUAL COUNTER                    00034000
         ST    5,0(6,7)           PUT COUNTER AT END OF VF              00034100
         MCALL MAINTAIN                                                 00034200
         L     6,=V(LABTABAD)     ADD OF ADD OF LABEL TABLE             00034300
         L     6,0(6)             ADD OF LABEL TABLE                    00034400
         LTR   6,6                IF ADD = 0, THEN LABEL TABLE ON       00034500
         BE    DONE                                                     00034600
         L     6,0(6)             GET LENTH OF LABEL TABLE              00034700
         STH   6,BLOCK+6          PUT LENTH TO STORE IN PARAM LIST      00034800
         OI    BLOCK+3,X'01'     LABEL TABLE NAME= 0000001              00034900
         MCALL MAINTAIN                STORE LABEL TABLE                00035000
DONE     SR    1,1                                                      00035100
         CALL  END                                                      00035200
         B     CANCEL                                                   00035300
ABEND    ABEND 1,DUMP                                                   00035400
BLOCK    DC    5F'0'                                                    00035500
FRSTPAGE DC    F'2'                                                     00035600
         DC    2F'0'                                                    00035700
         EJECT                                                          00035800
CANCEL   POST  MAINLINE                                                 00035900
WAITAGN  L     13,4(13)                                                 00036000
         RETURN (14,12)                                                 00036100
         EJECT                                                          00036200
         EJECT                                                          00036300
         GINIT                                                          00036400
REQMESS  GSRT                                                           00036500
         GEVM                                                           00036600
         GDV   10,3200,B                                                00036700
         GECP  B                                                        00036800
         GTXT  'TYPE IN THE NAME OF THE DATA SET TO BE CAPITALIZED:'    00036900
         GCNL  3                                                        00037000
         GECF  L                                                        00037100
NAME     DC    CL44'SYS1.P1518.AVD.'                                    00037200
         GECP  B                                                        00037300
BACK     GTRU  0                                                        00037400
WHNAME   DC    AL2(NAME-REQMESS)                                        00037500
CURSADD  DS    H                                                        00037600
MAINLINE DC    F'0'                                                     00037700
COMAREA  DC    4F'0'                                                    00037800
ZERO     EQU   BACK+2                                                   00037900
BUFLEN   DC    H'8192'                                                  00038000
SAVERC   DC    2F'0'                                                    00038100
DSNAME   DC    CL44' '                                                  00038200
LENGTH   DC    H'0'                                                     00038300
         LTORG                                                          00038400
         EJECT                                                          00038500
GDCB     DCB   DSORG=GS,MACRF=(WC,RC),GTYPE=BASIC,DDNAME=SCOPE          00038600
GACB     SAEC  DCB=GDCB,EP=ATTNROUT,COMAREA=COMAREA,                   X00038700
               ATTNTYP=(END,CANCEL),PFKMSK=(0)                          00038800
         END   CAPIT                                                    00038900
