:READ  CREATE   ASSEMBLE C1 WORK    3/26/19  21:59
         LCLC  &DISK                                                    00000100
&DISK    SETC  '2311'                                                   00000200
&DISK    SETC  '2314'                                                   00000300
CREATE   ENTER                                                          00000400
         L     1,0(1)              POINTER TO PARM LIST                 00000500
         LA    2,8                 LENTH OF PARMFIEL                    00000600
         LH    3,0(1)              LENGTH OF PARM FIELD                 00000700
         LTR   3,3                 IF NO PARM, GIVE DEFAULT VALUE       00000800
         BE    DEFAULT                                                  00000900
         SR    2,3                                                      00001000
         LA    2,PARMFIEL(2)                                            00001100
         BCTR  3,0                                                      00001200
         EX    3,MOVEPARM                                               00001300
         NI    PARMFIEL+7,X'CF'       SET SIGN BIT                      00001400
         PACK  NUMWRITE+3(5),PARMFIEL+4(4)                              00001500
         CVB   5,NUMWRITE                                               00001600
         LTR   5,5                                                      00001700
         BE    DONE                                                     00001800
OPEN     OPEN  (DCB,(OUTPUT))                                           00001900
WRITE    WRITE OUT,SF,DCB,NODE                                          00002000
         CHECK OUT                                                      00002100
         BCT   5,WRITE                                                  00002200
DONE     CLOSE (DCB)                                                    00002300
         L     13,4(13)                                                 00002400
         RETURN (14,12)                                                 00002500
MOVEPARM MVC   0(0,2),2(1)                                              00002600
DEFAULT  LA    5,260               DEFAULT VALUE                        00002700
         B     OPEN                                                     00002800
NUMWRITE DC    D'0'                                                     00002900
PARMFIEL DC    8X'F0'                                                   00003000
         AIF   ('&DISK' EQ '2311').DCB2311                              00003100
DCB      DCB   DDNAME=CREFILE,DSORG=PS,LRECL=7200,BLKSIZE=7200,        X00003200
               DEVD=DA,MACRF=(W),RECFM=F                                00003300
         AGO   .OUT                                                     00003400
.DCB2311 ANOP                                                           00003500
DCB      DCB   DDNAME=CREFILE,DSORG=PS,LRECL=3600,BLKSIZE=3600,        X00003600
               DEVD=DA,MACRF=(W),RECFM=F                                00003700
.OUT     ANOP                                                           00003800
NODE     DC    F'-1'                                                    00003900
         DC    221F'0'                                                  00004000
         DC    X'FF010000'                                              00004100
         DC    2F'0'                                                    00004200
NXT      DC    X'00010100'                                              00004300
MAX      DC    H'400',H'0'                                              00004400
         DC    100F'0'                                                  00004500
         END   CREATE                                                   00004600
