:READ  GETTAB   ASSEMBLE C1 WORK    3/26/19  21:59
*********************************************************************** 00000100
*                                                                     * 00000200
*        THIS IS A GENERAL PUROPSE ROUTINE FOR GETTING THE ADDRESS    * 00000300
*              OF THE LABEL TABLE.  IT TAKES AS INPUT IN R1 THE       * 00000400
*              INCREMENT YOU WISHED ADDED TO THE LENTH OF THE LABEL   * 00000500
*              TABLE.  IT RETURNS IN R1 THE ADDRESS OF THE TOP OF THE * 00000600
*              LABEL TABLE.                                           * 00000700
*                                                                     * 00000800
*********************************************************************** 00000900
         SPACE 2                                                        00001000
GETTAB   CSECT                                                          00001100
         USING *,15               ESTABLISH ADDRESSABILITY              00001200
         ST    14,RETADD          SAVE ADDRESS TO RETURN TO             00001300
         L     14,LABTABAD      SEE IF LABEL TABLE HAS BEEN             00001400
         LTR   14,14            BROUGHT IN                              00001500
         BE    FIRST            ITS ADD = 0, SO NOT IN CORE             00001600
         LTR   1,1                IF INCREMENT = 0,                     00001700
         BE    NOINCR             BOTHER CALLING MAINTAIN               00001800
FIRST    ST    1,BLOCK+12       PUT REQUESTED INCR IN PARAM LIST        00001900
         LA    1,BLOCK            R1 => PARAM LIST                      00002000
         L     15,PAGER           LOAD ADDRESS TO ROUTINE MOVE PABE     00002100
         BALR  14,15              LINK TO IT                            00002200
NOINCR   BALR  1,0                HAVE CLOBBERED PREVIOUS BASE REG      00002300
         USING *,1                SET UP NEW BASE REGISTER              00002400
         L     14,RETADD          LOAD ADDRESS TO RETURN TO             00002500
         L     1,LABTABAD         LOAD RETURN PARAM (ADDR OF LAB TAB    00002600
         BR    14                 RETURN TO VALLING PROG                00002700
BLOCK    DC    F'1',X'4000',5H'0' PARAM LIST FOR MAINTAIN               00002800
LABTABAD EQU   BLOCK+8            LABTABAD USED BU OTHER PEOPLE         00002900
PAGER    DC    V(MAINTAIN)                                              00003000
RETADD   DS    F                  WHERE RETURN ADDRESS SAVED            00003100
         ENTRY LABTABAD           SO OTHERS CAN REFERENCE               00003200
         END                                                            00003300
