:READ  INDEX    ASSEMBLE C1 WORK    3/26/19  21:59
INDEX    CSECT                                                          00000100
         DC    CL12'BEGIN',V(BEGIN)                                     00000200
         DC    CL12'BUFFERA',V(BUFFERA)                                 00000300
         DC    CL12'COMAREA',V(COMAREA)                                 00000400
         DC    CL12'COUNTER',V(COUNTER)                                 00000500
         DC    CL12'CREATEID',V(CREATEID)                               00000600
         DC    CL12'DATA',V(DATA)                                       00000700
         DC    CL12'DELETE',V(DELETE)                                   00000800
         DC    CL12'DISPLAY',V(DISPLAY)                                 00000900
         DC    CL12'DISPLMAP',V(DISPLMAP)                               00001000
         DC    CL12'END',V(END)                                         00001100
         DC    CL12'FLAGWORD',V(FLAGWORD)                               00001200
         DC    CL12'GACB',V(GACB)                                       00001300
         DC    CL12'GDCB',V(GDCB)                                       00001400
         DC    CL12'GETID',V(GETID)                                     00001500
         DC    CL12'GETITEM',V(GETITEM)                                 00001600
         DC    CL12'GETTAB',V(GETTAB)                                   00001700
         DC    CL12'IDTABLE',V(IDTABLE)                                 00001800
         DC    CL12'INIT',V(INIT)                                       00001900
         DC    CL12'LABEL',V(LABEL)                                     00002000
         DC    CL12'LABTABAD',V(LABTABAD)                               00002100
         DC    CL12'LINTBL',V(LINTBL)                                   00002200
         DC    CL12'MAINTAIN',V(MAINTAIN)                               00002300
         DC    CL12'MODIFY',V(MODIFY)                                   00002400
         DC    CL12'NEWBLOB',V(NEWBLOB)                                 00002500
         DC    CL12'NORMAL',V(NORMAL)                                   00002600
         DC    CL12'NXTHOLE',V(NXTHOLE)                                 00002700
         DC    CL12'OLABEL',V(OLABEL)                                   00002800
         DC    CL12'OPOINT',V(OPOINT)                                   00002900
         DC    CL12'OPOINT1',V(OPOINT1)                                 00003000
         DC    CL12'OPOINT2',V(OPOINT2)                                 00003100
         DC    CL12'ORDERS',V(ORDERS)                                   00003200
         DC    CL12'OSTRING',V(OSTRING)                                 00003300
         DC    CL12'OTYPE',V(OTYPE)                                     00003400
         DC    CL12'PASS2',V(PASS2)                                     00003500
         DC    CL12'POINT',V(POINT)                                     00003600
         DC    CL12'PRINTER',V(PRINTER)                                 00003700
         DC    CL12'PSW',V(PSW)                                         00003800
         DC    CL12'SCANNER',V(SCANNER)                                 00003900
         DC    CL12'SCRLBACK',V(SCRLBACK)                               00004000
         DC    CL12'SCROLLL',V(SCROLLL)                                 00004100
         DC    CL12'SCROLLP',V(SCROLLP)                                 00004200
         DC    CL12'SCRUNCH',V(SCRUNCH)                                 00004300
         DC    CL12'SPACEORD',V(SPACEORD)                               00004400
         DC    CL12'SWAPOUT',V(SWAPOUT)                                 00004500
         DC    CL12'TABPNT',V(TABPNT)                                   00004600
         DC    CL12'TAGAREA',V(TAGAREA)                                 00004700
         DC    CL12'TAGBACK',V(TAGBACK)                                 00004800
         DC    CL12'TAGFOR',V(TAGFOR)                                   00004900
         DC    CL12'TOPNODE',V(TOPNODE)                                 00005000
         DC    CL12'TXT360',V(TXT360)                                   00005100
         DC    CL12'TXT360BM',V(TXT360BM)                               00005200
         DC    CL12'TYPE',V(TYPE)                                       00005300
         DC    CL12'VFADD',V(VFADD)                                     00005400
         END                                                            00005500
