:READ  MAINTAIN ASSEMBLE C1 WORK    3/26/19  22:00
         LCLC  &CONF                                                    00000100
         LCLA  &BKSIZE                                                  00000200
&BKSIZE  SETA  3600               TRACK LENTH ON 2311'S                 00000300
&BKSIZE  SETA  7200               TRACK LENTH ON 2314'S                 00000400
&CONF    SETC  'MVT'         FAQ DOES NOT CONTAIN ZERO LINK AT END      00000500
&CONF    SETC  'MFT'       FAQ HAS ZERO LINK AT END                     00000600
MAINTAIN ENTER                                                          00000700
         LR    2,1                SET INPUT ADDR                        00000800
         LA    4,TOPNODE          LOAD NODE ADDR                        00000900
MORE     SR    6,6                                                      00001000
         MVI   5(2),0              CLEAR END OF NODE BIT                00001100
         IC    6,NUMQ-L+1(4)      LOAD NODE COUNT                       00001200
         MH    6,=AL2(L)          IN BYTES                              00001300
         CLI   NUMQ-L(4),X'FF'    LEVEL FULL?                           00001400
         BE    *+12                    SET "LELEL FULL"                 00001500
         MVI   5(2),X'80'                                               00001600
         LA    6,NUMQ             LOAD NODE LENGTH                      00001700
         LR    8,4                SAVE SUBBLOCK HEAD ADDR               00001800
         LA    12,0(8,6)          SAVE CURRENT END ADDR                 00001900
         L     3,0(2)                                                   00002000
         CL    3,0(4)             ITEM ON TOP?                          00002100
         BL    TOP                IF YES,BRANCH                         00002200
PARE     C     6,=A(L)            LEN OK?                               00002300
         BH    *+10               IF YES SKIP                           00002400
         BL    INSERT             IF 0,DONE                             00002500
         SR    6,6                IF =,SET FOR LAST MATCH               00002600
         SRDL  6,3                SET ADJUSTMENT BIT                    00002700
         SLL   6,2                DIV. BY 2                             00002800
         LTR   7,7                ADJUST AS NEEDED                      00002900
         BNL   *+8                                                      00003000
         S     6,=A(V)                                                  00003100
         C     3,0(4,6)           COMPARE                               00003200
         BL    PARE               TAKE TOP HALF                         00003300
         BE    SAME               MATCH                                 00003400
         AR    4,6                TAKE BOTTOM HALF                      00003500
         LTR   7,7                                                      00003600
         BNL   PARE                                                     00003700
         LA    6,L(6)                                                   00003800
         B     PARE                                                     00003900
INSERT   CL    3,0(4)             ABOVE OR BELOW?                       00004000
         BL    TOP                ABOVE                                 00004100
         LA    4,L(4)                                                   00004200
TOP      LA    1,NUMQ(8)                                                00004300
         CR    1,4                IF PAST NODE END,                     00004400
         BH    *+8                     BACK UP ONE                      00004500
         S     4,=A(L)            ITEM                                  00004600
         CR    4,12                    END OF CURRENT LEN CHECK         00004700
         BL    *+8      IF YES,PROTECT DELETE AND BRANCH FIELDS         00004800
         STM   12,13,4(4)                                               00004900
HERE     CLC   6(2,4),=H'-1'      BRANCH POINT?                         00005000
         BE    YESSIR             IF YES,BRANCH                         00005100
HERE1    TM    4(2),X'40'         RETRIEVE?                             00005200
         BO    ERR1               IF YES, EXIT FAILURE                  00005300
         CLC   8(4,4),=F'0'       PREVIOUSLY DELETED?                   00005400
         BE    SETUP              IF YES, BRANCH DIRECTLY TO SETUP      00005500
         CLI   5(2),X'80'         ELSE, OPEN UP SPACE OR EST. BRANCH    00005600
         BE    ESTBRNCH           IF NO SPACE,ESTABLISH BRANCH          00005700
* R12 HAS CURRENT END ADDR.                                             00005800
SLIMR    S     12,=F'256'                                               00005900
         CR    12,4                                                     00006000
         BNL   NOTLAST                                                  00006100
         LA    12,256(12)                                               00006200
         SR    12,4               CALC. LAST MOVE COUNT                 00006300
         BE    SETUPA                                                   00006400
         BCTR  12,0                                                     00006500
         EX    12,MOUT                                                  00006600
         EX    12,MIN                                                   00006700
SETUPA   IC    6,NUMQ-L+1(8)                                            00006800
         LA    6,1(6)             INCRM AND RESET COUNT                 00006900
         STC   6,NUMQ-L+1(8)                                            00007000
SETUP    ST    3,0(4)             SET NAME                              00007100
         MVC   GETLOC+6(2),6(2)        SET DESIRED COUNT                00007200
         MVC   8(4,4),=F'0'    SET DELETED IN CASE OF RETRY             00007300
         BAL   11,GETLOC                                                00007400
         MVC   8(4,2),GETM        SET AREA                              00007500
         MVC   6(6,4),6(2)        SET LEN,CORE ADDR.                    00007600
         STH   15,4(4)         ZERO FLAG=IN CORE                        00007700
OUT      BAL   11,WRITE                                                 00007800
         AIF   ('&CONF' EQ 'MVT').MVT1  SHOULD LOOK AT FAQ ?            00007900
         L     1,TCBMSS                R1 POINTS TO BOUNDARY BOX        00008000
         LA    4,2000           LENTH TO FIND CONTIG IN FAQ             00008100
LENLOOP  L     1,0(1)   R1 POINTS TO NEXT ENTRY IN FAQ                  00008200
         C     4,4(1)       LENTH WANTED VS LEN OF THIS ELEMENT         00008300
         BNL   NORMOUT-2   BRANCH IF THERE IS ENOGH SPACE IN FAQ        00008400
         LTR   1,1                     IR R1 = 0, THEN THIS IS LAST     00008500
         BNE   LENLOOP    ENTRY IN FAQ(THERE WASN'T ENUF SPACE)         00008600
         O     4,=X'80000000'   SO SWAPOUT WON'T WRITE OUT DATA PAGE    00008700
         L     3,4(13)                 SAVE HSA ADDRESS                 00008800
         L     15,=V(SWAPOUT)                                           00008900
         BALR  14,15                                                    00009000
         ST    3,4(13)                 RESTORE HSA                      00009100
         B     OUT+4      GO SEARCH G  FAQ AGAIN                        00009200
.MVT1    SR    15,15            RETURN CODE = SUCCESS                   00009300
NORMOUT  L     13,4(13)                                                 00009400
         ST    15,16(13)                                                00009500
         LM    14,12,12(13)                                             00009600
         BR    14                                                       00009700
NOTLAST  MVC   SWAT(256),0(12)                                          00009800
         MVC   L(256,12),SWAT                                           00009900
         B     SLIMR                                                    00010000
MOUT     MVC   SWAT(0),0(4)                                             00010100
MIN      MVC   L(0,4),SWAT                                              00010200
ERR1     LA    15,4                                                     00010300
         B     NORMOUT                                                  00010400
SAME     AR    4,6                                                      00010500
         CLC   6(2,4),=H'-1'       BRANCH POINT?                        00010600
         BE    YESSIR             IF YES, BRANCH                        00010700
         CLC   8(4,4),=F'0'                                             00010800
         BE    HERE1                                                    00010900
         TM    4(2),X'80'         CREATE?                               00011000
         BO    ERR1               IF YES, EXIT ERROR                    00011100
         TM    4(2),X'20'         STOSPACE?                             00011200
         BO    STORE                                                    00011300
         TM    4(2),X'10'      DELETE?                                  00011400
         BO    DELETE                                                   00011500
         CLC   4(2,4),=H'0'       MERELY RETRIEVE                       00011600
         BE    INCORE          ITEM STILL IN CORE                       00011700
ONDISK   LH    12,6(4)         LOAD LEN FROM TREE                       00011800
         A     12,12(2)        ADD INCRM FROM INPUT                     00011900
         ST    12,GETLOC+4     SET LEN                                  00012000
         LA    11,GOTEN                                                 00012100
GETLOC   GETMAIN EC,LV=BYTES,A=GETM                                     00012200
         LTR   15,15                                                    00012300
         BE    OK1                                                      00012400
         L     3,4(13)   SAVE LSA                                       00012500
         L     4,GETLOC+4    PASS NEEDED LENGTH                         00012600
         L     15,=V(SWAPOUT)                                           00012700
         BALR  14,15                                                    00012800
         ST    3,4(13)     RESET LSA                                    00012900
         B     MORE-4          RETRY ORIG CALL                          00013000
OK1      BR    11                                                       00013100
GOTEN    STH   15,4(4)          SET RETSET FLAG=0=IN CORE               00013200
         LM    6,7,4(4)        LOAD OLD LEN,TTRN                        00013300
         L     3,GETM                                                   00013400
         ST    3,8(4)             RESET TREE POINTER                    00013500
         ST    3,8(2)          PASS ADDR TO INPUT                       00013600
         STH   12,6(2)         SET NEW LEN IN INPUT                     00013700
         STH   12,6(4)         RESET TREE LEN                           00013800
         BAL   11,WRITE                                                 00013900
         LR    5,7                                                      00014000
         LR    8,7                                                      00014100
         LR    7,6                                                      00014200
         BAL   1,CNTP                                                   00014300
         MH    7,=AL2(BENT)                                             00014400
         L     15,=V(DELBLOB)          RETURN TRACK TO AVS              00014500
         BALR  14,15                                                    00014600
         LR    6,5                                                      00014700
         IC    5,=X'00'                                                 00014800
         BAL   11,READ                                                  00014900
         N     6,=F'255'                                                00015000
         MH    6,=AL2(BYTES/N)                                          00015100
         LA    4,SWAP(6)          CALC, A(SUBHEAD)                      00015200
         BAL   11,MOVER           MOVE INTO FREE AREA                   00015300
         B     OUT+4                   CHECK FAQ AND EXIT               00015400
ESTBRNCH LA    1,N                GET WHOLE PAGE                        00015500
         L     15,=V(NEWBLOB)                                           00015600
         BALR  14,15                                                    00015700
         MVC   SWAT(12),0(4)                                            00015800
         ST    1,8(4)             SET BR. TTRN                          00015900
         LR    10,1                                                     00016000
         MVC   6(2,4),=H'-1'      SET FLAG                              00016100
         C     3,0(4)              TEST IF NEW LOW                      00016200
         BNH   *+8                 IF OK BLANCH                         00016300
         ST    3,0(4)              IF NO, RESET OLD ITEM                00016400
         BAL   11,WRITE           WRITE OLD TREE NODE                   00016500
         LR    5,10                                                     00016600
         BAL   11,READ            READ NEWNODE                          00016700
         AIF   ('&BKSIZE' EQ '7200').A2314                              00016800
         LA    8,8(10)            GET WHERRE ON TRACK TO FREE           00016900
         LA    7,24*BENT          HOW MUCH TO FREE                      00017000
         AGO   .A2311                                                   00017100
.A2314   LA    8,4(10)            FREE BOTTOM OF TRACK                  00017200
         LA    7,28*BENT          FREE 7/8 OF TRACK                     00017300
.A2311   L     15,=V(NEWBLOB)     ROUTINE TO RETURN TO FREE SPACE       00017400
         BALR  14,15                                                    00017500
         LA    4,SWAP             NODE AT TOP OF PAGE                   00017600
         MVC   NUMQ-L(2,4),=X'FF02'                                     00017700
         C     3,SWAT                                                   00017800
         BNH   SWO                                                      00017900
         MVC   0(12,4),SWAT                                             00018000
         LA    4,12(4)                                                  00018100
         B     SETUP                                                    00018200
SWO      MVC   12(12,4),SWAT           SET OLD ITEM                     00018300
         B     SETUP                                                    00018400
YESSIR   L     5,8(4)             LOAD TTRN                             00018500
         BAL   11,READ                                                  00018600
         LA    4,SWAP                                                   00018700
         B     MORE                                                     00018800
READ     ST    5,SWAT+12          STORE TTR OF TRACK TO BE READ         00018900
         L     12,=V(HYPRTEXT)     ADDR OF DCB                          00019000
         POINT (12),SWAT+12       SET TO READ RIGHT TRACK               00019100
         READ  READIN,SF,HYPRTEXT,SWAP                                  00019200
         CHECK READIN                                                   00019300
         BR    11                                                       00019400
WRITE    L     12,=V(HYPRTEXT)                                          00019500
         C     8,=A(TOPNODE)                                            00019600
         BCR   8,11          IF TOP NODE , SKIP WRITE                   00019700
         ST    5,SWAT+12          STORE TTR OF TRACK TO BE READ         00019800
         POINT (12),SWAT+12       SET UP TO WRITE IN RIGHT PLACE IN DS  00019900
         WRITE WRITEOUT,SF,HYPRTEXT,SWAP                                00020000
         CHECK WRITEOUT                                                 00020100
         BR    11                                                       00020200
CNTP     SR    6,6                                                      00020300
         D     6,=A(BYTES/N)                                            00020400
         LTR   6,6                                                      00020500
         BE    *+8                                                      00020600
         LA    7,1(7)                                                   00020700
         BR    1                                                        00020800
GETM     DC    F'0'                                                     00020900
INCORE   LH    10,6(4)         LOAD OLD LEN FROM TREE                   00021000
         A     10,12(2)        ADD INCRM FROM INPUT                     00021100
         CH    10,6(4)   TEST ZERO INCRM                                00021200
         BNE   MUSTMOVE                                                 00021300
         MVC   6(6,2),6(4)    SET LEN,ADDR                              00021400
         B     OUT+4                                                    00021500
MUSTMOVE ST 10,GETLOC+4                                                 00021600
         MVC   FREE+6(2),6(4)  SET FREEMAIN LEN FROM TREE               00021700
         STH   10,6(2)         SET NEW LEN IN INPUT                     00021800
         BAL   11,GETLOC                                                00021900
         STH   10,6(4)            SET NEW LENGTH                        00022000
         L     10,8(4)            LOAD OLD ADDR                         00022100
         L     3,GETM                                                   00022200
         ST    3,8(4)             SET NEW IN CORE ADDR                  00022300
         ST    3,8(2)   SET CORE ADDR IN INPUT AREA                     00022400
         LR    4,10                                                     00022500
         BAL   11,MOVER                                                 00022600
         B     FREE                                                     00022700
DELETE   CLC   4(2,4),=H'0'                                             00022800
         BE    DINCORE                                                  00022900
         LR    9,8                ON DISK:DELBLOB,ZAP,REWRITE           00023000
         L     8,8(4)             LOAD TTRN                             00023100
         LH    7,6(4)                                                   00023200
         BAL   1,CNTP             SET LEN                               00023300
         MH    7,=AL2(BENT)                                             00023400
         L     15,=V(DELBLOB)                                           00023500
         BALR  14,15                                                    00023600
         LR    8,9                                                      00023700
         XC    6(6,4),6(4)                                              00023800
         B     OUT                                                      00023900
DINCORE  L     10,8(4)         FREEMAIN AND REWRITE                     00024000
         LH    9,6(4)                                                   00024100
         XC    6(6,4),6(4)     ZAP                                      00024200
         ST    9,FREE+4                                                 00024300
FREE     FREEMAIN R,LV=BYTES,A=(10)                                     00024400
         B     OUT                                                      00024500
MOVER    LH    14,6(2)            LOAD COUNT                            00024600
         CLC   0(4,2),=F'0'     TTTTTTTTTTTTTTTTTT                      00024700
         BE    ARND             TTTTTTTTTTTTT                           00024800
         CLC   0(4,2),=F'1'     TTTTTTTTTTTTT                           00024900
         BE    ARND             TTTTTTTTTTTTT                           00025000
         CLC   0(4,2),0(4)      TTTTTTTTTTTTT                           00025100
         BNE   BOMBIT           TTTTTTTTTTTTT                           00025200
ARND     EQU   *                TTTTTTTTTTTTT                           00025300
         S     14,=F'256'                                               00025400
         BNL   OOZE                                                     00025500
         A     14,=F'256'                                               00025600
         BCR   8,11                                                     00025700
         BCTR  14,0                                                     00025800
         EX    14,MOVEIT                                                00025900
         BR    11                                                       00026000
OOZE     MVC   0(256,3),0(4)                                            00026100
         LA    3,256(3)                                                 00026200
         LA    4,256(4)                                                 00026300
         B     ARND             TTTTTTTT B     MOVER+4                  00026400
BOMBIT   ABEND 69,DUMP          TTTTTTTTTTTTTTTTTTT                     00026500
* TO R3 FROM R4,LEN IN 6(2)                                             00026600
MOVEIT   MVC   0(0,3),0(4)                                              00026700
STORE    LH    7,6(2)          LOAD NEW COUNT                           00026800
         CH    7,BLKSIZE        STORING TOO MUCH                        00026900
         BH    BOMBIT              BOMB IF STORING PAGE TOO BIG         00027000
         MVC   FREE+6(2),6(4)  SET OLD COUNT FOR FREEMAIN               00027100
         STH   7,6(4)          RESET TREE COUNT                         00027200
         BAL   1,CNTP             GET SUBBLOCK CNT                      00027300
         MVI   4(4),X'80'         SET DISK FLAG                         00027400
         LR    1,7                                                      00027500
         L     15,=V(NEWBLOB)                                           00027600
         BALR  14,15                                                    00027700
         L     10,8(4)         LOAD CORE ADDR                           00027800
         ST    1,8(4)             SET TTRN                              00027900
         LR    6,1                                                      00028000
         BAL   11,WRITE           WRITE TREE NODE                       00028100
         ST    6,8(2)          SET TTRM                                 00028200
         LR     5,6                                                     00028300
         IC    5,=X'00'                                                 00028400
         BAL   11,READ            READ IN NEW BLOCK                     00028500
         N     6,=F'255'                                                00028600
         MH    6,=AL2(BYTES/N)                                          00028700
         LA    3,SWAP(6)         FORM A(SUBHEAD)                        00028800
         LR    4,10            SET CORE ADDR                            00028900
         BAL   11,MOVER           MOVE ITEM FROM AREA TO BLOCK          00029000
         LA    8,1             SET NOT TOP NODE                         00029100
         B     FREE                                                     00029200
BLKSIZE  DC    AL2(BYTES)         NUM OF BYTES ON A TRACK               00029300
         LTORG                                                          00029400
         ENTRY SWAP                                                     00029500
         ENTRY TOPNODE                                                  00029600
         ENTRY  BLKSIZE,TCBMSS                                          00029700
TCBMSS   DC    F'0'                                                     00029800
TOPNODE  DS    225F                                                     00029900
SWAT     DS    64F                                                      00030000
SWAP  DS   &BKSIZE.X                                                    00030100
         EJECT                                                          00030200
NEWBLOB  CSECT                                                          00030300
         USING *,15                                                     00030400
         B     *+12                BRANCH AROUND IDENTIFIER             00030500
         DC    CL8'NEWBLOB'        IDENTIFIER                           00030600
         STM   14,12,12(13)                                             00030700
         LH    2,MAX+2                 LOAD CURR LEN                    00030800
         LA    4,MAX-4                 LOAD ADDR AVS                    00030900
TRICK    LTR   2,2                     AVS NULL                         00031000
         BE    WHOLE                   IF YES,BRANCH                    00031100
         SR    6,6                                                      00031200
         L     7,4(2,4)                LOAD MASK OF LAST ENTRY          00031300
         LR    5,1                     SET COUNT WANTED                 00031400
         LA    0,N                     LOAD TOTAL NO. SUBSD             00031500
SLIDE SLDL     6,1                     MOVE IN BIT                      00031600
         BCTR  0,0                     DECRM TATAL COUNT                00031700
         LTR   6,6                     SUB FREE?                        00031800
         BNE   WANT                    IF YES,BRANCH                    00031900
         LTR   0,0                     IF NO, TEST ENTRY FINISHED       00032000
         BNH   NEXTONE                 IF YES, BRANCH                   00032100
         LR    5,1                     IF NO, RESET WANTED COUNT        00032200
         B     SLIDE                                                    00032300
WANT     BCTR  6,0                     IF SUB FREE, ZERO R6             00032400
         BCT   5,SLIDE                 DECRM WANTED COUNT               00032500
         LR    5,1                                                      00032600
BACK     SR    7,7                                                      00032700
BACKA    LA    6,1(6)                                                   00032800
         SRDL  6,1                     SET UP INVERSE MASK              00032900
         BCT   5,BACKA                                                  00033000
         LA    5,N                                                      00033100
         SR    5,1                                                      00033200
         SR    5,0                                                      00033300
         LR    0,5                                                      00033400
         BE    OMIT                                                     00033500
SRL      SRL   7,1                                                      00033600
         BCT   5,SRL                                                    00033700
OMIT     X     7,4(2,4)                                                 00033800
         ST    7,4(2,4)                RESET ENTRY                      00033900
         L     1,0(2,4)                LOAD TTR0                        00034000
         BE    RED                     IF NOW NULL, COMPACT LIST        00034100
OUT2     OR    1,0                     FORM TTRN                        00034200
OUTR     EQU   *                                                        00034300
         ST    1,24(13)                                                 00034400
         LM    14,12,12(13)                                             00034500
         BR    14                                                       00034600
NEXTONE  S     2,=F'8'                                                  00034700
         B     TRICK                                                    00034800
WHOLE    LR    5,1                                                      00034900
         L     1,NXTHOLE                                                00035000
         LR    6,1                                                      00035100
         CLI   NXTHOLE+2,NUM                                            00035200
         BL    *+8                                                      00035300
         A     6,=X'0000FF00'                                           00035400
         A     6,=F'256'       *******TEMP FOR NSF MONSTER******        00035500
         ST    6,NXTHOLE                                                00035600
         CH    5,=AL2(N)                                                00035700
         BNL   OUTR                                                     00035800
         LH    2,MAX+2                                                  00035900
         CH    2,MAX                                                    00036000
         BNL   *+8                                                      00036100
         LA    2,8(2)                                                   00036200
         ST    1,0(4,2)                                                 00036300
         L     6,=F'-1'                                                 00036400
SLL      SRL   6,1                                                      00036500
         BCT   5,SLL                                                    00036600
         ST    6,4(4,2)                                                 00036700
         STH   2,MAX+2             RESET CURRENT                        00036800
         B     OUTR                                                     00036900
RED      CH    2,MAX+2                                                  00037000
         BL    UPBACK                                                   00037100
         S     2,=F'8'                                                  00037200
         STH   2,MAX+2                                                  00037300
         B     OUT2                                                     00037400
UPBACK   LA    5,0(2,4)                                                 00037500
         MVC   0(8,5),8(5)                                              00037600
         LA    2,8(2)                                                   00037700
         B     RED                                                      00037800
         LTORG                                                          00037900
DEBLOB   N     7,=X'0000FFFF'                                           00038000
         LR    0,7                                                      00038100
         SRDL  0,32                                                     00038200
         D     0,=A(BENT)              DIV BY NUMBR OF ITEMS IN SUBBLK  00038300
         LTR   0,0                                                      00038400
         BE    *+8                                                      00038500
         LA    1,1(1)                  FORM EXACT NUMBER OF SUBBLOCKS   00038600
         LR    7,8                                                      00038700
         IC    7,=X'00'                FORM TTR0                        00038800
         N     8,=F'255'           FORM 000C                            00038900
         LA    8,1(8)                                                   00039000
         SR    12,12                   EXACT STARTING BLOCK             00039100
SETOVR   SRL   12,1                                                     00039200
         O     12,=X'80000000'                                          00039300
         BCT   1,SETOVR                                                 00039400
ONEBK    BCT   8,OVR1                                                   00039500
* R1 HAS INITIAL DISPLACEMENT =0                                        00039600
TESTIT   CH    1,MAX+2                 SCAN DISPL CURRENT DISPL.?       00039700
         BNL   ADDTOEND            IF YES, EXIT                         00039800
         C     7,MAX+4(1)                                               00039900
         BE    GOTER                                                    00040000
         LA    1,8(1)                                                   00040100
         B     TESTIT                                                   00040200
GOTER    O     12,MAX+8(1)                                              00040300
         ST    12,MAX+8(1)                                              00040400
         B     EXIT12                                                   00040500
ADDTOEND CH    1,MAX                                                    00040600
         BNL   *+8                                                      00040700
         LA    1,8(1)                                                   00040800
         ST    7,MAX-4(1)              STORE TTR0                       00040900
         ST    12,MAX(1)               STORE PATTERN                    00041000
         STH   1,MAX+2                 RESET COUNT                      00041100
EXIT12   EQU   *                                                        00041200
         LM    14,12,12(13)                                             00041300
         BR    14                                                       00041400
OVR1     SRL   12,1                                                     00041500
         B     ONEBK                                                    00041600
         ENTRY DELBLOB                                                  00041700
         DROP  13                                                       00041800
         USING DELBLOB,15                                               00041900
DELBLOB  STM   14,12,12(13)                                             00042000
         L     15,A                                                     00042100
         USING NEWBLOB,15                                               00042200
         B     DEBLOB                                                   00042300
         DS    0F                                                       00042400
A        DC    A(NEWBLOB)                                               00042500
         LTORG                                                          00042600
         ENTRY NXTHOLE                                                  00042700
NXTHOLE  DC    F'0'                    TTR0 OF NEXT WHOLE BLOCK         00042800
MAX      DC    F'0'                    MAX,CURR BOUNDARY AND CURRENT    00042900
*                                      EXTENT OF AVS LIST IN BYTES.     00043000
         DC    200F'0'                                                  00043100
         EJECT                                                          00043200
*        ON ENTRY,                                                      00043300
*              R1 => USER'S DATA DET NAME                               00043400
*                                                                       00043500
         ENTRY NUMTRACK                                                 00043600
INIT     ENTER                                                          00043700
         MVI   NOP+1,X'00'      FALL YHROUGH FIRST TOME                 00043800
         LR    2,1             SAVE ADDRESS OF READ DECB                00043900
         RDJFCB  (BACKUP)                                               00044000
         SPACE 2                                                        00044100
         L     3,EXLST             GET WHERE TO PUT DSNAME IN JFCB      00044200
*        R2 POINTS TO DS NAME (PASSED IN AS PARAM)                      00044300
*        R3 POINTS TO JFCB                                              00044400
         MVC  0(44,3),0(2)           MOVE USER'S DSNAME INTO JFCB       00044500
         OPEN  (BACKUP,(INPUT)),TYPE=J                                  00044600
         OPEN  (HYPRTEXT,(OUTPUT))                                      00044700
         L     5,=A(TOPNODE)           WHERE TO RESD INTO               00044800
         SR    4,4          FOR NUM OF TRACKS ERAX                      00044900
READLOOP READ  READER,SF,,(5),MF=E READ A TRACK IN                      00045000
         CHECK READER                                                   00045100
         WRITE WRITER,SF,,(5),MF=E WRITE A TRACK OUT                    00045200
         CHECK WRITER                                                   00045300
         LA    4,1(4)                HAVE JUST READ ANOTHER TRACK       00045400
NOP      NOP   READLOOP                                                 00045500
         L     6,=A(NXTHOLE)                                            00045600
         MVC   0(256,6),900(5)       MOVE IN AVS                        00045700
         MVC   256(256,6),1156(5)                                       00045800
         MVC   512(256,6),1412(5)                                       00045900
         MVC   768(40,6),1668(5)                                        00046000
         L     5,=A(SWAP)      ADDRESS OF BIG = REGULAR BUFFER          00046100
         MVI   NOP+1,X'F0'                                              00046200
         B     READLOOP                                                 00046300
DONEMOVE CLOSE (BACKUP,,HYPRTEXT)                                       00046400
         OPEN  (HYPRTEXT,(INOUT))                                       00046500
         STH   4,NUMTRACK         SAVE NUMBER OF TRACKS READ            00046600
         L     1,=A(TCBMSS)      SHALL POINT TO BOUNDARY BOX            00046700
         L     2,16                    CVT                              00046800
         L     2,0(2)                  TCBQ                             00046900
         L     2,4(2)                  CURTCB                           00047000
         L     2,24(2)                 TCBMSS                           00047100
         ST    2,0(1)    TCBMSS POINTS NOW TO BOUNDARY BOX              00047200
RETURN   L     13,4(13)         HSA ADDR                                00047300
         RETURN  (14,12)                                                00047400
         EJECT                                                          00047500
*        ON ENTRY,                                                      00047600
*              R1 = 0 =>  CLOSE WORKAREA DCB                            00047700
*              R1 ¬= 0 => KEEP WORKAREA DCB OPEN                        00047800
         ENTRY END                                                      00047900
         DC    CL4'END'            IDENTIFIER                           00048000
         USING *,15                TEMP BASE REG                        00048100
END      STM   14,12,12(13)        SAVE REGS                            00048200
         LR    14,13               SAVE HSA ADDR                        00048300
         L     13,=A(INIT+12)      SET UP BASE REG                      00048400
         ST    14,4(13)            CHAIN BACK                           00048500
         ST    13,8(14)            CHAIN FORWARD                        00048600
         DROP  15                                                       00048700
         USING INIT+12,13                                               00048800
         LR    9,1                 SAVE INPUT PARAM                     00048900
         L      10,=V(TOPNODE)                                          00049000
         L      12,=V(NXTHOLE)                                          00049100
         MVC    900(256,10),0(12)                                       00049200
         MVC   1156(256,10),256(12)                                     00049300
         MVC   1412(256,10),512(12)                                     00049400
         MVC   1668(40,10),768(10)                                      00049500
         POINT HYPRTEXT,TTR     WHERE TO WRITE OUT TOPNODE              00049600
         LA    6,HYPRTEXT          DCB ADDR                             00049700
         ST    6,WRITER+8          PUT IN DECB                          00049800
         WRITE WRITER,SF,,(10),MF=E    PUT TOPNODE OUT ON WORKAREA      00049900
         CHECK WRITER              PUT NODE OUT ON WORKAREA             00050000
         OPEN  (BACKUP,(OUTPUT))                                        00050100
         ST    6,READER+8          WANT TO READ FROM WORKAREA IN COPY   00050200
         LA    6,BACKUP            WHERE TO WRITE THRU (DCB)            00050300
         ST    6,WRITER+8          PUT DCB ADDR IN DECB                 00050400
         WRITE WRITER,SF,,(10),MF=E    PPUT TOPNODE OUT ON BACKUP DSET  00050500
         CHECK WRITER                                                   00050600
         MVC   HYPRTEXT+33(3),=AL3(CLOSE)    SET UP EODAD ADDR IN WORK  00050700
         L     5,=A(SWAP)          IN CASE COMING BACK UP, DON'T CLOBBE 00050800
         B     READLOOP            COPY WORKAREA TO BACKUP DSET         00050900
         ENTRY CLOSE                                                    00051000
CLOSE    MVI   HYPRTEXT+48,X'12'   CLEAR TAPE MARK BIT & 'HAVE TAKEN    00051100
*                                  USER EXIT' BITS IN DCBOFLGS FIELD    00051200
         MVI   HYPRTEXT+44,0       CLEAR ERROR ROUTINE IN CONTROL FLAG  00051300
         LTR   9,9                 IF ¬= 0, DON'T CLOSE WORKAREA DCB    00051400
         BNE   KEEPSCRT                                                 00051500
         CLOSE (HYPRTEXT)                                               00051600
KEEPSCRT CLOSE (BACKUP)                                                 00051700
         XC    HYPRTEXT+33(3),HYPRTEXT+33      CLEAR EODAD ADDR FOR     00051800
         B     RETURN                                                   00051900
TTR      DC    F'256'           TTR OF WHERE TO WRITE TPONODE           00052000
         EJECT                                                          00052100
NUMTRACK DC    H'0'             SAVES NUMBER OF TRACKS IN DS            00052200
         READ  READER,SF,BACKUP,MF=L                                    00052300
         WRITE WRITER,SF,HYPRTEXT,MF=L                                  00052400
HYPRTEXT DCB   DDNAME=WORKFILE,DSORG=PS,LRECL=&BKSIZE,BLKSIZE=&BKSIZE, X00052500
               DEVD=DA,MACRF=(RP,WP),RECFM=F                            00052600
BACKUP   DCB   DDNAME=HFILE,DSORG=PS,LRECL=&BKSIZE,BLKSIZE=&BKSIZE,    X00052700
               DEVD=DA,MACRF=(R,W),EODAD=DONEMOVE,EXLST=EXLST           00052800
         ENTRY HYPRTEXT                                                 00052900
EXLST    DC    AL1(135),AL3(SWAP)  WHERE TO READ JFCB INTO              00053000
         LTORG                                                          00053100
BYTES    EQU   &BKSIZE                                                  00053200
N        EQU   32                                                       00053300
BENT     EQU   (BYTES/N)/4                                              00053400
NUM      EQU   1                                                        00053500
NUMQ     EQU   900     LENTH OF A NODE                                  00053600
L        EQU   12                                                       00053700
V        EQU   4                                                        00053800
         END                                                            00053900
