:READ  SCRUNCH  ASSEMBLE C1 WORK    3/26/19  22:00
*                                                                       00000100
*        THE OLD DATA IS STORED TEMPORARILY IN BEGIN'S HUGE STORAGE     00000200
*        AREAS.  THE TOP HALF OF THE ORDERS IS THEN SCRUNCHED ON TOP OF 00000300
*        ITSELF AND THE STRIGS ARE PLACED ON THE OLD DATA PAGE.  THE    00000400
*        LENGTHS OF BOTH ARE UPDATED.  TWO NEW PAGES ARE THEN CREATED.  00000500
*        THE ORDERS AND DATA FOR THE BOTTOM HALF ARE THEN SCRUNCHED     00000600
*        ONTO THESE TWO NEW PAGES.  THE COPY OF THE STRINGS IN BEGIN IS 00000700
*        THE NEXT TIME THE DATA STRUCTURE IS SCANNED.                   00000800
*                                                                       00000900
SCRUNCH  ENTER                                                          00001000
         MVI   NOP+1,X'00'             INITIALLY NOOP                   00001100
         L     6,=V(TABPNT)   ADD OF ADD OF PAGE TO BE SPLIT(THROUGH ID 00001200
         L     5,0(6)                  R5 POINTS AT 'OUR' PAGE IN CORE  00001300
         OI    4(5),X'40'         HOLD IN CORE PAGE BEING SPLIT         00001400
         L     3,8(5)                  ADD OF DATA PAGE TO BE PLIT      00001500
         LH    2,6(3)             LENTH OF DATA PAGE                    00001600
         L     10,4(5)                 ADD OF OLD ORDERS PAGE           00001700
         LA    10,0(10)                CLEAR HIGH ORDER BITS(I.E. BYTE) 00001800
*                                                                       00001900
*        R3 = OLD DATA ADDRESS                                          00002000
*        R2 = R4 = LEN OF DATA                                          00002100
*        R5 = ENTRY IN IDTABLE                                          00002200
*        R6 = TABPNT                                                    00002300
*        R10 = OLD ORDERS ADDRESS                                       00002400
         EXTRN DISPLAY,OPOINT                                           00002500
         MVI   NOUPDAT+1,X'F0'         SET AS BRANCH                    00002600
         MVI   NOCHK+1,X'F0'           SET AS BRANCH                    00002700
         L     15,=A(OPOINT)           ADDR OF POINTEROF WHERE DISPLAY  00002800
         CLC   0(4,5),0(15)            PAGE BEING SCRUNCHED VS OPOINT   00002900
         BNE   GOT                     IF NOT THE SAME, NO PROBLEMS     00003000
         LH    6,10(15)                DISP WITHIN ORDER FIRST SCANNED  00003100
         LH    7,6(15)                 DISP TO FIRST ORDER SCANNED      00003200
*        R7 = DISP IN ORDERS FROM OPOINT                                00003300
*        R6 = DISP WITHIN ORDER FROM OPOINT                             00003400
         L     0,0(15)                 PAGE NAME BEING SCANNED          00003500
         ST    0,BLOCK                 SET UP TO RE-SET OPOINT          00003600
         MVI   NOUPDAT+1,X'00'         CLEAR BRANCH TO NOOP             00003700
         MVI   NOCHK+1,X'00'           CLEAR BRANCH TO NOOP             00003800
GOT      L     11,=A(DISPLAY)          WHERE TO MOVE THE DATA SECT      00003900
         LA    11,10(11)               JUMP PAST THE GRAPHIC ORCDERS    00004000
         MVC   0(12,11),0(3)      MOVE DATA PAGE HEADER TO WHERE PAGE   00004100
*                                 BEING SCRUNCHED INTO                  00004200
         LH    5,6(10)                 LENGTH OF ORDERS ITEM            00004300
         LR    9,3                R9 POINTS AT OLD DATA(PAGE THAT IS)   00004400
*                                 I.E. WHERE DATA WILL BE MOVED FROM    00004500
         STM   10,11,NEWADDS           SAVE ADDS OF TOP OF NEW PAGES    00004600
         A     10,8(10)                R10 POINTS AT FIRST ORDER        00004700
         LR    8,10                    R8 INDEXES THROUGH OLD ORDERS    00004800
         A     9,8(9)                  ADD DISP TO DATA                 00004900
         A     11,8(11)                ADD DISP TO DATA                 00005000
         SR    3,3                     R3 INDEXES THRU ORDERS           00005100
         S     5,=F'12'                SUBTRACT LENGTH OF PAGE HEADER   00005200
         SRL   5,1                     DIVIDE ORDER LEN BY 2            00005300
LOOP1    CR    5,3                     HAVE WE GONE HALF WAY DOWN YET   00005400
         BNH   DONE1                   YES, GO TAG LAST ORDER           00005500
         IC    2,0(3,8)                INSERT TYPE OF ORDER             00005600
         N     2,=XL4'3F'              ZAP ANY HIGH ORDER BITS          00005700
         SLL   2,1                     MULTIPLY BY 2                    00005800
         AH    3,ORDRSLEN(2)           ADD CORRECT ORDERS LENGTH        00005900
         B     LOOP1                   COMPARE AGAIN                    00006000
ORDRSLEN DC    H'4,8,12,12,4,8,8,4,8,8,4'                               00006100
DONE1    AR    3,8                     R3 NOW POINTS TO MIDDLE ORDER    00006200
         OI    0(3),X'80'              SO FLAG IT AS THE LAST ORDER     00006300
         AR    7,8                     OPOINT DISP IN ORDERS + TOP OF O 00006400
SETREG   ST    10,0(13)                SAVE ADD OF TOP OF NEW ORDERS    00006500
         LA    12,4                    BEGINNING OF DATA DISP = 4       00006600
         LA    11,4(11)                R11 POINTS PAST THE WORD WITH ST 00006700
***R11 INDEXES THRU NEW DATA                                            00006800
***R10 INDEXES THRU NEW ORDERS                                          00006900
***R9 POINTS TO TOP OF OLD DATA                                         00007000
***R8 WILL INDEX THROUGH THE OLD ORDERS                                 00007100
SCRNCHLP SR    3,3                     ZERO                             00007200
         IC    2,0(8)                  INSERT ORDER TYPE                00007300
         N     2,=XL4'3F'              CLEAR OUT ANY FLAGS              00007400
         SLL   2,2                     MULTIPLY BY 4                    00007500
NOUPDAT  B     BRANTAB                 SWITCH SET EITHER WAY            00007600
         CR    7,8                     FIRST ORDER SCANNED VS ORD BEING 00007700
         BNE   BRANTAB          BRANCH IF FIRST SCAN ORDER NOT HIT      00007800
         C     2,=F'4'                 IF CHAR STRING, THEN WILL        00007900
         BE    BRANTAB                 BE CAUGHT LATER IN SCRNCHLP      00008000
         BAL   1,SETOPNT               GO RESET OPOINT                  00008100
BRANTAB  B     *+4(2)                  BRANCH TO RIGHT TYPE ROUTINE     00008200
         B     NOOP                                                     00008300
         B     STRING                                                   00008400
         B     BRNCHLNK                                                 00008500
         B     BRNCHLNK                                                 00008600
         B     FORMAT1                                                  00008700
         B     TAG                                                      00008800
         B     LABEL                                                    00008900
         B     NOOP               DON'T WANT OLD EDIT PARA'S ANYMORE    00009000
         B     LABEL                   TYPE 8 = DECIMAL LABEL           00009100
         B     TAG                                                      00009200
         B     FORMAT1                                                  00009300
SETOPNT  ST    6,8(15)                 SET UP NEW DISP WITHIN ORDER     00009400
         LR    6,10                    TO PRESERVE R10                  00009500
         S     6,0(13)                 TO GET NEW DISP IN ORDERS        00009600
         ST    6,4(15)                 STORE NEW DISP IN OPOINT         00009700
         L     6,BLOCK                 NEW PAGE NAME (OLD OR NEW)       00009800
         ST    6,0(15)                 PUT IN OPOINT                    00009900
         MVI   NOUPDAT+1,X'F0'         PUT NOOP'S BACK TO BRANCHES      00010000
         MVI   NOCHK+1,X'F0'                                            00010100
         BR    1                                                        00010200
NOOP     TM    0(8),X'80'              CHECK IF LAST ORDER              00010300
         BO    BACKUP                  YES, BUT MUST BACK UP NEW ORDERS 00010400
         LA    8,4(8)                  INCREMENT OLD ORDERS             00010500
         B     SCRNCHLP                GO SCRUNCH SOME MORE             00010600
STRING   MVC   NEWORDER(8),0(8)        SET UP TYPE OF NEW ORDER         00010700
         BAL   14,SCRUNCHR             GO SCRUNCH AS MUCH AS POSSIBLE   00010800
         B     END1                                                     00010900
BRNCHLNK CLI   PHLAGG,1                IF LITTLE SCRUNCH, NOOP          00011000
         BE    BRLKNOP                 BRANCHES AND LINKS               00011100
         MVC   NEWORDER(12),0(8)  MOVE OLD ORDER TO TEMT AREA           00011200
         SR    2,2                     PREVENT ADDR BOMB                00011300
         IC    2,1(8)                  GET LENGTH OF EXPLAINER          00011400
         LH    3,2(8)                  GET DISP OF EXPLAINER            00011500
         AR    3,9                     GET ADDR OF EXPLAINER            00011600
         STH   12,NEWORDER+2           STORE DISP FOR NEW ORDERS        00011700
         AR    12,2                    INCREMENT DISP                   00011800
         BAL   1,MOVEIN                MOVE EXPLAINER TO TEMP DATA AREA 00011900
         MVC   0(12,10),NEWORDER       MOVE BACK NEW ORDER              00012000
         TM    0(8),X'80'              IS THIS LAST ORDER ?             00012100
         BO    ONEDONE                 YES, DONE WITH UST HALF          00012200
         LA    10,12(10)               INCREMENT NEW ORDERS INDEX       00012300
         LA    8,12(8)                 INCREMENT OLD ORDERS INDEX       00012400
         B     SCRNCHLP                GO SCRUNCH SOME MORE             00012500
TAG      MVC   NEWORDER(8),0(8)                                         00012600
         SR    2,2                     PREVENT ADDR BOMB                00012700
         LH    2,2(8)                  GET LENGTH                       00012800
         LH    3,4(8)                  GET ADDR                         00012900
         AR    3,9                     GET ADDR OF OLD DATA             00013000
         STH   12,NEWORDER+4           STORE NEW DISP OF TAG EXPLAINER  00013100
         AR    12,2                    INCREMENT DISP                   00013200
         BAL   1,MOVEIN                MOVE TAG TO NEW DATA SECTION     00013300
END1     MVC   0(8,10),NEWORDER        PUT IN NEW ORDER                 00013400
         B     END2                                                     00013500
LABEL    CLI   PHLAGG,1                IF DOING LITTLE SCRUNCH,         00013600
         BE    LABNOP                  DON'T MOVE LABEL TO NEW PAGE     00013700
         MVC   0(8,10),0(8)       MOVE ORDER FROM OLD TO NEW            00013800
END2     TM    0(8),X'80'              IS THIS LAST ORDER ?             00013900
         BO    ONEDONE                 YES, DONE WITH 1ST HALF          00014000
         LA    8,8(8)                  NO, INCREMENT OLD ORDERS INDEX   00014100
         LA    10,8(10)                INCREMENT NEW ORDERS INDEX       00014200
         B     SCRNCHLP                GO SCRUNCH SOME MORE             00014300
FORMAT1  MVC   0(4,10),0(8)            MOVE OLD ORDER TO NEW ORDER LOC  00014400
         TM    0(8),X'80'              IS THIS LAST ORDER               00014500
         BO    ONEDONE                 YES, DONE WITH 1ST HALF          00014600
         LA    10,4(10)                INCREMENT NEW ORDER'S INDEX      00014700
         LA    8,4(8)                  INCREMENT OLD ORDERS INDEX       00014800
         B     SCRNCHLP                GO SCRUNCH SOME MORE             00014900
LABNOP   TM    0(8),X'80'         LAST ORDER TO BE SCANNED ?            00015000
         BO    BACKUP                                                   00015100
         LA    8,8(8)             LOOK AT NEXT ORDER                    00015200
         B     SCRNCHLP           LOOP AGAIN                            00015300
BRLKNOP  TM    0(8),X'80'         LAST ORDER ON PAFE ?                  00015400
         BO    BACKUP             IF SO, GO SET NEW ORDERS POINTER CORR 00015500
         LA    8,12(8)            OTHERWISE, INCREMENT PAST BRANCH/LINK 00015600
         B     SCRNCHLP           KEEP LOOKING AT ORDERS                00015700
NEWORDER DC    3F'0'                   FOR CONSTRUCTING NEW ORDERS      00015800
BACKUP   CLI   PHLAGG,0                ON A LITTLE SCRUNCH THAT MOVED   00015900
         BE    *+12                    NOTHING AT ALL INTO THE PRESENT  00016000
         C     10,ORDERTOP             BLOCK, DON'T BACKUP SINCE AM     00016100
         BE    ONEDONE1                ALREADY AT TOP OF BLOCK          00016200
         LR    1,10                    OTHERWISE, BACK NEW ORDER POINT  00016300
         BCTR  1,0                     POINTS AT ORDER CODE OF LAST ORD 00016400
         SR    2,2                                                      00016500
         IC    2,0(1)                  R2 HAS ORDER CODE OF LAST ORDER  00016600
         SLL   2,1                     MULTIPLY BY 2                    00016700
         SH    10,ORDRSLEN(2)          R10 NOW POINTS AT LAST ORDER     00016800
         B     ONEDONE1                DONE WITH THIS HALF OF, ORDERS   00016900
***ROUTINE TO SCRUNCH STRINGS TOGETHER                                  00017000
*        R8    POINTS TO CURRENT OLD ORDER                              00017100
*        R9    POINTS TO TOP OF OLD DATA                                00017200
*        R10   POINTS TO CURRENT NEW ORDER                              00017300
*        R11   POINTS TO TOP OF NEW DATA                                00017400
*        R12   HAS DISP OF NEW DATA                                     00017500
SCRUNCHR L     4,MAXLEN                MAX LENG FOR STRING              00017600
         SR    5,5                     WILL HAVE LENGTH OF NEW STRING   00017700
         STH   12,NEWORDER+4           STORE DATA DISPLACEMENT          00017800
SCRLOOP  LH    2,2(8)                  LOAD 2 WITH LENGTH OF CURR STRNG 00017900
         LH    3,4(8)                  LOAD 3 WITH DISP OF CURRENT STRG 00018000
         AR    3,9                     ADD DISP TO OLD DATA ADDR        00018100
         SR    4,2                     DECREMENT 4 BY CURRENT LENGTH    00018200
         BC    4,FINISH2               IF NO ROOM THEN DON'T SCRUNCH    00018300
NOCHK    B     MOVER                   SWITCH                           00018400
         CR    7,8                     FIRST ORDER SCANNED VS CUR OLD O 00018500
         BNE   MOVER                   IF HAVEN'T REACHED YET           00018600
         AR    6,5                     OLD DISP IN ORDER + NEW ORDER    00018700
*                                      LENTH TO THIS POINT = NEW DISP I 00018800
*                                      ORDER                            00018900
         BAL   1,SETOPNT               SET UP (ADJUST) OPOINT           00019000
MOVER    AR    5,2                     INCREMENT LENGTH OF NEW STRING   00019100
         BAL   1,MOVEIN                MOVE CURRENT DATA TO TEMP AREA   00019200
         TM    0(8),X'80'              IS THIS LAST ORDER               00019300
         BO    FINISH1                 YES, FINISH UP SCRUNCH           00019400
SEEIFSAM CLI   8(8),0             IF NEXT ORDER NOOP, LOOK PAST IT      00019500
         BE    SKIPNOOP           PAST MNOOP                            00019600
         CLC   8(1,8),NEWORDER         IS NEXT OLD ORDER THE SAME       00019700
         BNE   FINISH1                 NO, FINISH UP SCRUNCH            00019800
         LA    8,8(8)                  INCREMENT CURRENT ORDER          00019900
         B     SCRLOOP                 SCRUNCH SOME MORE                00020000
SKIPNOOP LA    8,4(8)             INCREMENT FOR NOOP                    00020100
         B     SEEIFSAM           GO LOOK AT PRDER AFTER NOOP           00020200
FINISH2  S     8,=F'8'                 SINCE THERE WAS NO ROOM          00020300
FINISH1  STH   5,NEWORDER+2            STORE LENGTH OF NEW STRING       00020400
         AR    12,5                    INCREMENT NEW DISP IN DATA       00020500
         BR    14                      RETURN                           00020600
MAXLEN   DC    F'0'               MAX LENTH OF STRINGS => FILLED IN BY  00020700
***MOVES DATA FROM OLD AREA TO NEW AREA--STANDARD METHOD                00020800
*        R2    HAS LENGTH TO BE MOVED                                   00020900
*        R3    HAS ADDR OF WHERE TO MOVE FROM                           00021000
*        R11   HAS ADDR OF WHERE TO MOVE TO                             00021100
MOVEIN   CH    2,=H'256'                                                00021200
         BL    ARND                                                     00021300
         MVC   0(256,11),0(3)                                           00021400
         LA    3,256(3)                                                 00021500
         LA    11,256(11)                                               00021600
         SH    2,=H'256'                                                00021700
         B     MOVEIN                                                   00021800
ARND     LTR   2,2                                                      00021900
         BZ    0(1)                                                     00022000
         BCTR  2,0                                                      00022100
         EX    2,MOVEREST                                               00022200
         LA    2,1(2)                                                   00022300
         AR    11,2                                                     00022400
         BR    1                                                        00022500
MOVEREST MVC   0(0,11),0(3)                                             00022600
ONEDONE  EQU   *                                                        00022700
ONEDONE1 OI    0(10),X'80'             SET 'LAST ORDER' FLAG ON LAST NE 00022800
         CLI   PHLAGG,1                IF DOING LITTLE SCRUNCH,         00022900
         BE    LITLSCRU                GO OFF YONDER ABD DON'T CREATE   00023000
         IC    2,0(8)                  LENG OF LAST ORDER PUT IN        00023100
         N     2,=XL4'3F'                                               00023200
         SLL   2,1                     MULTIPLY BY TWO                  00023300
         AH    8,ORDRSLEN(2)           R8 POINTS JUST PAST LAST OLD ORD 00023400
         IC    2,0(10)          LEN OF LAST ORDER PUT ON PAGE           00023500
         N     2,=XL4'3F'       ZAP ANY LOOSE BITS                      00023600
         SLL   2,1                                                      00023700
         AH    10,ORDRSLEN(2)                                           00023800
         S     10,NEWADDS              R10 HAS LENTH OF NEW ORDERS SECT 00023900
         L     3,NEWADDS               R3 POINTS AT NEW ORDERS SECT     00024000
         L     1,4(3)                  R1 HAS OLD LENTH OF ORDERS       00024100
         SR    1,10                    R1 HAS APPROX LENTH OF ORDERS LE 00024200
         LA    1,12(1)                 FOR PAGE HEADER                  00024300
         ST    10,4(3)                 STORE LENGTH IN ID               00024400
         LR    0,11                    R0 POINTS TO END OF NEW DATA     00024500
         S     0,NEWADDS+4             R0 HAS LENTH OF NEW DATA PAGE    00024600
         STM   6,7,NEWORDER            SAVE OPOINT STATISTICS           00024700
         ST    15,0(13)                SAVE POINTER TO OPOINT           00024800
         L     6,NEWADDS+4             ADDR OF NEW DATA PAGE            00024900
         L     12,4(6)                 OLD LENTH OF DATA PAGE           00025000
         SR    12,0                    R12 HAS APPROX LEN OF DATA LEFT  00025100
         LA    12,16(12)               FOR PAGE HEADER AND STRING LENTH 00025200
         ST    0,4(6)                  STORE NEW LENTH OF DATA PAGE     00025300
         S     0,=F'12'                R0 NOW HAS LENTH OF STRINGS      00025400
         ST    0,12(6)                 PUT LENTH OF STRINGS IN TOP OF D 00025500
NOP      NOP   ALLOVR                  FALL THRU 1ST TIME               00025600
         MVI   NOP+1,X'F0'             BRANCH THE SECOND TIME           00025700
         L     7,=V(COUNTER)           ADD OF ID NAMES                  00025800
         L     2,0(7)                  R2 CONTAINS THE NEXT AVAILABLE N 00025900
         TM    3(7),X'01'              MAKE NAME EVEN                   00026000
         BZ    *+8                                                      00026100
         LA    2,1(2)                                                   00026200
         ST    2,BLOCK                 WHERE TO PASS NAME TO MAINTAIN   00026300
         ST    1,BLOCK+4               LENTH OF NEW CREATED ORDERS      00026400
         MVI   BLOCK+4,X'80'           SAY CREATE                       00026500
         LA    1,BLOCK                 ADDRESS OF PARAMETER LIST FOR MN 00026600
         L     15,=V(MAINTAIN)                                          00026700
         BALR  14,15                   GO CREATE NEW ID                 00026800
         L     10,BLOCK+8              ADD OF PAGE JUST CREATED         00026900
         STH   12,BLOCK+6              LENTH OF DATA PAGE TO BE CREATED 00027000
         OI    BLOCK+3,X'01'           DATA ID NAME                     00027100
         L     15,=V(MAINTAIN)                                          00027200
         BALR  14,15                   GO CREATE NEW ID                 00027300
         L     11,BLOCK+8              ADD OF DATA PAGE JUST CREATED    00027400
         STM   10,11,NEWADDS SAVE ADDRESSES OF 'NEW' PAGES              00027500
         LA    14,12                   DISP TO ORDERS AND DATA          00027600
         ST    14,8(10)                PUT IN DISP TO ORDERS            00027700
         ST    14,8(11)                PUT IN DISP TO DATA              00027800
         ST    2,0(10)                 PUT PAGE NAME IN ORDERS PAGE     00027900
         LA    2,1(2)                                                   00028000
         ST    2,0(11)                 PUT PAGE NAME IN DATA PAGE       00028100
         LA    2,1(2)                  R2 CONTAINS NEXT AVAILABLE PAGE  00028200
         ST    2,0(7)                  RESTORE COUNTER WITH NEXT NAME   00028300
         AR    11,14                   R11 NOW POINTS AT WHERE DATA WIL 00028400
         AR    10,14                   R10 NOW POINTS WHERE ORDERS WILL 00028500
         LM    6,7,NEWORDER            GET BACK JUNK FROM OPOINT        00028600
         L     15,0(13)                RELOAD POINTER TO OPOINT         00028700
         B     SETREG  SET             R12,STORE R10,ADD4 TO R11 & SCRU 00028800
ALLOVR   SR    2,2                     GET VF PAGE NAME                 00028900
         NI    BLOCK+3,X'FE'           GET ORDERS NAME                  00029000
         L     8,BLOCK                 PRESERVE NAME OF CREATED PAGE    00029100
         ST    2,BLOCK                 RETRIEVE VF                      00029200
         MVI   BLOCK+4,X'40'           SAY 'RETRIEVE' PLEASE            00029300
         LA    2,4                     INCREMENT                        00029400
         ST    2,BLOCK+12                                               00029500
         LA    1,BLOCK                 ADDRESS OF PARAMETER LIST        00029600
         L     15,=V(MAINTAIN)                                          00029700
         BALR  14,15                   GO GET HIM                       00029800
         L     3,=V(VFADD)             WHERE TO STORE VF ADDRESS        00029900
         L     2,BLOCK+8               GET NEW ADDRESS OF VF            00030000
         ST    2,0(3)                  STORE NEW VF ADD IN VFADD        00030100
         L     3,0(2)                  GET DISP TO NEXT ENTRY IN VF     00030200
         LR    4,3                     SAVE LENTH OF VF                 00030300
         LA    4,4(4)                  INCREMENT LENTH OF VF            00030400
         ST    4,0(2)                  STORE UPDATED LENTH IN VF        00030500
         AR    3,2                     R3POINTS TO WHERE NEXT ENTRY GOE 00030600
         LA    2,4(2)                  R2 POINTS AT TOP OF TABLE PROPER 00030700
         L     1,=V(OPOINT1)           ID BEING SPLIT                   00030800
FINDLOOP CLC   1(3,2),1(1)             SEARCH VF FOR ID BEING SPLIT     00030900
         BE    FOUND                                                    00031000
         LA    2,4(2)                  INCREMENT VF POINTER             00031100
         B     FINDLOOP                LOOP AGAIN                       00031200
FOUND    S     3,=F'4'                 DECREMENT END OF TABLE POINTER   00031300
         CR    3,2                     BOTTOM OF TABLE VS OUR GUY       00031400
         BNH   PUTIN                   IF HAVE MOVEDALL OF TABLE BELOW  00031500
         MVC   4(4,3),0(3)             MOVE END ENTRY DOWN              00031600
         B     FOUND                   LOOP AGAIN                       00031700
PUTIN    IC    4,0(2)                  GET LAST BIT, IF THERE           00031800
         ST    8,4(2)                  PUT CREATED PAGE NAME IN VF      00031900
         STC   4,4(2)                  PUT BACK HIGH ORDER BIT          00032000
         MVI   0(2),X'00'              CLEAR TAG OF THIS IF IT LAST PAG 00032100
         L     1,=V(IDTABLE)           ADDRESS OF TOP OF TABLE          00032200
         CLI   0(1),X'FF'              IS TABLE COMPLEETLY EMPTY ?      00032300
         BE    BOMB                    THIS IS VERY BAD IF IT HAPPENS   00032400
         TM    4(1),X'80'              LAST ENTRY IN TABLE ?            00032500
         BO    *+12                    IF IT IS, STOP LOOP              00032600
         LA    1,12(1)                 OTHERWISE INCREMENT TO NEXT ENTR 00032700
         B     *-12                    LOOP AGAIN                       00032800
         XI    4(1),X'80'              CLEAR END OF TABLE FLAG          00032900
         LA    1,12(1)                 R1 POINTS TO WHERE NEXT PAGE GOE 00033000
         ST    8,0(1)                  PUT CREATED PAGE NAME IN IDTABLE 00033100
         MVC   4(8,1),NEWADDS          PUT ORDERS AND DATA ADD IN TABLE 00033200
         MVI   4(1),X'80'              TAG AS LAST ENTRY                00033300
         L     5,=V(TABPNT)     R5 => IDTABLE ENTRY OF PAGE JUST SPLIT  00033400
         L     5,0(5)                  R5 POINTS AT ENTRY IN IDTABLE FO 00033500
         NI    4(5),X'BF'              CLEAR THE HOLD BIT ON IT         00033600
         L     11,8(5)            ADDR OF DATA PAGE IN CORE (WHERE TO)  00033700
         L     3,=A(DISPLAY)      WHERE FROM                            00033800
         LA    3,10(3)            POINT AT REAL PAGE TOP                00033900
         LH    2,6(3)             GET NEW PAGE LENTH                    00034000
         BAL   1,MOVEIN           MOVE PAGE FROM DISPLAY TO PAGE        00034100
PARTYOVR L     13,4(13)                                                 00034200
         RETURN (14,12)                                                 00034300
NEWADDS  DC    2F'0'                                                    00034400
BLOCK    DC    5F'0'                                                    00034500
         EJECT                                                          00034600
*********************************************************************** 00034700
*                                                                     * 00034800
*        POINTER TO DATA FOR THIS BLOCK                               * 00034900
*                                                                     * 00035000
*********************************************************************** 00035100
*                                                                     * 00035200
*       LENTH OF ORDERS FOR THIS BLOCK                               *  00035300
*                                                                    *  00035400
*********************************************************************** 00035500
*                                                                     * 00035600
*       LENTH OF DATA FOR THIS BLOCK                                 *  00035700
*                                                                     * 00035800
**********************************************************************  00035900
*                                                                     * 00036000
*        POINTER TO NEXT BLOCK(ZERO IF NONE)                          * 00036100
*                                                                     * 00036200
**********************************************************************  00036300
         ENTRY MAXLEN                                                   00036400
         EXTRN IDTABLE                                                  00036500
         ENTRY RSCRUNCH                                                 00036600
         ENTRY LENDATA                                                  00036700
         ENTRY LENORDER                                                 00036800
         USING *,15                                                     00036900
RSCRUNCH STM   14,12,12(13)                                             00037000
         LR    14,13                                                    00037100
         L     13,=A(SCRSAV01)                                          00037200
         ST    13,8(14)                                                 00037300
         ST    14,4(13)                                                 00037400
         DROP  15                                                       00037500
         MVI   NOCHK+1,X'F0'           SET SWITCHES SO OPOINT WON'T     00037600
         MVI   NOUPDAT+1,X'F0'         BE CHANGED IN SCRNCHLOP          00037700
         MVI   PHLAGG,1                SET FLAG TO 'LITTLE SCRUNCH IN   00037800
         SR    4,4                                                      00037900
         ST    4,LENDATA                                                00038000
         ST    4,LENORDER                                               00038100
         LR    2,1                                                      00038200
         LA    5,FIRSTIME                                               00038300
         MVC   BLOCK+4(4),0(2)                                          00038400
GITPAGE  LA    1,BLOCK                                                  00038500
         ST    4,BLOCK+8                                                00038600
         L     15,=V(GETITEM)                                           00038700
         BALR  14,15                                                    00038800
         L     8,12(1)                                                  00038900
         L     9,16(1)                                                  00039000
         LA    9,12(9)                                                  00039100
         BR    5                                                        00039200
REGSAVE  DS    6F                                                       00039300
LENDATA  DS    F                                                        00039400
LENORDER DS    F                                                        00039500
ORDERTOP DS    F                                                        00039600
DATATOP  DS    F                                                        00039700
FIRSTIME L     6,=A(DISPLAY)      WHERE TO PUT SCRUNCHED ORDERS         00039800
         LA    10,26(6)                                                 00039900
         CLC   0(4,2),12(2)                                             00040000
         BE    SAMEPAGE                                                 00040100
         L     3,=V(VFADD)        ADDR OF ADDR OF VF                    00040200
         L     3,0(3)             R3 => TOP OF VF                       00040300
         L     5,0(3)             LENTH OF VF                           00040400
         SRL   5,2                VF LENTH 0/2 = NUM OF TIMES TO LOOP   00040500
LUPE     LA    3,4(3)             POINT AT NEXT VF ENTRY                00040600
         CLC   1(3,3),1(2)        VF ENTRY VS 1ST PAGE IN PARM LIST     00040700
         BE    FOUNDOUT                                                 00040800
         BCT   5,LUPE                                                   00040900
BOMB     ABEND 9                  BOMB BECAUSE OF SCREWY VDFVF          00041000
FOUNDOUT EQU   *                                                        00041100
         LR    4,13               REG 4 ¬= 0 => HAVE TO SCRUNCH ANOTHER 00041200
         L     11,4(8)                                                  00041300
         S     11,4(2)                                                  00041400
         AR    11,10                                                    00041500
SETUP    ST    11,8(6)            SET DATA ADDR AT HEAD                 00041600
         ORG   *-1                                                      00041700
         DC    AL1(10)                                                  00041800
         A     8,4(2)                                                   00041900
         STM   10,11,ORDERTOP     SAVE TOP ORDERS AND DATA ADDS         00042000
         LA    12,1               INITIAL DATA DISP                     00042100
         MVC   0(8,10),INITORD    SET UP FIRST ORDER ( U 1 BLANK)       00042200
         LA    10,8(10)           POINT PAST THAT ORDER                 00042300
         AR    11,12              POINT DATA POINTER PAST BLANK         00042400
         B     INTOSCRU+2         DON'T GIVE INITIAL DATA DISP OF 0     00042500
         STM   10,11,ORDERTOP     SAVE ADDS OF TOP OF DATA AND ORDERS   00042600
INTOSCRU SR    12,12              INITIAL DATA DISP = 0                 00042700
         MVI   0(10),0            SET LITTLE FLAG TO SEE IF ANYTHING(OR 00042800
         LA    8,12(8)            ADD LEN OF PAGE HEADER TO OLD ORDERS  00042900
         STM   2,7,REGSAVE                                              00043000
         B     SCRNCHLP                                                 00043100
LITLSCRU LM    2,7,REGSAVE                                              00043200
         LR    5,10               SAVE POINTER TO LAST ORDER            00043300
         CLI   0(10),X'80'        HAVE ANY ORDERS BEEN MOVED IN ?       00043400
*                                 CHECK .LITTLE FLAG SET BEFORE SCRUNCH 00043500
         BE    NOINCR    IF NONE HAVE, THEN DON'T POINT PAST LAST ONE   00043600
         IC    9,0(10)            POINT NEW ORDERS REG PAST LAST ORDER  00043700
         N     9,=XL4'3F'         ZAP HIGH ORDER BITS                   00043800
         SLL   9,1                                                      00043900
         AH    5,ORDRSLEN(9)      R5 NOW KJUST PAST LAST ORDER          00044000
NOINCR   L     12,ORDERTOP             POINT AT FIRST ORDER IN THIS     00044100
         SR    5,12                                                     00044200
         S     12,=F'12'                                                00044300
         ST    5,0(12)                                                  00044400
         A     5,LENORDER                                               00044500
         ST    5,LENORDER                                               00044600
         LR    5,11                                                     00044700
         S     5,DATATOP                                                00044800
         ST    5,4(12)                                                  00044900
         A     5,LENDATA                                                00045000
         ST    5,LENDATA                                                00045100
         LTR   4,4                                                      00045200
         BNZ   VOICI                                                    00045300
         STC   3,12(7)                                                  00045400
         L     7,20(2)                                                  00045500
         LTR   7,7                                                      00045600
         BZ    TESTFIRS                                                 00045700
         STH   7,2(10)                                                  00045800
TESTFIRS L     7,8(2)                                                   00045900
         LTR   7,7                                                      00046000
         BNP   FIN                                                      00046100
         STH   7,10+16+8+4(6)     DATA DISP OF FIRST REAL ORDER = DISP  00046200
*                                 TO FIRST LP HIT (W DISP WITHIN ORDER) 00046300
         BCTR  7,0                                                      00046400
         LH    11,10+16+8+2(6)    GET LEN OF FIRST REAL ORDER           00046500
         SR    11,7               NEW LEN = OLD LEN 0-- DISP TO HIT     00046600
         STH   11,10+16+8+2(6)    PUT BACK AS LEN OF FIRST ORDER        00046700
         LA    11,8                                                     00046800
         C     11,10+4(6)         IF LEN OF ORDERS IN FIRST BLOCK = 8,  00046900
        BNE   *+8                THEN ONLY BLAMK ORDER THETE.  SO SET   00047000
         MVI   10+16(6),X'81'     HIGH ORDER BIT OF BLANK ORDER         00047100
FIN      STH    7,10+16+4(6)       HAVE DATA DISP OF FIRST ORDER (INIT  00047200
*                                 BLANK) POINT AT BLANK                 00047300
          A     7,10(6)            POINT JUST BEFORE FIRST CHAR OF FIRS 00047400
*                                 REAL ORDER (MOVED ORDER)              00047500
         MVI   0(7),C' '          MOVE IN VB BLANK FIR FIRST ORDER      00047600
         SR    7,7                NEXT LINK = ZERO                      00047700
         ST    7,8(12)                                                  00047800
         MVI   PHLAGG,0                CLEAR LITTLE SCRUNCH FLAG        00047900
         B     PARTYOVR                                                 00048000
VOICI    LA    11,3(11)           ROUND POINTER OFF TO NEXT FULLWORD BO 00048100
         SRL   11,2               KILL LOW ORDER BITS                   00048200
         SLL   11,2               GET BACK ORIG NUM                     00048300
         ST    11,8(12)           SET UP LINK TO NEXT BLOCK             00048400
         SR    4,4                                                      00048500
         MVC   BLOCK+5(3),5(3)    MOVE NEXT PAGE FROM VF TO PARM LIST   00048600
         BAL   5,GITPAGE                                                00048700
         CLC   5(3,3),13(2)       NEXT VF ENTRY VS 2ND PARM PAGE        00048800
         BE    LASTIME            BRANCH IF HAVE LOOKED AT ALL PAGES    00048900
         LA    3,4(3)             POINT AT NEXT VF ENTRY                00049000
         LR    4,13               SET FLAG SO WILL GO TO VF AGAIN       00049100
         LR    7,11                                                     00049200
         LA    11,16(11)                                                00049300
         LR    10,11              R10 => WHERE NEW ORDERS GO            00049400
         A     11,4(8)                                                  00049500
         ST    11,0(7)                                                  00049600
         B     INTOSCRU-4         SAVE TWO TOP ADDS AND SCRUNCH         00049700
LASTIME  L     7,16(2)                                                  00049800
         LA    7,28(7)                                                  00049900
         LR    3,11                                                     00050000
         AR    11,7                                                     00050100
         ST    11,0(3)                                                  00050200
         LA    10,16(3)           POINT PAST BLOCK HEAD AT ORDERS (SOON 00050300
         STM   10,11,ORDERTOP     SAVE ADDS OF TOP OF ORDERS & DATA     00050400
         LA    5,INTOSCRU-4       WHERE TO RETURN OUT OF PHOENIX        00050500
PHOENIX  L     7,16(2)                                                  00050600
         AR    7,8                                                      00050700
         IC    3,12(7)                                                  00050800
         OI    12(7),X'80'                                              00050900
         BR    5                                                        00051000
SAMEPAGE BAL   5,PHOENIX                                                00051100
         L     11,16(2)                                                 00051200
         S     11,4(2)                                                  00051300
         LA    11,16(11,10)                                             00051400
         B     SETUP                   SAVE REGS ABD MOVE INIRIAL ORDER 00051500
INITORD  DC    X'0100000100000001'    A CHAR ORD OF LEN = 1             00051600
PHLAGG   DC    X'0'                                                     00051700
         END                                                            00051800
